{
    "url": null,
    "title": "A Breath of Fresh Air (4K OFFICIAL)  Nick Di Paolo",
    "transcript": " Ladies and gentlemen, for 30 years you may have been thinking it, but this gentleman's been saying it. Give it up for Nick Topolo! Oh yeah! How are you? Thank you! Wow! Holy shit! You guys are cheering like it's the prices right. Relax, this is a... It's a beautiful place. It's the type of place where a senator would get assassinated in 1860s. This is class. This is Cajos. Mila light cans lined up by the fucker. God bless it. Those are the working class people that I love. God damn it. Look to my left, I thought it was a bowling alley. How are you fellas? Good luck in the tournament. Toxic white European... there's no respect for white European males anymore. I realized this, I was in Jersey last night working in Jersey. I had to get on the turnpike to come home. I had to go to the bathroom of the Jersey turnpike, so I pull into a rest area. What's the name of the rest area? The Vince Lombardi rest area. That's the best we can do for the greatest coach in the history of the NFL. Should we put a statue of him in front of his high school? No, let's build an 18x24 brick structure after exit 13A. Where truckers who have been living on hooker pussy and beat jerky for 14 hours can unload their impacted bowels. Where gay guys can exchange filthy blowjobs at 3am and where pedophiles can come into the faces of terrified children. You know the shit that Vince Lombardi was for. I'm gonna put a statue of him in front of his high school. The fucking Vince Lombardi rest... where's the Jerry Sandusky rest area? That's my question. That's the rest area I want to see. Life-sized statue of Jerry in a bathing suit, half a heart on, big smile on his face. A couple of Boy Scouts and headlocks. Fucking white toxic males. How about Jesse Smullet? Is that the feminine black toxic fucking femininity? What a genius. You know why he did all that? He said he wasn't getting paid enough. $65,000 an episode. Well it turns out after that hoax they figured out in 3 seconds you're a pretty shitty actor I guess. Imagine a white guy trying to pull that off. Fucking reverse hate crime. I'd have to get two white bodybuilders from Sweden, put them in blackface. Fucking beat me up, make it look like it was two black guys leave a pack of newports next to me. Jump, break, kool-aid over my head. And I'd set it and then go fuck you this is Obama country. I'd set it in Salt Lake City naturally. What a scumbag. I hope he still has that fucking noose and he uses it the right way this time. Yeah. Jesse, go downstairs, find a beamer. You know what to do. Fuck it down. Some of yous will laugh and the rest of yous I can see is shit in your little faggy fucking liberal pants. I'm woke, okay? And I'm on the right, motherfuckers. Drove up here. I live in Westchester and I drove up, made here in like under two hours. I got a ticket last time. You fucking Nazis on the tachanica. Can't you get enough cops? Doing 106, you know. My buddy was with me, he goes, you're doing 106. I'm like, so what? He goes, well, we hit a deer when dead. I said a deer at this speed if we hit a fucking moth. It's gonna go through like a hollow point bullet. You shit me? What are you? So I use the Waze app. I love the, anybody use the, well, 20 of us, the rest is what? Getting raped in Uber cars on the weekend. How many Uber rape stories have you read in the paper in the last year? I've read like three. You know, if you're an ugly girl, you can't get a date on a Saturday. I just call Uber, okay? They'll be happy to take to your sister's house, you'll wake up in the driveway, your skirt over your head. What happened? Am I there? They'll send her like a Haitian on bath salts to pick you up. Go ahead, give me that fucking. That would be $22 mon. Put on your shoes. I love that Waze app. I fucking love it. You know, because I love it. I love that Waze app. I fucking love it. I, you know, because it tells you where the cops are and I still sell Coke to school children in the afternoon. So that kind of works out good. Do you know who come up with the Waze app? The Israeli military. That's kind of ironic when you think about it because Jews are known best for what? Being lost in the desert for 40 years. Flooding up ahead Moses. What's this? A Palestinian crowd all of a sudden? What the fuck? I use the Waze app to drive into New York City every night to work on my act and I live 40 miles outside of New York City. I do the first 38 miles in 38 minutes. I get into Manhattan. I look down and it says one mile to go, 27 minutes. There's marathon runners who run a sub four minute mile. I'm going to turn my car into a fucking Kenyan tomorrow. I get like 20 miles on a bowl of rice and some Japanese beetles, you know what I'm saying? I smoke now. I started smoking a year ago. I fucking love it. I'm not going to stop so shut your mouth. Makes me feel good. My friends are going, why would you start at this age? I go, why would you start in your 20s so you could have cancer in your 40s? I'm timing it out. The doctor tells me I have cancer in 30 years. I'm going to kiss him on the lips. You shit me? Do you see many happy 87 year old guys out there? They all look in their face like, I wish I fucking smoked when I was a kid. Laying in a puddle of my own piss. Nobody's talking to me. Get me a cigarette. God damn it. Fucking love it. Smoke a lot. Trying to quit it is kind of nasty, but my buddy says, why don't you try those e-cigarettes? I said, because I look more manly with a cock in my mouth. That's why I go. That's fucking cigarette that has steam coming off it. What am I going to do? You're salmon and your vegetables? Come here Pete. What's that? Broccoli? Hey Dave, you got a wrinkle in your shirt. Come here, I'm getting lightheaded. Fucking e-cigarettes. You know why I smoke? It draws attention. Just like doing comedy. It's like having a mic in your hand. Take a cigarette. Everybody's staring at it like a psycho. I get off a plane in Buffalo. I go outside of the airport. The whole sidewalk is no smoking signs until you get to the end. Then I have Dave that's a little glass booth for smokers. It looks like a bus stop. I'm in there at seven in the morning by myself and there's like ten people looking in watching me. I felt like a fucking polar bear. Ah! Smokey the... Ah! We know it kills you. We know it's bad for you. How should I take this? My wife's a smoker. She actually got me started on smoking a little bit. I come down the stairs the other morning and there's a note on the kitchen table that says, I went grocery shopping but I left you this. It's a cigarette. PS, I love you. I might as well have left the fucking syringe with AIDS all over it. Stick this into the head of your cock. I'll be home with some fresh carrots that you'll need. Cosby. I was reading... Bill Cosby today. I was reading the paper. He doesn't really like prison and... Everybody's so shocked when that story broke. Oh yeah, black rapist from Philly. What are the odds? I can hear two pussy liberals going, ah! The guys with Miller light cans. You hear the fucking assholes? Oh! That was racist. Have another beer and die please. Black racist from Philly. I never liked Cosby. He's a fucking pompous asshole. I didn't like when he was telling young black kids to pull up their pants. Meanwhile, the last 30 years, he's had his down to his ankles every fucking night. Shut your mouth, Billy. I know he's guilty of rape. I hate Bill Cosby. My uncle Al loves Bill Cosby. So I took my uncle Al to see Bill Cosby in Atlantic City like 12 years ago. This is how I know he's guilty of rape. We went backstage after the show to meet him. I shake his hand. Next thing I remember, I'm waking up in his hotel room. I'm on the floor wearing nothing but a Templi University t-shirt. I got put in pop wrappers, stuck to my ass and back. All I remember is hair and his, I'm gonna stick my dick in his little guinea's ass all over my back. I was raped by Bill Cosby. True story. He's a fucking rapist. Look, I don't condone what he did, but I understand it. Ladies, let me explain before you jump down my throat. Your women get a little long winded at 3 in the morning when we're trying to fuck you. You know what I'm saying? I just spent 40 bucks on your red lobster. It's 4 in the morning. I finally got you on my cow trap to hear about your cousin's wedding in a Ruben X march. Fuck that shit. Look over there. Plop plop, vis vis. You better fuck me. I'll call Uber. Somebody's gonna get laid. It might be you, it might be me. I don't give a shit. Fuck. That wasn't a very good Cosby impression I did earlier. All my black comedian friends do a great Bill Cosby. They have him raping everybody in their act. They have a new 10 jokes every week. I do a great Popeye impression. If Popeye goes on a raping spree, I'll have a new half-up. Fuck me, dick. It's consensual. Put away that rapesicle. Wow. Yeah, I don't condone what he did, but he's a serial rapist, Bill Cos. When you hear serial and crime, you think white guy off the bat, all the... 99% serial killers are white guys, right? Yes, the answer will be yes, fuck faces. Look, I'm as biased as anybody. Boy, this is a real right wing town. No, that's not true. I don't get a shit... What you stats out? There's a lot of black fucking child rapists in here. The serial killers are mostly fucking white. Remember Patrice O'Neill, my fat black friend, the fucking great... Okay, he hated white. Relax with your applause, all right? Listen, but we always argue about that. He always said white boys and serial killers are white boys. I'd be watching the news, there'd be a story about a serial killer, my phone would ring. I'd pick it up and all I was hearing was white boy click, fuck a pat... Patrice. And I thought about it and he's right. You know, most serial killers are white, but you know why? To be a serial killer takes a lot of effort. It's like a full-time job. It's true. You gotta follow the kid around his elementary school for six months and... You have to go online for like 12 hours, find out what kind of chemicals dissolve bones in a tub in 10 minutes and... It's not like black crime, you know? You step on somebody's foot in the champagne room at a teddy bar, so you shoot them on the dance floor 30 seconds later. Yeah, I wonder if the detectives can figure this one out. This is a real puzzle. This black crime is just quick and fucking simple. You know that show, the first 48, they have a new one, the first 48 seconds. It's just black crimes. Wow, the balcony's packed too. Holy shit. Nice going, Gahove. And I noticed he wasn't lumped in in the hashtag me too thing, Cosby. Apparently he was above that. He was actually pissed about it, you know? His wife's still defending Cosby and he didn't do anything wrong. Bill's next door, he's got like pubes in his teeth. I didn't do shit, man. I was like, man, man, man. Fucking hashtag me too. What a crock of shit, okay? I was with that movement for a few minutes, then you took it way too far, like most you lesbians do. You go fucking crazy. You know what I learned from hashtag me too from the whole thing? Guys are just hornier than women. That's all I learned from that whole thing. The guy who said, who's horny, a man or woman, my wife? Cos that's about even. And then I proceeded to tell her this story and she hasn't brought the subject down for about two years. Hey, guys are just horny. When I was 14 years old, going through puberty, I used to fuck my bed pillow till I came at least three times a week. By the time Friday rolled around, I was like sleeping on a microwave oven. I couldn't tell. Are there any statute of limitations on these hashtag me too? Guys are being sued for rape 25 years later? I'm in a case right now. A woman sued me. The case is 51 years old. She said I kept touching her tits and I'm like, yeah, it's called breastfeeding, mom. Get off the fucking, let it go. But like Harvey Weinstein is a piece of shit. He should be in jail. He's a fucking legitimate rapist, in my opinion. Okay. Don't lump him in with my buddy Louie, who likes to whip his prick out next to the punch ball every few fucking weeks. I mean, come on, we've all done that, right? Fellas? Sometimes you're out with a girl on a date, she's not picking up the vibe, how much you like her? You have to give her a hint, you know? The fuck? One of those girls said she has post-traumatic stress syndrome from seeing Louie's dick. Oh, really? That's the equivalent. Seeing a guy's cock is the equivalent of watching your buddy being blown up in fucking Iraq with an IED, you whore, really? Louie was my old roommate. I lived with him for a year and a half back in the 90s. I saw his dick maybe 12 times, let's say four times consensually, to be honest with you, but, you know... But these broads get on their fucking hype. I see Whoopi Goldberg talking about hashtag me too. What the fuck does she know about sexual harassment? At what zoo? Who fuck wants a sex tree, has a fucking beanbag chair with dreads? I mean, what the fuck... Joy Behar? When's the last time she was finger popped on the Mayflower in 1650? That skank? Fucking... Fucking dick could land on the bridge of her nose, she wouldn't know what it was. Fucking Matt Lauer, that's the one that really pissed me off. Matt Lauer had a button under his desk in the office, he could lock his door and lock his secretary in, and I'm like, what the fuck, why didn't I think of that? I have an office and a desk and a... But then I remembered I'm fucking married, would I make a lock my wife in? Did you finish FBLT yet? You're not going anywhere, how fucking... Back in the corners. Fucking Harvey Weinstein. You think it's revenge of the nerds, like him and Louie didn't get pussy before they were rich and famous, you think Harvey Weinstein get a lot of pussy, they don't know how to handle it. He was asking 20-year-old fucking actresses, would you like to watch me take a shower? Yeah, Harvey, I moved out here from Oklahoma to become an actress, but I'd rather watch you rinse your big grey Jew balls in the sink at the Four Seasons on Hollywood Boulevard, that's why I'm here. We can do anything men can do, we can do any... This is what I've been hearing my whole life, we can do anything men can do, we can do anything men can do. If that's true, how come every time I get on a plane today, I'm not on the plane two seconds a woman comes up to me, can you help me lift my bags? Now I have something to say, no, hashtag me too bitch, fucking lift them yourself. Got an 18-inch neck and a mullet, you can lift those bags, who are you shit you man-hater? Can't lift them because your husband's head and legs are in there, that's why you can't fucking lift them, you're a man-hating machine, young lady. Fucking hashtag me too. All this shit, and they're trying to blame all this racism and sexism on fucking Trump. What a crock of shit. You know, I didn't like Trump as a TV personality, but I love him as a politician, okay? Fucking love him. They did everything they could to keep him alive. They did everything they could to keep him alive. They did everything they could to keep him alive. They did everything they could to keep him from becoming president. Ooh, we have a videotape of Trump saying he likes to grab pussies. Oh, but Hillary doesn't? Where's that videotape? Their face buried in a giant muffin Yale in 1976, he's stuff, look like a lion's mane, they didn't shave back then, it's, they did everything they could. He was fucking bullshitter and he's a salesman, which is what the fucking job calls for, this company's a corporation. You should have picked that up when he was running for president, he sounded just like a salesman. He was telling people what they wanted to hear. Mr. Trump, Mr. Trump, put anybody on your healthcare plan. We'll be the healthiest people alive. Next question, please. We'll have white teeth, we'll be orange and tan. They'll be beautiful, they'll be beautiful. Mr. Trump, what about your tax plan? Don't be any taxes, I'll pay you, just fucking vote for me, I have to beat this fat bitch. Don't embarrass me up here, please. Can you guys not do that, whoever's farting over there in section six? We have microphones everywhere. I can love them. Hillary's still out this evening, well I lost because of sexism, well there was other reasons, first of all it wasn't sexism, you're a guy, how can you lose, fucking guys hate guys, is that sexism? But there were other things, she wasn't the healthiest candidate, right? There were little subtle hints that she wasn't very healthy, like a nine inch shit stain in her pants suit as she's going up this time. Remember her trying to get into that SUV, she's like the elephant man, you know? I'm not an animal, I'm a human being. This is a secret service, get in the truck, they can see your shit stains, those are M&Ms, fuck you, those. I'm not an animal, I'm a human being, I... You're a thick ankle dog face lying whore, is what you are, a money dropping power hungry, fucking limp who turned into a corporate shell. I would love to wake up and find out she passed away in her sleep last night, I would be ecstatic, I would jerk off to the autopsy photos, okay? And her name cause she's pretty, I'd be like, ah the wicked witch is dead. There you go, Hillary, you've probably never seen this before. Bill's downstairs, the cops are interviewing me as a wife beater, I'll fuck them. I don't know what happened, I heard a big thump upstairs, she banged her head at some shit, I don't know what the fuck happened. I gotta go fucking fuck this IHOP wait about 20 minutes, can you clean this shit up? I gotta get out of here. And you young people, Bernie Sanders, you thought he was gonna be your savior, the old Bernie Sanders, the old wrinkled Jew who... You guys thought you were gonna, I'm talking about the young people, okay? You thought you were gonna get free handjobs, chocolate ice cream, red wagons, fucking... Just an old bit of Jew who couldn't make it. I like when Bernie talks, it's like he's writing an imaginary letter to Santa Claus, you know. I know a few girls got sexually harassed on my campaign a few years ago, their kids were wrapped in the shower and somebody picked up on somebody, I... I didn't know about it, I was so busy making the case, we'll try to do better. You fucking kids, get off my lawn. I like him, he's out of his mind but he's a miserable, I like miserable people who are just fucking unhappy for no reason whatsoever. He actually, the most interesting story during that election was about Bernie Sanders, you guys can google this, he used to write erotica from magazine in New York City. He wrote an article saying, when women are having sex with their husbands, they're secretly fantasizing about being raped by three guys at once. That's how you know he's a real socialist, even in his rape fantasy he's sharing the pussy three ways. I want to redistribute pussy, it's trickling up to the one percent, they're getting all the pussy. Sex is pig, but he hides it. The other reason Bernie lost, other than it was rigged, he couldn't get the black vote, he could not get the black vote. I kept emailing him, change your first name to Colonel, the fuck, right in front of you, wake up. If you don't like that joke, you're dead inside or you're a liberal, either way, I got a black lady laughing her ass off, she knows the truth. Kind of a young version of Esther Rolls sitting right there, fucking beautiful. Yeah, I fucking love Trump, you know. Wants to build the wall, I think that's stupid. Why build the fucking wall when you have machine guns and flamethrowers? Another great joke, wasting on faggy, liberal, mindfucked MSNBC watchers. We don't even talk about using weapons in defense, what a fucking wheel are we? You gotta tell me if you picked off one of those creeps coming over the fence, anybody else would follow for the next ten years, answer me. Answer me, you fucks, no. Okay, you don't have to kill him, that's a little too medieval for you people. Okay, just a super soka filled with cat piss, just fucking drench him. Be inventive with the wall, make it like the green monster at Fenway, you don't put seats at the top, people with rifles. Every time a legal gets killed, the guy comes out and puts a one up on the board. Put up a crooked number, Trump, I will. Trump actually had a great idea during the, he couldn't have come up with this line, somebody must have given him this line. They were saying, the press a couple weeks ago, a wall is medieval. And Trump goes, well, a wheel is medieval, we're still using that. It's a great fucking line. You should compromise, make the wall out of wheels. Thirty feet up, that wouldn't work, the Mexicans, I would be missing hubcaps after the first three weeks. You know, all the people floating across the river with the tires. There's a hole in the wall, it's floating through that thing. I watch a lot of Fox News, you might have picked up on that a little bit. I don't watch it for the right wing slant, I watch it for the pussy, let me be honest. You gotta admit, right, the girls are really pretty on Fox, fellas, you have to, come on, Martha McCallum, fellas, you wouldn't boil her panties, make a nice hard side of yourself. Shannon Breen, do you know how many times I've masturbated to Shannon Breen today? About seven. Fucking stunning. And thanks to the pause button on my remote control, I know what all these women look like with their eyes closed and their mouth open. Shannon Breen's like, and the president met with a con- Look at honey, she's licking my face, she likes me. Shannon, you want communion? Oh, she's Catholic. It's kind of embarrassing, your wife walks in, you get your pants down on your ankle, she's like, what are you watching? I'm like, Hannity, what the fuck you think I'm watching? Somebody has a discerning eye for beautiful women who does the hiring at Fox and I'm ruling out Shepard Smith. I don't like Trump, he looks like a guy that used to beat me up. Okay, Shepi. The other reason I watch Fox News is for the commercials, all the products of the people in their late 90s. And I'm starting to want some of this shit. There's a fine line between somebody in their 90s and a lazy guy in his 50s, you know? Who doesn't want a tub with a fucking door that opens? I'm 57 years old, I have the balls of a great dane, I don't want to do this in front of the mirror every morning. Oh, Jesus Christ. The acorn stairlift, you don't want an acorn stairlift in your house? You come home shit-faced on a Saturday night, that staircase to your bedroom looks like Mount fucking Everest, you shit-ly. You strap yourself in. The white's coming down the stairs, fuck you bitch, I'm drunk, catch me. I'm drunk, I'm drunk, I'm drunk. Close lander. I love those commercials for the acorn stairlift. The woman's like 90, 70 years old, you can't tell if she's going upstairs or to heaven. She's late again, she's late. Grammy hasn't taken a good dump in three weeks, I might see her, I might not. Catheter, who doesn't want a catheter? Come on. It's three in the morning, you want to get up to piss? Fuck that, run a tour for my dick to the toilet, I'm not getting up. I'm staying in bed and counting my Rosendale Gold Capital medals. Hello, I'm William DeVay, I know! I'm a little, I'm right way, but I'm not a fucking religious fanatic, I'm not a... Anybody religious here? I'd love to ask them this question in New York, not once has anybody raised... I might as well go, who's got hep C? Religion, how do you catch that? That's gross, huh? Step on a dirty nail, how do you catch religion? I'm not religious either, folks, but I admire religious people, I hate people who hate religious people. I admire them because they believe in something, they actually believe in something, I believe in nothing. I'm fucking empty inside, I'm like a chocolate Easter Bunny, I'm hollow, I have no fucking... My mother's very religious, 81 years old goes to church every Sunday, she told me I'm supposed to live my life the way Jesus slipped his. Well that's set in the bar a little high, isn't it, my money? Jesus rose from the dead, I can't get up before noon time after 6-0 dulls. Jesus forgave the very people that killed him, I haven't talked to my best friend since high school because he's filled you who on my letter jacket. Jesus was in a cave with a rock in front of it and disappeared, I get caught in a fucking revolving door at the back for 20 minutes the other day, you know what I'm saying? You know what I'm saying? My mother's religious believes in heaven and all that shit, my dad doesn't believe in any of it, and they're both in their 80s, they're getting near the end of the line. And I notice my mother is a lot more comfortable with the concept of dying than my dad is, he's always talking about it, he's nervous about it. My mother thinks she knows where she's going, it's like watching two people pack for a long trip. One of them already has a room reserved at the Hyatt Hotel, meanwhile my dad's ripping through a yelp two minutes before the plane leaves. All these rooms are tiny with no air conditioning and bright red, yes, welcome to the Motel 666, my place, you're gonna burn and help. Yeah, my dad doesn't believe in that stuff, and you know, religious people take it too far though, this is why people start to hate religious people. I'm watching a story in the news the other night, a young girl's behind the wheel driving, she looks down at her phone and drifts into oncoming traffic, was killed by an 18-wheeled truck instantly. Her mother's on the news that night going, God called her home today. Well, if you look at the accident report, he texted her, number one. And number two, I mean, what kind of religion kills people with trucks, right? I mean, that's right, Islam. That's right, great joke, great joke, yeah, light it up white people. You know, I mean, she looked down and God texted her, I guess, I don't know, I don't care how much of an aid to show, you look down and the text says delivered by God, you're gonna pull over. And then you see a fucking eggplant emoji, he's like, oh, it's my friend Bill with a big black dick, that's what's busting my balls for. You young people better stop with the texting behind the wheel, people are getting killed left and right, I feel more comfortable that you assholes are off the road, but that's not how I want to see you done, I mean, but yeah. Again, all so sensitive, oh my nipples, that one's stung, Nick, that was a little too much, we all know somebody who, no you don't. They have a whole campaign targeted to young people, it's called It Can Wait, in other words, a text can wait, you shouldn't look at it, that's not all texts can wait, let's be honest. Let's say you're a 14 year old boy in high school, you've been drooling over this girl in English class for two years, she never talks to you, all of a sudden she fucking texts you at three in the morning, I want to blow you behind the fud ruckers in ten minutes. That text cannot wait, my friends, okay? If I'm that kid I'll be telling the story the rest of my fucking life in a wheelchair, I'll tell you. I couldn't believe it, she's tongue my balls and then she's biting my nipples and she never even looked at me, I couldn't believe it, I am one of these, so bad, I can't, look I'm doing Donaldson so happy. Okay, let's go to a titty bar, does the gold club have ramps? Let's go, let's go, it's a big... What's that got to do with religion? I digress, I'm sorry, back to the religion. But the problem with religion is you don't get to pick it, right, when you're a kid they slap it on you. Like I'm Catholic, I didn't pick that, I was like ten months old, I'm naked, they bring me to some Catholic priest, they splash water on my face, I'm hoping that was water, I've been hearing stories, I felt a lot like hair gel to me, but I'm pretty sure my mom knows, I trust my mom, I'm pretty sure I was safe with three priests naked dunking me in water. I think that's called waterboarding, isn't it mom, what the fuck? But the other thing about confession, how creepy that is, I mean I know it's easy to pick on Catholicism, but some of it is creepy. Confession, what am I, eight, nine years old, I have to go into a dark closet with a grown man and tell him my sins through a little window? I might as well be reading him a penthouse letter for Christ's sake. By the time I'm done confessing that little window looks like the bottom of a parakeet's cage. Two gross, okay the sneeze guard at the Harris Buffet at Vegas at three in the morning. Why am I telling him I'm nine years old, I looked at Karen Conway's tits for two seconds, telling this to a guy who's got the shit of a cup scout on his nuts, why am I telling this guy? Wow, I turned into a fucking anisos member with that type of material. It's creepy, I gotta admit though, some of the shit is really creepy. Now the Bible, I'm reading the Bible, sure I was, and a lot of that stuff is wrong, they don't even mention the pyramids in the Bible. The pyramids are around a thousand years before the Bible was written and then somebody explained to me the reason it's not mentioned, the people who wrote the Bible don't want to acknowledge the accomplishments of their oppressors. It's sorta like Chuck Todd not mentioning Trump's economy and Meet the Press. It's a great joke, how did they fucking, even back then the Jews controlled the media apparently. That you laugh at, okay, Kaho's, I'm the fucked up one. You were waiting for the anti-Semitic part to laugh, the first part you were offended by. Right, the Bible was their social media, scripture used to be a letter from Paul to the Corinthians, now it's a tweet from Michael Moore to the Republicans, you know, it's all the... I like the Cain and Abel story, that's my favorite one out of all the Bible things, you know, Adam and Eve's kids, they offered gifts to God, God accepted one of them to accept the other one, their brother got killed, Cain killed his brother Abel. But Cain was a farmer, he offered wheat and grain to God. Why would you offer wheat and grain to the guy that created the universe? That's like giving Bill Gates a fucking gift card to Best Buy, huh? Ooh, 20 cents off a USB cable, thanks a lot Timmy, I fucking invented it you asshole, what else you got for me? And then Cain got pissed so he killed his brother and God punished him and said, you have to wander the earth aimlessly for the rest of your lives. Reminds me of a father's day that we had at our house a few years ago. I gave my dad a $120 Armani sweater, my brother gave him like a $12 necktie, he never wears my sweater, wears the fucking tie every day. I mean I didn't kill my brother over, I pinned him down and gave him 10 twists for like 45 minutes but... Then my dad punished me and made me wander the earth aimlessly, if you don't believe it, look at my tour dates at nickdip.com. Thank you, that deserves a smattering. And then the food, you know, Muslims can't eat pork, that's the other white meat that they hate and... Oh, we can't laugh at that even though we hate them at home, we're not going to laugh in public at that, we're not going to... This is a TV taping. Jewish people, their food, kosher food rules, they make me belly laugh. You can't eat an animal unless it was killed humanely. Okay, does it dear that I vaporized on the Saumau Parkway at 180 miles an hour and I was drunk? Does that count? I'm pretty sure I didn't feel anything, I was still in about a buck 60 and sucking on his antlers, getting off the exit. These are delicious, I don't think he felt a thing. Can't eat the animal unless it was killed humanely. I picture a rabbi strapping his pet goat into the passenger side of his Volvo and turning on the car and shutting the garage door. Ah, ah, ah, ah, I can't breathe. You can't eat it unless the fucking thing was killed humanely. And the other rule in kosher food, when you're killing the animal, you gotta do one slice, you can't saw the neck back and pull it. So we know OJ is in the juke, right? I think we can do that. Too soon for that one folks, it was 48 years ago. Swen like I get fucking John this up here, how does it go in here? Keep those borders open. Keep those borders open. I'm glad I get to drive, I do any gigs that I don't want to get on the plane any fucking more. I went to Bogarton last week and the first time I got on the plane in about six months, I reminded me why I don't do it any... Person in front of me, emotional support puppy, lady behind me, emotional support cat. People are riding llamas and shit, fucking deer. But don't bring a peanut on the plane, that might fucking, somebody that could be allergic to a peanut. I get 19 inches of cat dander on my forehead, but don't show me a payday bar, that's like rice in motherfucker, get that shit out of my way. Tired of traveling and hotel, you know, I guess I'm a nationalist, I lean right, I don't know what the fuck I am, I'm a nationalist and I'm white, but I'm not supposed to say that. I believe in the country as a whole and I'm white, but don't say that, that makes you a Nazi. Suck my ass. Suck my ass. If you lean right in your politics, people on the left say when you use the word globalist that's code for Jew. Now they're telling me what my words fucking mean. Although they might have a point, I was trying to sell my car the other day, this guy was really globaling me down. I need a good lawyer, anybody know what globalist? I mean, discapair you, I don't know what to say to you. But the progressives love to show off their brains, you can't get away from it, you know, fucking, I'm confronting globalists every... I'm checking into the Hyatt Hotel in Boston, beautiful hotel, girl behind the counter goes to me, would you like the green eco package? And I go, okay, what kind of Matt Damon wet dream are you about to explain to me? And sure enough I was right, she goes, for every day here that you don't use the maid service, we'll give you 500 points on your next day at a Hyatt hotel. And I said to her, I guess you don't know what married guys do when they finally get to a hotel by themselves alone with their iPad, U-Porn, unlimited lotion, pizza delivery menus. You should see my bed after the first half hour, looks like there was a gang rape at a Papa John's. There's DNA on their headboard, marinara sauce on the comforter, a whole chicken caucus under the sheets. They have to call in Matt Hooper from Jaws to find out what happened to my bed. Well, this was no boat in accident. And I wasn't a hooker on the rag either, do you call the cops? This is ridiculous. This is obviously the non-frenzied feeding of a bitter headliner's, but on the road for 31 years. You get a bigger problem, he's still out there touring Martin. Does that bother you people? Hotels are not washing the bedding under the guise of conserving water. I said to the fucking lady, yeah, they're not washing the bedding. I said to the lady, did the guy that stayed in my room before me, did he have the green eco package? I'm with the people that stayed in the room before him, did they have the eco package? I'm not going to be rolling around to somebody's mother, to severe Plaxarius's sweat for the next three days. It's quite safe. Conserving water, so Kimba in Nigeria could have a drink without a mouthful of fish eggs. Tough shit, he was born in a shit hole. You were at the president, it's not my fault. I'm just trying to wash my hair and clean my ass. So I go in to use the shower at the Hyatt and Boston, they have a water-saving shower head. It took me 40 minutes to get my hair damp. Just standing there fucking fuming for like 40 minutes and finally I felt the drop. Turns out I was crying, I was so goddamn angry. It was like an 80 year old guy pissing on me with a large prostate. Now you people are saying, Nick, how do you know what that's like? Well, I had some money problems when I got out of college and I did what I had to do. I am not homophobic, I'll do anything for cash, let's be honest. I hooked up with Ben Clausen and... Then I go to use the toilet. I look in the toilet, there's two tablespoons of water in the toilet total. Two tablespoons. I just spent 60 bucks on myself at Chipotle, I don't think that's gonna get it done. 70 pounds of beans and rice, that's gonna take it out to the Hudson, I don't know. I think you might want to give me an eye drop more, that's not gonna... Fucking... All to conserve water, all these weird rules. You know, if you don't flush the toilet the whole time you hear at the high, you know, cut to me squatting over an ice bucket at three in the morning, fucking... I'm gonna see the Dominican Republic from 50 bucks, I'm not gonna flush that fucking toilet, I'm gonna get 500 points and take my wife, I think she'll enjoy that. Fucking this much water, we're recycling shit water? What the fuck? There's not a temperature high enough that you can boil my shit water that I want to back in my life for the next 40 years, okay? Let the DeSanti company scoop it up and sell it to people in nice plastic bottles, okay? Give me the place, thank you. Then I go to, you know, we're recycling shit water, do you understand? Wait, look, I'm not a wasteful person. I grew up in the 70s, my dad was a marine, if I left the lights on in the house he'd knock me out, you know? But we take this stuff too far, when I say we, I'm talking about liberal fuck stains, are you with me? You remember? You remember Cheryl Crowe, the Titlis wonder, had a few hits back in the 90s? She actually said this in an interview, she said, after you have a bowel movement, you should use no more than one square of toilet paper to clean yourself. I wouldn't want to be her manicurist, huh? Now, Mr. Crowe, you got shit under your nail, you got poop under your nail, Mr. Crowe, you got, you can't use one square, you got four or five square toilet paper, you got shit under your nail, you got poop under your nail, Mr. Crowe, you got news of four or five square toilet paper, what do you do? Imagine a fingernail, it looks like a mechanic who worked on a transmission for 14 hours, got the hands of Demi Moore and Ghost after the pottery scene, I mean, Jesus, age, Christ. One square of toilet paper, what are you living on, a grape and a crouton a week? I just said four slices of pizza, six donuts and a pot of coffee, the AIDS quilt is not going to clean up this mess. That's one square, how about one square mile of the rainforest to make the paper to clean up the mess I just made? You got do-do in my eyebrows for Christ's sake, what are you? Be honest to God. Guys really are, I hear girls saying they're not many real guys, I'm starting to believe it, really emasculated, I'm watching college football, I've seen this about four times this year while watching college football, guys that just turn into little sissy, I'm watching like Nebraska, Oklahoma. Nebraska scores in Oklahoma and they cut to four college age guys in the crowd and this is their reaction. That is not the reaction of a young man and a woman when you give her a diamond ring or a leather jacket or a nice dick pic, she's looking at us on the back. What if your uncle Joe who fought in World War II the first time he saw her jab, he went, Oh God, oh God, he looks mean. You know what I'm saying? I'm 57, my parents are still alive, technically, they are getting really old and I hate calling home, my mother answers the phone, it's like calling the obituary hotline, she starts rattling off everybody that's died within a mile of my house for the last nine years, she sounds like Belushi at the end of Animal House, Needamire dead, Bob Berry dead, Consoli dead, Hayes dead, Thompson dead, I go, Ma, how did Mrs Hayes die? My mother goes, she was walking the church, she slipped on some ice and fell and her hip bone came right through her ass, but that's not the funny part. Then she goes, she almost bled out on the sidewalk, I go, you just used the word bled out, you're an 81 year old white woman, what are you, dating El Chapo, what the fuck? Bitch almost died on the sidewalk, nigga! Bled out on the fucking side, I go, how did Mr Consoli die? My mother goes, he was in his wood shop which is in the garage making a bird feeder and then his family realized he was missing after 44 days and they just found him sitting there, you know, dead, a bunch of angry pigeons, you know, just crapped all over him because the house wasn't done, look like he could hit with a gallon of white out his glasses are crooked and even his kids are giggling, oh, dead's deputy, it looks like an asshole, I gotta be honest with you, man. That's how you die, God has a mean sense of humor, he really does, you walk in a church, go into his house and he makes you slip and fall and your fucking hip bone comes through your ass and you bleed out, doing a nice thing, making a bird house and you fucking just croak there, he's just a dick, isn't he, when you think about it, gladus is up there, I didn't know coho's was so fucking religious, should people make me sick? He's got a mean sense of humor, you know, ever see gladus is up there vacuuming, nine-year-old woman by herself on the third floor, God's up there with Pete watching, hey, Pete watchers, you're gonna catch your toe on that cord in about three seconds, there goes fucking gladus, 21 cartwheels later, lands on her husband's air hose, he's in the other room trying to watch Matlock, now he can't breathe, he's like, eh, eh, eh, eh, eh, eh, God's laughing so hard he's making the same noise, eh, eh, eh, see that Pete two for one, they didn't go to church, fuck them, I got those, that's how you die, folks, you fall down the stairs, the hip comes, you know what I mean, you're laying in a puddle of your own piss on a kitchen floor, yelling into a bracelet, your family welded on your wrists, you didn't even know, you're welding bracelets on old people, I've been tracking white sharks on that geofacrisis, that's why I hate those, the life alert commercials, they open up and the ladies are already on the floor, have you seen that latest one, the ladies at the bottom of the stairs with a closed basket, eh, eh, eh, this closed hole, eh, but there's a disclaimer before the commercial, it says you may be offended by the following, why the fuck would that offend me, I'm offended that I didn't see you falling down the five flights of fucking stairs, you see a lady flying through the LA Guilcan evil at Caesar's palace in 1976, that's what I want to see, not her laying there half dead, what fun is that, eh, eh, I fell down, there's a lady, this is a true story, you can google it, there's a woman showing life alert right now, her mother died on the kitchen floor, when you yell into a life alert phrase, it's supposed to dial 911, she yelled into a dial, it dialed a gap store in a rural Illinois, it's like, at a mall, it just pictures some pimple-faced teenager folding sweaters, he's got the headset on, I'm bleeding from my ass, help! Sorry ma'am, I work in shoes, I don't know, maybe I can give you somebody in pants, I don't know about asses, I can, Jesus Christ, I didn't sign up for this, what the fuck is this, what the fuck is this, that's how you die, it's not pretty, it's not like in the movies you're laying there in bed, all your family surrounding you, you know, since course there's always one strange son missing, where's Timmy, well he's opening a Broadway play, dad, he'll be here in a couple days, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, hey. So my mother's, my parents' friend's a drop in dead by the dozens, they like fucking humbles on a crooked shelf, just sliding off and smashing, I've been to two funnels in two wakes in the last seven months, I'm so sick of renting puxy dozen top hats with these fucking people. These fucking people. That's what I wear. I show the proper respect. I'm like, oh, fucking Mr. Consoli, I bought a bird feeder off this asshole. He didn't even finish it. Let me look at my gold watch. People don't dress up any more. My grandmother died. My buddy shows up with a Dustin Padreuier t-shirt on. What the fuck? She's from Italy. She was born in 1885. I don't think she really appreciates a fucking 463 double play, okay? Fuck place me. I like wakes better than funerals. You know, I like wakes. You get to kneel down next to a dead body, like two feet away. It doesn't happen that often if you're white. Am I right, folks? It really is. Fake white fucking offense. I kind of offended. He said black. You guys do what I do when I wake. You kneel down next to the casket. You pretend you're saying a prayer, but you're really brow-beating the body like a psycho for five minutes. I stay up there too long sometimes. Even if my grandmother's funeral, my dad yells from behind. He goes, hey, what are you looking for? Signs of foul play? She's 98 for Christ's sake. You found her on the driveway. Not John Gotti's basement. Let somebody else stare at her for Christ's sake. I was staring at my Grammy's makeup. It was horrendous. Apparently the makeup artist who do the Batman movies broke into Peterson's journal home. She looked like Heath Ledger, big white pasty giant face, fucking big red shit eating grin. They should have propped her thumb up with superglue to make her look more natural. Don't get me wrong, my Grammy needed the makeup. She was not a looker, you know. She was a little drunk. In her prime she looked like a young Bill Parcells. Nice head of gray hair, saggy tits, sweater vest, fucking shitty attitude. Hey, put a headset on my teller. She'll call a nickel package. Watch. Go ahead. It's not like, hey, son of a... And then my buddy's dad drops dead. Don't get sad. Nobody liked him. He's a loudmouth drunk. But I liked the kid, so I went to the wake, got a respect, right? And then I'm kneeling down and looking at his father in the casket and I'm getting irritated. And I'm going, what is bothering me about this picture? And then it dawned to me, every time I met this guy when he was alive, he was in shorts and a wife beater in flip flops. Now he's in front of me in like a $3,000 Armani suit. $800 shoes. What a phony fuck. That's a waste of clothes. Does Calvin Klein know the shit that he works on for three years? Is he going right into the hole and be covered in maggots in ten minutes? It's a waste of clothes. How about the fucking immigrant digging the hole at the cemetery making $40 bucks a week? He can use a pair of pants, but what a... You know what happens? As soon as the family leaves the cemetery, the immigrant pulls the suit off the fucking guy, brings the casket home, makes a go-kart for his 12 kids. The next day you look out the window at your neighbor's gardener, he's cutting roses in a Hugo Busch. The shirt is the pants. All those clothes. You ever think about that? Talk about waste and shit. Once wear a toilet paper, think of your clothes before they fucking bury it. It's a waste. You guys see a cemetery, you think what? You think dead people. I think men's warehouse. You're gonna like the way you look. Not in a couple of years, but right now, you're gonna like the way you look. Hey, Billy needs a suit for the prom. Where's my shovel? I'll be back in 20 minutes. What's the big fucker? Cut to Billy's slow dancing with his date. He's got maggots on his collar. He'll get tonight. Who needs tomorrow? Hey, Billy, his suit smells like shit. Fuck you, it's from Al The High. My dad got it for me. $11, of course, long. It's a waste of clothes. I have it in my will. I don't think my wife will do it. I want her to rip my suit off me at the cemetery in front of everybody. Right down to my tidy whiteies and dump me in that hole. Just like Joe Pesci at the end of Casino. My brother's like, he's still breathing. My wife's like, he's not still breathing. He's fucking dead. That's how I want to go. Am I in the wear? Then we had to go to an estate planner. Me and the wife were at that age. That's when you go to get your financial affairs in order before you die. I'm at that fucking age. Well, that ought to take a long time. I've sold 22 CDs and a 38 comedy graphic. Hope my nieces and nephews don't break their back picking up that pot of gold, huh? So we go to see these Jews. I mean lawyers and... I mean globalists. I mean lawyers. I mean... And this one lawyer hated my guts the minute I walked in. He must have been a big layup. He knows my comedy and shit. Hated me for the whole hour we were in there. He kept using this term. We're talking about dying and Wilson. He kept using this term. And every time he'd say he would point to me with a stern look in his face, he goes, let's say you could hit by a bus tomorrow. After like the third time, I said, let's say my wife gets hit by the fucking bus and I'm driving her. You want to paint a real picture of her? I said, I'm driving her. I'm driving her. I'm driving her. My girlfriend's sitting in my lap. She's staring. I'm working the pedals because she's 17. She knows I'm a licensed jet. And we're backing over her legs and over and... I go, why do you have me getting killed in this story by a bus four times? What am I, 80 years old and living in the park and out of the Greyhound bus station in a tent? What the fuck? And then he looks at me and asks the big question. Mr. DePaolo, we had the living will discussion. If your wife was in a vegetative state, would you have a problem pulling in the plug in her? And that's when I spit coffee out my nose, my eye holes. I was fucking belly laughing for like 11 minutes. And he's like, what's so funny? I'm like, well, I tried to strangle her with an extension cord two weeks ago. That's sort of like foreshadowing your question. Isn't it, counselor? There's electricity in my... What I have a problem pulling a plug in a woman who fucks me once every three months, busts my balls 24 seven into a fine dust, hates my family? I think I could muster up the will to love her. Are you shitting me? I'll be in the basement of the hospital pissing on the generator. Whoops, I spilled another big gulp on the nurses computer. He got a cold blue on the witches room. I mean, my wife's room cold blue. And they asked my wife the same thing. You don't think she feels the exact same way? They said, Mrs. DePaolo, would you have a problem? If your husband was in a vegetative state, pulling the plug on her, and she's like, would I have a problem pulling a plug on this verbally abusive guinea, whose show biz career consists of opening at Fudruckers and playing co-hosts three times a year. A guy, a guy who asked me to marry him at my physical peak. I could have blown any hedge fund manager in the country been set for fucking life. This doesn't take electricity, council. Hand me that letter opener. Thank you. Thank you anyway. My wife better pray that I die first. Because she is the smart one out of the two. I know that's very fucking cliche to say, but it's true. She keeps my books. She was a great accountant with the School for Finance. She's a genius. I can't even work my fucking email. If she dies first, her body is not going to see a cemetery for six, seven years. I'm going to have her corpse in my garage, leaning against a canoe with a tarp over it. There's going to be squirrels nesting in her ass cracks, spiders in her eye holes, fucking smell coming out of my garage. I'll be in her office trying to open the dead folder on her computer. And this part is true. She has a folder on her computer. It's for me. It's labeled when I die. It's where all the attorneys' numbers are. No, the money. I have a folder on my desktop. It's labeled when she dies. You open it up. It's a picture of three of her friends. I've wanted to fuck the last guy in the year. Hey, Coho's, I had a great time. I can't thank you people enough for coming out. I fucking love you. Thank you so much. Appreciate it. Let's do it again. What do you say, huh? Wow. Yeah. Yeah."
}