{
    "url": null,
    "title": "Ben Bailey (Cash Cab) Road Rage and Accidental Ornithology  Full Special",
    "transcript": " Thank you. So the rule is, everybody, the rule is if you screw up just one too many job interviews, you become a stand-up comedian. That's how it happened to me anyway. I could never make it through a job interview. You know, it's such a high pressure situation. You really need that job. You get all dressed up. You get in there a couple of minutes early. You're trying really hard not to make any stupid mistakes. First opportunity to make a stupid mistake. You make a stupid mistake. They give you that application and you accidentally write your name in the wrong box. You already didn't get the job. Right? Because what are you going to do? Scrubble it out. Hand in your application with a huge scribble mark and the very first blank at the top of the page. Here you go. Say, did I get the job? No. No, you didn't. Can't ask for another application either. Can I have another application, please? Why? Because I put my name in the wrong box. They're going to be like, you don't need another application, sir, because we're not hiring any idiots today. You put your name in the wrong box of a job application. You have no other option, but to leave your name in the wrong box. Then you're in the interview. The guy's like, your name is Ben Bailey. Yes, yes this. And you currently reside at 365 Ben Bailey Boulevard. Yes. Yes, I do. Why, I've lived there all my life. But don't try to send me mail at that address. I put my mailing address in the comments box. And due to a bizarre zoning coincidence, my zip code is exactly the same as the first five digits of my phone number. But don't try to call me at that number. I put my calling phone number in the comments box just below my mailing address for your convenience. And yes, before you ask, my mother's maiden name is Caucasian. Despite all of those seemingly bizarre things, I still feel that I am quite clearly the right man for this job. So my name is Ben Bailey, everyone, and I am indeed the cash cab guy. Thank you very much. I am the cash cab guy. I'll tell you how I know that. Everyone that I saw today told me. Everyone over and over and over again all afternoon long. They run right up and shout it in my face as though they are certain that I am wandering around wondering who the heck I am. And I hit their like, there he is. And I don't think he knows. Better get over there and tell him right away. Get up nice and close, make it loud and clear. I'm sure he hears you. Don't waste the man's time. They do, they run right up and go, you're the cash cab guy. And I am like, I know. How would I not know that about me? Why are we shouting? We are three inches away from each other. I can taste your gum. And it's delicious. You break off a small piece for me. And then I grab them and hold them until they begin to squirm. And then I set them free and they run off. As I figure that way, they have a good story. I met the cash cab guy yesterday. He took the gum right out of my mouth. And then he held me. It was awkward to say the very least. But I will never forget it. I guess that's what happens when you have a TV show. People that you don't know come up to you all day long and say the exact same thing over and over and over. I'm not complaining. It's just an interesting thing to deal with. People say the same stuff a lot. I get this one a lot. Oh my God. You're a lot bigger than you look on TV. I'm always like, well, yeah. I mean, how big is your television, lady? Right? Unless you have a nine foot TV at your house, you're probably going to be a little bit larger here in reality. Isn't everything a little bit larger here in reality? These buildings must be freaking you out right now. Look at them. They're huge. You know at your house, they're only like this big, right? Here in reality, you can go inside them. It's truly remarkable. People say that one a lot. You're a lot bigger than you look on TV. They say it so often that I am considering hiring a dwarf whom I will dress up to look exactly like myself and make him walk a little bit ahead of me at all times. People will run up to him and go, you the gas can die. And they'll be like, I know. And then they will be like, you are exactly the same size. And you are on television. That's when I'll come out with I'll throw the dwarf Why not? I'm paying him. I'm kidding. I'm kidding. I'm not going to pay him. So people do say the same stuff a lot. They ask me the same questions a lot. They go, hey, did you have to get a real taxi license to host that show? And I say yes, because I did. Then they always make the same joke. They think it's brilliant. They go, well, at least you got something to fall back on. And I am like, har har har har har har. That is absolutely hilarious. I often sit and chuckle at the thought of losing my television show and becoming a regular cab driver. That is the funniest scenario that I can even come up with right now. Can you imagine the disappointment I would feel if the show were to be canceled and I were forced to drive a cab for real to make my living? My disappointment would be tremendous. But it would pale when compared to the disappointment felt by those individuals that got into my taxi. Because I would not tell them that the show had been canceled until the very end of the game. I just make the questions up as we went along. They'd be right no matter what they said. Right again, sir. This is amazing. So few people know that Wisconsin is the capital of Texas. It would be all fun and games till we got where they were going. We just won $1,500 in the cash game. No, you didn't. The show was canceled two years ago. You've won nothing at all. In fact, you owe me $14.80. Disappointed? What's so am I? I just have a TV show. Because I would turn into a bitter douchebag. If that ever happened to me. There are no two ways about it. So I'm in a little bit of a weird mood. I got some bad news the other day. I found out that I am allergic to people who are lactose intolerant. It's a bizarre condition. I'm lactose intolerant intolerant. I just can't tolerate those people. Always farting and complaining. I can't have milk. Fine, then don't have milk. Why do I have to be a part of it? Can you just eat and drink the things that you know you should? Leave me out of it entirely. Why do I have to be involved in this? How can you be so mean? Right when my restless leg syndrome is acting up? You heard about that one? Restless leg syndrome? Come on, what kind of horseshit is that? It's a syndrome. Restless leg syndrome. I have no idea what constitutes a syndrome. It's a hell of a lot more serious than some freaking wiggly legs. I'll tell you that one. You're just freaking out. Like, whoa! Oh my God. Did you see what just happened to me? Just pouring into emergency rooms. My legs are wiggling! Doctors are like, that's actually good. If the legs wiggle, they stop wiggling. That's a problem. Come and see me then. Oh, you'll need help. Get some legs whole-blurred. Pharmaceutical companies are just making up things to sell us cures for. Right? They'll give their legs wiggle, give them this blue pill. Well, what if they ask questions? Well, I don't know. Show them a cartoon of a butterfly or something. Legs wiggle, eat this. Well, okay, but does it... Uh-uh-uh-uh-uh. Follow the butterfly. Take your medicine, stupid. So maybe they're real. They're just exaggerated, I think. How many lactose and tolerant people do you think there are in Africa? None, not a single one. They will tolerate all the lactose that we can possibly get from them. We're just up to our necks and lactose here. Like, I can't tolerate all this lactose! Can we send some of this shit to Africa? Can we send some of this shit to Africa, please? They're in Africa like, we will take the lactose! Yeah, they're Indians in Africa. There's a huge population of Indians in Africa right now who have gone there in search of lactose. They just rolled in, show us the milk. Oh, yeah. I'm gonna go get some of these. I'm gonna go get some of these. I'm gonna go get some of these. I'm gonna go get some of these. I'm gonna go get some of these. I'm gonna go get some of these. Don't bullshit me, I know it's here. The cash cab guy told us. Someone always gets offended at my lactose intolerance bit. Comes up after the show, hey! I am lactose intolerant! And I'm always like, I know! You're the one I was talking about! You're doing it again right now! You're doing it again right now! You know what else has been pissing me off lately? Google? You guys know Google? A couple of people have heard of it. I wish you guys were like, Google! Watch Google! Google it and find out! That's the only way to learn anything anymore is to Google it. And that was fine at first because things were simple. It was like Google was my friend, right? I'd be like, hey Google, what do you know about this? Google would be like, well then, here's what I've got for you. Things were simple. I'd be like, hey Google, what do you know about this? Things were simple then. Google was my friend. But somewhere along the line, things changed and Google turned into that annoying friend. We'll never let you finish a story because it keeps interrupting you, trying to guess the ending before you can get to it. Right now I sit down, I type the letter P and Google is like, Pissed Civic Ocean! Pissed Civic Ocean? Is it Pissed Civic Ocean? Is it the pacifiers, the pack grabs, the peanuts, there's a piss bag, what is it? I don't even know what it is right now! Tell me what it is right now! I can't wait any more! I'm like, I'm frozen at the keyboard. Like, can't we just slow this down a little bit, Google? What are you, in a hurry? You're not even a real thing! What do you have to be somewhere, Google? You're everywhere! Just give me a second, and let me type this in. I'm like, what do you know about this? Just give me a second, and let me type this in right! It's not Pacific Ocean. Okay, now it is Pacific Ocean. Because I can't remember what it was when I started. So thanks a lot, Google. Now I have to learn about giant Seekelp for two hours, because you can't keep your big Google mouth shut. And who the hell typed piss bag into my Google anyway? I'm like, who is researching piss bag at my house on my machine without my knowledge or consent? In what information are they after? Right, if you can spell piss bag, you know everything about piss bag! It's a piss bag, a bag for piss. A piss bag. That's it! There is no more! Even all my friends are like, I'm not even a real person! I'm not even a real person! Even almighty Google can't give you extra information about piss bag! Would you like information on where to purchase piss bag? No Google, I wouldn't! I would like you to go back to just being my friend. Google and I used to be friends. Now Google thinks it's better than me. It thinks it knows what I want better than I do. Right, I sit down, I type something in. Google is like, okay, but did you mean this? Hey screw you Google! Yes. Yes, I did mean that. But I think we both know that now! So why don't you just give me what you obviously know. I'm after, instead of jerking me around, showing me half a million websites that made the same stupid typo I just made! We both know at this point, Google, that I'm not researching the city of Philadelphia. So why don't you just give me what you know I'm after, quit jerking me around because I don't type that well. You're the one that rushed me to begin with. I end up learning about stuff that I'm not interested in because Google is so suggested. I typed in take flight. Three hours later, I'm an accidental ornithologist. Having inadvertently studied birds for the better part of an afternoon. Now I'm Googling binoculars. Planning a family bird watching trip. I was trying to book a flight to Cleveland. Thanks a lot Google. What am I supposed to do with all this bird knowledge? Did you know there's a classification of birds called nearly flightless birds? I think that is pretty damn funny all by itself. Nearly flightless birds. Think about it. These are birds that almost can't fly. All right, they can fly but just barely. They can fly around at all they want. But the whole time they're up there they're like ohhhh oh my god oh my god oh my god We should not be up here. We're like this close and I'm being able to do this. Nearly flightless birds. Who's making that stuff up? We'll call these birds nearly flightless birds. Why? Why not? Good point. So that's what we get. Flightless birds. What are the other ones? Completely flightless birds. They're just sitting on the beach like this is bullshit. Why are we even birds? All we can do is waddle around and bitch about how we can't fly. This sucks. Make me a rodent. Call me what I am. I don't want to be a bird if I can't fly. Right, completely flightless. Nearly flightless. So if a bird is nearly flightful, has got to be the next one up. I think that's probably the worst one of all. These are birds that almost can fly. They cannot fly. But they're close. And they don't know that they will never succeed. So they'll spend their whole lives just running and jumping. This is going to be the one. Wooo! Son of a bitch. Why must we be nearly flightful? I'd rather be completely flightless. It's the same thing. Without the false hope. Right, then of course there's completely flightful birds all the way at the top. Just a bunch of elitist bird assholes. I think they're better than everyone else. Flying around with attitude like looking down at all the other birds. Like, almost nearly flightful. Almost buddy. Why don't you carry that for me? I always wonder if other animals are jealous of birds. Not because birds can fly, but because we build houses for them. You know what I mean? Like a squirrel must look at a bird house and just be thinking, you have got to be kidding me. Really humans? Really? They can already fly. They have a huge advantage over everyone else in the animal kingdom. And yet you are going to provide them with free housing. Thanks a lot. I'm a squirrel. I have all these nuts. Nowhere to keep. You are going to build a 20 room hotel on a stick for the god damn birds. Where do you think my nuts are going to be in the morning? Now there's a question every man should ask himself. Before he leaves the house at night, give yourself a long hard looking mirror. What do you think my nuts are going to be in the morning? Well, if all goes well, they will be right where they are now. And a little bit lighter. It was like finally a sex joke. All these birds, birds, birds, birds. You guys have learned enough about birds. You are tired of being lectured about nature. I had a weird thing on the way in. You ever have one of those awkward little moments with someone that you don't know? Those are some of my favorite things in the world. You ever do this one? You ever end a conversation with a stranger a little bit too early? And then realize that you are going to be walking the same direction that they are. So now you are walking with them. But you have already said goodbye. Neither one of you is certain if you are supposed to continue the conversation or not. It happened to me the other day. This guy asked me for directions. I said, yeah, go eight blocks up, make a left, go two over and make a right, and then go three more up and you will be there. And he was like, alright, thanks buddy. And then we walked away right exactly next to each other at the same speed. Three blocks into it I was like, is someone going to say something else? Or do I have to kill this man? Five blocks in, I just couldn't take it anymore so I stopped and waved him ahead. Go ahead, you beat me. I can't take this shit anymore. Go on, walk. But as he started to pull away from me I started to worry that he might get lost. So I yelled up to him, I said, hey! If you get confused I'll be right here behind you. And I don't think that comforted him so much as it frightened him because he started walking a little bit faster. And without even realizing it I started walking a little bit faster. Now I'm chasing this man. He breaks into a run that pissed me off. So I went, go ahead and run buddy! I know where you're going! I purchased a house recently. Not a bird house, a human house. Where I now live. I lived in Manhattan for like 10 years in tiny little apartments because I was broke. And then I moved out and bought a house out in the middle of nowhere. Got all these extra rooms now that I'm not used to. Fancy rooms, like a laundry room. Pretty highfalutinia. I bought a house in the middle of nowhere. I bought a house in the middle of nowhere. Pretty highfalutinia. A separate room just for the laundering of items. Right next to that, the guest bathroom. I can't even go in there. It's for guests. So after a while I said, hell with this! I want to see what's going on in there. So I cut a big hole in the wall of the laundry room. I cut a big hole in the wall of the laundry room. I cut a big hole in the wall of the laundry room. It goes right into the medicine cabinet. In the guest bathroom. And when guests come over, I just put my face in the hole. I just put my face in the hole. And I wait for them. And I wait for them. And I wait for them. Now sometimes it's over quickly. Other times it seems to take hours. Other times it seems to take hours. But it's always worth it in the end. But it's always worth it in the end. Sooner or later that little door creaks open. And I go, mind your own god damn business! And the guests, they just shit right in their pants. I know because they tell me. They say, I just shit right in my pants. And then I usually say, you know what? I actually have some pills for that. If I could just get around my ear and get them take two of these and stay out of my cabinet! You will shit yourself less. And then I go, mind your own god damn business! You will shit yourself less. And then I slam the door. Yeah, I put a little handle on the inside. Just for that part. Alright, that last part wasn't true. I don't have a house. I don't have a house. I live in a yellow mini-van. And it has lights in the ceiling. Where the same song plays over and over and over again! BAM! I'm going to drive that thing right into the river one day. Wait till I have some good contestants. Why are we going so fast, man? It's a new part of the show! It's called the Hudson River Challenge! Alright, here's how the Hudson River Challenge works. I'm going to drive the cab as fast as I can to the end of House and Street and smash through the barricade driving us both into the river. You'll have approximately 12 seconds to escape. Or you will die. And your shoutouts are both gone. That would make the newspapers crash cab. How do they come up with those billion bylaws? I would do that, and I can do that. Hello Discovery Channel executives, I'm just kidding. Maybe. I did buy a house, bought a house out in the woods after 10 years of living in Manhattan. I didn't go into the woods for 10 years. Now if you haven't been in the woods in a while either, I would like to warn you now, that there are animals in there. Lots of them. Shiploads, all different kinds. Cute ones, frightening ones, annoying ones. One night I couldn't get to sleep because there was an owl outside my window. Yeah, an owl. And at first I thought it was kind of cool. I was like, hey, this is kind of cool. There's an owl outside my window. An hour later I was like, son of a bitch. There is still an owl outside my window. I can see 50 other trees from here, owl. What is so damn special about this one? And it wouldn't have been that bad, except that the owl seemed to somehow know when I was almost asleep. He'd be quiet for eight whole minutes in a row. As soon as my eyes shut for a second, it was like, hmm. Somebody say who? How does he know? He's like, I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. How does he know? Went on for a long time. It went on for so long that I started to wake up even if he didn't do it. Right? Because I'd be like, why the hell didn't he do it? Owl! Are we still playing? Okay. I don't know. Finally, I got so irritated that I got up out of bed and closed the window. It's just funny, you know, because I could have done that right at the beginning instead of waiting three and a half hours. But I couldn't. You know why? Because my bed was perfect comfy. You know what I mean? The perfect comfy bed. You can't tell where your ass ends and the sheets begin. You're just a blob with a head sticking out, like, oh. Oh, I love you right now, Dad. You are so perfect. Don't ever change. You could hold a piss for 12 hours in a perfect comfy bed. Right? Your bladder is screaming like, have I made it clear how urgent the situation is? You're like, you do what you need to do, bladder. But I never watched a set of sheets before. That's how comfy the bed was. That's how annoying the owl was. He got me out of a perfect comfy bed. I slammed that window. I raced back and tried to get back to the bed before all the perfect comfy had escaped. I could never retain full perfect comfy. It's 20 to 25% at best. I must begin rebuilding from there. But you know that already. So there I was trying to rebuild my perfect comfy bed when I came to the horrifying realization that I could still hear that owl even with the window shut. I swear he moved a little closer. Put his little beak right to the glass. Who? Psst. Who? Who? And I knew right in that moment that I must change my strategy in dealing with this bird. I knew I must wait until he fell asleep. So that I could mess with him. In the same way that he had been messing with me. So I waited. For a really long time. Turns out owls are nocturnal. Which is something you would think I, of all people would probably have known. Alex Trebek knew that, didn't he? But not me. Luckily for me the same thing is true for stand-up comedians. We too live at night. So I waited that little bird bastard out. Sure enough, as soon as the sun started to come up over the mountain, this giant owl eyes began to shut. And I waited for just the right moment. And then I went, me! Me! Nosey freaking owl! That's who! Me! Having trouble sleeping, buddy! And I think it pissed him off. I do, I think it got into his head. Which is really his whole body. Because he put down his lollipop. After just two licks. He came down out of the tree and closed the window. And then we both went to sleep. Now I thought about killing that owl. I'm not going to lie to you, I pondered bird murder in the wee hours of the morning. I wondered if I would have to pay a fine for that owl to turn up dead on his back, on my patio with a steak knife in his chest. Right, a chalk outline around his body. A lollipop in an evidence baggie. Seemingly untouched. The police questioning me, is this your steak knife, Mr. Bailey? I've never seen it before in my life. Perhaps the bird was unhappy. I would have killed that owl, don't think I wouldn't have. I've killed birds before. It wouldn't be the first time. I've killed two birds in my life and I did it with one stone. I know it sounds impressive, but please wait for the facts. There were two very small birds both trapped in one very small cage. I was standing over them with a huge stone. Conducting an investigation into the realism of expression. I was holding the video camera. People have been bragging about this bullsh** for hundreds of years. Today we find out just how difficult it actually is. Well, there you have it, folks. Hundreds of years of trash talk and it's just that easy to kill two birds with one stone. We'll be back right after this with Have Your Cake and Eat It 2 Every Now and Again and beaten half to death. Turns out it's pretty damn easy to kill two birds with one stone. Depending, of course, upon what kind of birds they are. Birds were, say, ostriches or emus. Both of which are nearly flightless, by the way. If the birds were ostriches, that would change the whole equation. Then the question would lie in how many times you're allowed to use the same stone over again. Hey, are you the guy who killed two ostriches with one stone? Yes, I am. It took me seven hours. But I did it. The first one was easy. He just walked right over to me. I think he thought I was going to feed him or something. He just leaned his big, stupid ostrich head in and bam! Took him out with one shot. That spooked the other one. He took off into the jungle. He took off into the jungle. Or wherever ostriches live. I ran in there after him. We were in there all day. Twice, I thought I had lost that stone. In which case I'd be completely screwed that I'd have to start all over again. Right, and where do you draw that line? Hey, are you the guy who killed 11 ostriches with nine stones? Right, now I'm just some bizarre croon ult. Killing a lot of rare birds in a pretty freaking violent manner. I had something to prove when it all started. Now I'm just getting arrested and escorted out of the zoo. Well, you thought I went to Africa? Perfectly good ostriches in the Bronx. Oh, there used to be. Expressions don't make any sense. How about this one? How'd you sleep? Like a baby. What, you shitting your shorts? What, are you waking up crying every half an hour? What the hell is wrong with you? You're 45 years old. Stop sleeping in that crib. You're just ruining your social life. How about this one? How often you've been getting over there? Oh, every now and again. What? How often is that? How often is that? Every now and again. Think about it, every now. And again. Every now. All the nows. Every single one. And again, that's freaking impossible. You cannot go somewhere that often. You go somewhere every now and again. You are trapped there. For eternity. And again. It doesn't make any sense. How about this one? You're never trying to get two good things going on in your life at the same time. One of them keeps faltering. There's always someone there to whisper these words of wisdom. Well, you know what they say. You can't have your cake and eat it too. Hey, fuck you. Fuck you. What are you trying to mess with my head? Right? If I can't eat my cake, I don't even want it. What else am I going to do with it? You just sit there looking at it, I have cake. Well, don't eat it. Then you won't have it anymore. Shit, that's the whole reason I got it to begin with. Would you like to have some cake? No, thank you. I'll eat mine. You have yours. I might eat yours when I'm done with mine, and then you won't have yours either. Cannot have your cake and let Ben eat it too. Who the hell has cake and doesn't eat it? Diners. You can't eat the cake in a diner. I've tried. Can I have a piece of that enormous chocolate cake, please? No. We don't eat our cakes here. We rotate them. Fair enough. One of my favorite ones I heard was here in New York. I had seen a big fight on the street. One guy was always on the street. I was like, I'm not going to eat my cake. I was seeing a big fight on the street. One guy was all beat up laying on the ground. The other guy was gone. There's an old woman standing over the guy in a panic saying the exact same thing over and over and over. He beat him half to death. He beat him half to death. Over and over. Half to death. After a while, all I could hear was half to death. And then just half. Half! Repeating in my head. I started thinking half. How could she possibly know that? So I interrupted her. I said, excuse me. But there is no way that you could know that this man has been beaten half to death. The only way that we could know that for sure is if we were to beat him again. Exactly the same way. He worked to die right at the end. And she agreed. So we beat the crap out of him. Me and the old lady. Recreating the first beating as best we could. Sure enough, right at the end. He died. That's when the police arrived. And they said, what has happened here? This man is exactly dead. And we said, he's been beaten half to death. Twice. So I know I seem like a nice fella on the Cash Cab program. But that's editing. Really? No, I am a nice guy. I try to be a nice guy on the show. I think what I'm trying to say is that road rage is real. Alright, anyone who's driven a hundred feet in a major city knows that road rage is a reality. There's a line. On one side of the line you're like, that man is driving aggressively and I wish he would stop it. On the other side of that line, that turns into I will kill your whole family. If you do not move to a city that goes by my path immediately you and your loved ones will die a horrible, fiery death. Right? They're right next to each other. If you cross over into that second one there is no quick route back. You need to pull over for a minute and cool off. I'm a danger to yourself and those around you. Road rage is real. And I am no different. Well, I'm a little different in that I am hosting a game show when it's happening to me. So the camera is always on me. Right? So I can never show anything. So no matter what happens I just kind of go hey, hey, hey, hey, hey, hey. Hey, hey, hey, hey, hey, hey. It's been a great day to be sitting in traffic for 12 hours, isn't it? Right? No matter what happens I don't show it. So it builds up and builds up and then it comes out when I'm not ready. On several occasions I have thrown the cash cab into park and left into traffic. Full intention of kicking the shit out of a complete and total stranger. I'm not proud of it. All right, I'm a little bit proud of it. On one particular occasion we were sitting in traffic on 3rd Avenue for the 150th day in a row. We continue to choose 3rd Avenue despite the fact that they're building a hospital and a pipeline and a freaking amusement park in the middle of 3rd Avenue. We are guaranteed at least 40 minutes of going absolutely nowhere. So I'm already irritated by the traffic. To make matters worse, there's an electrician in a van behind me who doesn't seem to understand how a traffic jam works. Right? He seems to be under the impression that somewhere all the way at the front of the traffic jam there is a man in a very wide car who has just nodded off at the wheel and that if he, the electrician, can only honk long and loud enough he will wake the man in the wide car and will all be on our merry way immediately. To make matters even worse the electrician and his horn have impeccable timing. They're as good as the owl, if not a little better. He will only honk if I have just begun speaking which means I have to stop speaking and start all over again. So I'm talking. I'm like located in downtown baaaar What is this guys problem? Let's try that again. Located in downtown baar Son of a bitch! I try to sneak one in real quick before he could honk like located in downtown How does he know? and then that little fuse in my head head short circuited now everything's different. Now there is no third affee. There's no hospital or pipeline or amusement park. There's nothing. There's just me and the electrician. So I'm like I think I'll put my window down. I know another bird. This one is completely flightless. I wish to God I could fly off the end of my arm and punch that asshole in the nose and fly right back. But it can't so I just hold it up there long and steady and sure he sees it. Now not only does this not stop the horn but an already powerful horn seems to somehow be gaining strength from the finger gesture. Right before it was like Now it's like moving back and forth singing a crazy little song in my head. I am going to kill you. And then the horn stops I'm like oh my god it worked. As I'm pulling my hand back in I see in the mirror the electrician is now getting out of his van. He is walking toward the cash cab at a healthy clip. I don't think he's coming to say hey I really love your show. Right because he's walking like this. So I've been in a situation like this at this point and stayed in the cab. Now if you've never been in a road rage altercation situation take it from me seated and buckled in with your face in a big hole. Perfect punching height. It's just no way to begin a street fight. The other guy is going to be like really you're just going to keep your face in the big opening like a booth at the county fair. I can just push this shit out of you over and over and over until you remember that you can close the window. So I've been there before it didn't end that way but it could have. So I remember it and I see him coming and I'm like that's not happening again. I throw the cab into park and I come barreling out. Now I am the last dude that he was expecting to see come flying out of the driver's seat of a New York City taxi cab. He's expecting a much smaller Middle Eastern fella. Not six and a half foot me with my Marine Corps haircut. 200 episodes of pent up cash cab road rage. Burning in my eyes. You know how many people get kicked out without using their shout outs buddy? You know how many? So he sees me coming and he immediately goes from hey to hey. You large and frightening man you. Why were you doing that silly thing? And I'm screaming before my feet even hit the street. I'm like it's a god damn traffic jam. Nobody's going anywhere. It doesn't matter what you do. So why are you walking? Shut the bugle. Then he says he goes you're crazy. Then I go I know you and your horn made me this way. So deal with it. He goes I'm calling the cops. I'm like you got out to kick my ass and now you're calling the cops. Now what he doesn't know is that while he was sitting right behind me, right behind him was the cash cab crew van. And there's eight dudes in there. One of them is a New York City police officer. He has a gun. His whole job description is protect Ben Bailey. So while I'm arguing with this guy in the middle of 3rd Avenue, they are lining up right behind him. Like a team photo in a high school yearbook. There's like two rows of dudes with their arms folded. So he says I'm calling the cops. So I'm like why don't you save yourself a little time and turn around and talk to the cop who's standing right behind you who works for me. And that just like sends him real and now he's like regressing to some driver instructional course. He just starts going never get out of the van. Never get out of the van. Finally it gets up the nerve to turn around. I mean he's scared right? He's like how could this bizarre cabbie have a police posse that is already behind me. Like 11 seconds have gone by. This is insane. So he doesn't know what to do. Eventually he gets up the nerve to turn around. He slowly turns around. There they all are right behind him. Nobody says a word. He just kind of looks at them like really? And they all just kind of look back at him like yeah. And that's enough for him. He dives back into his van. He slams the door and he locks it. Now I'm standing in the middle of 3rd Avenue still staring at him. He won't look. He's staring at the passenger seat. Something very interesting. The leather surface of that passenger seat. Tony the cop slowly walks over to me. He gets right up next to me. He leans in real close and he goes. What the hell is wrong with you? He gets even closer and he says you're a game show host. And I swear to you that's the first moment that it occurred to me that I am in fact a game show host. Nobody sees that one coming. It's also the moment that I remember that there is a couple in the back seat of the cash cab right in the middle of a game. So we turn and look and they're like noses to the window like ah. This is the best show I've ever seen. So I don't know what to do. I'm like humiliated, fired up. I just slowly walk back over to the cab and open the door. Climb in and sit down. How are you guys? Have $600. You have $600. You've used your mobile shout out. You've used your mobile shout out but you still have your street shout out. Here's your next question for $100. But first you guys have $600 and we are stuck in a red light and that triggers a red light challenge. Thank you so much everybody. Thanks for coming out. Thank you."
}