{
    "url": null,
    "title": "Christopher Titus • 5th Annual End of the World Tour • Full Show",
    "transcript": " Don't Please welcome Christopher T Yamisch Hello everyone. Hello. Hello. Thank you. Thank you. What's up bitches? Thank you. Very nice. Very nice. All right. All right. Well, August 25, 2001, my wife gave birth to our first child. Thank you. Then September 11, 2001, I realized how bad my timing sucks. And the five years my kid's been alive, all hell has broken loose on the planet Earth, and I'm not blaming my daughter for all of it. I'm hoping it's a coincidence. Terrorism, war, diseases we can't cure, hurricanes, tsunamis, spinnets, fucking France. It's the end of the world, people. It's an army of people. It's the end of the world, people. It's an Armageddon checklist. Pope John Paul didn't die. He pre-bored it. And if you have kids, you're scared. I have kids, man. Every night the news tell me little kids are getting stoned off the street like car stares out of convertibles, and I got two. I don't know what to do. I bought a Rottweiler, stapled them both to it until they're 18. There you go. Shut up. Daddy says ride the dog. We got new diseases every week. Do you even remember diseases before 9-11? Since 9-11, SARS, monkey pops, which both my kids think are a sugary breakfast cereal. Mad cow disease. I got to be afraid of fucking cows now. And Canadian cows? I feel like such a pus. Yeah. When did it become lions and tigers and cows, oh my. Then we got the bird flu, the hantavirus, the mosquito virus. Did the animal kingdom have a meeting? All right, who's tired of being food and clothing? Anybody else? Cows, get on it. Moo! Cow is mad. And our priorities are all screwed up. Five years we still can't catch Osama bin Laden, but in those five years we nailed Martha Stewart and Barry Bond's ass to the wall. The world's worst terrorist is still dragging his dialysis machine through a Pakistani strip mall right now. But the doily bitch and the slugger prick won't bother us again. Prince Charles married Mick Jagger. What's going on? And things are so screwed up, we're accepting stuff that we shouldn't accept. Do you guys hear this? The anti-depressant paxil causes suicide in a lot of people. Let me say that shit again. The anti-depressant paxil causes suicide. So if you're depressed, you take a paxil, you're going to feel a lot better and then blow your brains out. But the suicide note will be inspiring. Oh, little eyes dotted with little hearts, you know. Goodbye, happy faces and the Os. Spinach is deadly. Popeye's a lion prick. It's the end of the world. Amish people are getting shot. Nobody who churns their own butter should have a bullet in them. How you doing there, Ezekiel? Pretty good, Jebediah. Smells like a drive-by. And now we're spending $400 billion on a war to help Iraq and the Iraqis seem so appreciative, don't they? How do you explain that to your kids? Well, honey, in some cultures blowing up innocent people with a pinto means thanks for the freedom. $400 billion. We hung one guy. Can we just send Saddam a mad cow burger and a paxil and been done with it? Like, oh, three? $400 billion? And we need to spend that money here, except you can't trust anybody here either. Two weeks ago in Los Angeles at a stop sign, I was asked for a dollar by a homeless 22-year-old Vietnam veteran. It's like, yeah, man, here's the buck. I know, Da Nang was whack. And then he skateboarded off. It's the end of the world. You guys realize that when you have kids that you're going to teach your kids stuff we never had to learn. You know, it could have anthrax. Don't talk to the male man because he needs Xanax. And don't go any building with four stories high because some idiot named... Oh, my crash of 747 into it. And my daughter's five now. She's asking me questions. I don't know what to tell her, honey. I don't know. I don't know why two Poppins dead ten years still put out better albums than Justin Timberlake. I don't know. What? Why is there a war? You know, a year ago you were eating your own poop. What are you talking about? Okay, this war right here, this war is because we proved that there was weapons, a master's... Okay, this war is because we proved that the Saddam was directly connected to 9-11. Well, at least it only lasted six months. Come here. Gas better get cheap pretty effin' fast. You guys get that, right? Our president is a Texas oil man and we're paying three dollars a gallon. We're fucking retarding. I'm sorry. And my daughter's too smart. She gets it watching. She gets it. She's five. She gets it. I have a smart kid. I don't want a smart kid. I'm going to start feeding her lead paint chips just to bring her down. I knew she was smart when she was one though because she would not watch reality television. She's leave, just leave. She's smarter than me. I watch reality television. Oh my God, the human drama unfolding live in front of me that some producer set up. She just sees people eating bugs for money and something she got her ass beat for two days earlier. Reality television is the end of the world, people. Fear factors in syndication. We're rewatching people eat the same damn bugs. People wonder why our kids are getting fat. Well, maybe it's because we're all sitting on our asses on the couch at home watching other people play cards on television. We can't even play cards ourselves anymore. Yes, I cut the deck, but I don't want to reach my target heart rate. Martha Stewart's a convicted felon and they gave her another television show. What's next? The Peterson Fishing Hour? End of the world. The husbands and wives killing each other? My God, it's happening all the time. A guy a couple months ago shot his wife at a domestic violence center. I think they need to clarify the sign. Minister's wife shot him in the back with a shotgun? I guess he does work in mysterious ways. Guy in Utah killed his wife. Guy named Mark Hacking stabbed his wife. By the way, ladies little tip, don't marry a guy named Hacking. Or Stabber McShootie, also a bad name. And it's happening all the time. We thought OJ was a fluke. Turns out OJ was a trendsetter. I'll come over here. Peterson, Robert Blake, who got off on the I Couldn't Have Shot Her, I left my gun in the restaurant defense. Was the jury in the jury box with just big helmets on? Innocent. I believe in innocent. In my final submission, I was taking OJ innocent. And I get it. We've all been in long-term relationships. And we've all thought about killing the other person. Just for a second, he was on the stairs in front of you and you were like, oh. Oh. No, I'm good. Go ahead. I know me. My wife's thought about killing me a lot. But she always turns the car around and takes the shovels and plastic sheeting back to Home Depot. Who amongst us can say they have not bought the concrete to weigh down the body? Who? But you didn't use it. You went home, you calmed down, you fixed the driveway. And it's bad enough these guys killed their spouses. Isn't it worse, the lawyers? These lawyers are amazing. Peterson's lawyer was brilliant. This guy, Scott, was not trying to escape into Mexico. Really, counselor? Then why'd he look like the Hispanic M&N? Well, he was in the pool too long. Who's he hanging out with? Aquaman? Because I've been in the pool 10 weeks straight. My hair never went clear. Wasn't going to Mexico. So they caught him on the border. 10 grand on this pocket, English Spanish dictionary in this pocket. We're in a sorape and holding a leaf blower. And here's why I bring it up. Because the media, the Viper media just grab on to anything that's stupid and they just beat us to death with it. And the thing is that you're just watching TV, but your kid's just sitting there with you. Your nieces and nephews. At the end of the Peterson's trial, my daughter, she turns to me and she goes, Daddy, are you going to kill mommy? Honey, that's up to mommy, isn't it? Funny to me. Our media's out of control. It's always something stupid. The Terry Shibos thing was nuts and it was on TV for 14 years or whatever the hell that one. My daughter turns to me in the middle of it and she goes, Daddy, which one? I'm with this woman. Well, honey, she's brain dead. Her brain doesn't work anymore. You mean like Uncle Rudy? No, honey. Uncle Rudy's on Thorazine. And Paxil. And marijuana. And Merlot. I am so glad our government has finally decided to get directly involved in our family business. And the Terry Shibos thing pissed me off because it was predicated on one thing. There wasn't enough witnesses to what Terry wanted. So as my 300 witnesses tonight, let's be very clear. If I am ever brain dead, kill Titus. If I cannot control the fluids spewing out of my own orifices, please kill Titus. If I'm not aware of the pick which diapers I would like to be changed into, for God's sakes, kill Titus. Unless I'm really funny. You know what I mean? I'm not lying there. And you guys enjoy that? God bless you. Film a movie, dress me as a Viking. I don't care. And you know why I don't care? Because I'm brain dead. And then when you're done laughing at me, kill Titus. And don't let me die slow and horrible by pulling my feeding tube. I want you guys to duct tape my ass to a motorcycle and let's break Evo Knievel's jump record. That's right. I want to go out big. I want to be brain dead over the Snake River Canyon. Ring, ring. And please film it so my family can make some money off the DVD. Which I would like to be called, Kill Titus. With 30 minutes of bonus footage. Made you giggle like a girl, dude. I made you giggle like a girl. Our government has lost its mind. You know our government went back to work on Easter Sunday to deal with the Terry Shivered tobacco. What happened to our government, man? And our president, by the way, like him or hate him, you have to meet President Bush as at the toughest presidency since Lincoln. And Lincoln's got to open the paper every day and just go, fuck! There was a hurricane. Cancel my spinach salad. And my trip to Amish Country. And throughout history, great hardship has created great leadership. In this man's case, it's created a Special Olympics Honorable Mention. I'm sorry. No. You know your president's in bad shape when the only way to take attention off of him in five years is to have the vice president shoot a buddy in the face. Hey, Paul, you're going to have to take him for the team. And he keeps talking about the moon. Here's what's freaking me out. Like, he keeps talking about the moon, just bringing up the moon every once in a while. In the middle of the speech, no child left behind. Moon program. What the hell is he talking about? And he keeps bringing it. And I can't, my first thought was, oh my God, he forgot we already went to the moon. Like, things are just going so bad in Iraq. He looked out the window one day. I want to go there. I don't like it here no more. It's really hard here. Did you read the paper? Turns out we got to go to the moon because we got to go to Mars. We got to go to Mars because we spent $3 billion on this radio shack remote control car that we landed on Mars. And while it was scooting around, it discovered, huh, mud. Because I guess there's a mud shortage coming that we're just frankly not ready for. It's nice to know we ever need dirt and water mixed together until the hop's skipping a billion miles away. And he wants to put a colony on the moon. Cool idea, colony on the moon. Of course, how are we going to get there, dude? Space shuttle. We've blown up two out of ten now. And last one that worked, the gas gauge was broken. Yeah, how does it feel to be that astronaut? You've already known they've blown up two. It's your big shot. You're on the launch pad. You're ready to go. You look down. Houston, we got us a problem up here. Yeah, I flicked it. No, no, no. Jiggle a wire in my ass. Open a hatch right now. I will take a 71 Vega to the moon before I get in the damn space shuttle. You guys know, I found this in my study. You guys know, the space shuttle was actually designed in 1971. You know what that means? In the space shuttle, there's an avocado refrigerator and one Doofy Brothers 8 crack. But that Shag carpet looks bitching at zero G, doesn't it? 1971? Isn't it time to crack the R&D book on the shuttle? You know why? Because I have a shampoo in my house right now that fixes my hair on the molecular level. A razor with four blades. If I move too fast, we'll cut my head off. Can we please give the shuttle a little nip and tuck? It goes 12,000 miles an hour. My bathroom at home goes zero miles an hour, yet tiles fall off eight. Does anybody here want to be an astronaut if the emergency repair kit on the shuttle is grout and a cocking gun? I'm having a problem with the stabilizer. I got it. Things like Google Run NASA, man. If Google Run NASA, where it's going to work, man? It's time for NASA to step up or step aside, man. I believe that. My dad used to say that I was like, step up or step aside. You don't get the bitch unless you're willing to do something about it. Yeah, of course. My dad always said that while he was sitting on his ass on the couch drinking a beer. Yelling at me for not mowing the lawn. Why don't you step up and mow it? Ow! That was a cigarette. Now I'm a pirate. Arggg. And but anybody, why are we going to space? Anybody, what the hell are we doing in space? Well, we got Tang, we got Velcro, moving on. Didn't we already kick spaces ass in the 60s? We landed a thing on the moon, planted a flag on the moon, claimed the moon for America. Not a shot fired. Hold up, hold up, not a shot fired. Well, we're Americans. That confuses and pisses us off. No, don't get me wrong, we'll take your land. But we need to kick somebody's ass first. See, that's why I think our space program screwed up. I say you want to fix a space program, we need an enemy on the moon. Hey, we invented one in Iraq, let's invent one on the moon. Oh, oh, oh. Personally, I would like to send the French. And by the way, I'm not just jumping on the I Hate France bandwagon. I mean, I tried to jump on, but it was full. Here's how bad the French are. The European Union is trying to come together as one trading block. It's the only country that wouldn't sign the agreement. They're like, no, we will not sign a piece of paper. We do not play with others well. Look at my ass as I walk away from you. Alright, fine, fine, French. You don't want to play in our sandbox, you want to be on our team, fine. Moon's all yours. They still hate us though, giving the moon. They be living up there. Well, thank you for the moon, dumbass Americans. Joc, look at the Americans. They think they're so cool down there. With their hot dogs and their amber gills. Wearing their f**k the other one. But we have their moon now. We could be on them from right here. Joc, does that look like a laser to you? Yep, ass of laser. And you better get some long sleeves on, because it's going to hurt. Face it, we are warring people. This country hasn't gotten better economically or technologically, unless we were kicking somebody's ass. And you know what? It's made us the strongest damn country on the planet earth. But, it's also caused some internal problems. Because some of those people we jacked up, live here now. And because I got these two kids, I'm trying to make the world better. I'm trying to figure it out, man. How do we make it better? And I can't figure out how come we're all the same biologically, none of us can get along. I started out basic. I tried to figure out white people and black people don't get along. Sometimes. Turns out the problem is, there's f**king white people, man. I read some books, man. We can be dicks, man. Wow. Now we need meetings like Whitey and Non or something, man. Because I read a thousand years of history, and frankly, I'm ashamed to call myself a peckerwood. I don't tell people I'm white anymore. I'm albino-cambo-dian. And I hear this a lot, especially in California. Oh, there's no racism anymore. Really? Okay. Then let me ask you a question, white people and black people. If you're telling a joke, and the group of people you're telling a joke to are all the exact same color as you, you just set that joke fly no matter what it is, right? But if one person in that group happens to be a photo-negative of the rest of you, you gotta run that joke through some filters, don't ya? Am I going to make the man filter? Am I going to get punched in the face filter? Is that guy holding a Glock 9 filter? And your timing's off-joke's not funny anymore. And white people listen up. I found this in my studies. There are white people jokes. I know. And ladies and gentlemen, these jokes are harsh. I know that because none of my black friends would tell me any of them. And out of that, come on, just give me one. No, man, you don't want to hear it, really. Now, I signed the waiver. Legally, I can't tell you the joke. You know, those jokes are so harsh and so funny, because they had 400 years to write those jokes. And here's the problem right now. The problem you might be left with right now, and it's on white people's side, every white person in our country knows what our ancestors did. We know how wrong, horrible, vicious, and brutal it was. And the thing is, what happened is just so outrageous. Frankly, none of us know what to say about it, man. How do you apologize for a 400-year faux pas like that? Oops. My bad just doesn't cover it. My black friends bring up slavery? I can't even talk, man. You guys know I wasn't there, right? Come on, let's go shoot some hoop. Not that you're predisposed to shoot hoop. Oh, God, don't beat me up. Please don't beat me up. A lot of white people are afraid to have to write a really big check, too. But I did some research. I found a lot of black leaders have said that in combat reparations, as much as they wish somebody, anybody, would just step up and make a formal apology. And that's fair, isn't it? And I believe one man can make a difference. And if one man took 100% responsibility, the healing could start. Go. Dude, there's some people right behind you, man. Come on. All right, Whitey, I got it. Good evening, black people. First of all, may I say you're right. You do dance better than us. But on the other hand, I also love chicken. Now that we have found some common ground, I apologize, slavery was all my fault. Stupid, stupid, stupid. I thought it was going to be a fun trip. We're going to Africa. Woo-hoo. But all we brought was beer and no women. So when we got there, we were just hungover and pissed off and then all hell broke loose. I apologize. We should have just brought back plants. But we had this country to build and we needed some help. We could have used Indians to help us. But we killed them. We killed them. To the Indian people. I also love whiskey. And hate trash on the freeway. And I apologize. But white people, we get fired up. Man, we're coming over from England. We're free. We got our religion. We're going to this new country. There's nobody there. Who the fuck is standing on the beach with a feather in his hair? Who's that guy? Hold up, hold up, hold up. He's wearing a loincloth smoking a pipe. He's probably high. No, no, let him keep smoking. Because then he won't care if we take his whole country, idiot. Sorry. Indians, we didn't mean for it to go down the way it did for us. It was like going to a party in high school at someone's house and other parents were out of town. We didn't mean to trash the place. But the football team was doing crystal meth. And Indians, I promise to make it up to you by at least once a year, losing $1,000 in your lovely casinos. We could all do our part. And Indians, why did we take your whole country? My God, we took everything, man. We could at least left it Texas. I mean, hell, we cleaned out all the Mexicans. Pero los Mexicanos. I'm sorry. Muy... Apologiso? I didn't even know what the hell we're fighting so hard for Texas for anyway. Anyone here have been to Texas? Texas is a hellhole, man. Dirt, cactus, lizards, dirt, cactus, the Bush family dirt, cactus, lizards. Come on. Hey. It's not like we were fighting for Colorado. Again, Indians, really sorry about Colorado. Okay, I want to roll who else? To the Japanese, you know about the A-bomb and the internment camps? Now, fuck that, you guys started that, man. Hey. Hey, we were chilling in Hawaii and all hell broke loose. I will admit, I overreacted. But look at you now, huh? With the plasma TV and the Toyota Prius, huh? Huh? Huh? I think somebody deserves a thank you. You're welcome. So to every race of people in here tonight that whited his jacked up, I sincerely apologize for taking your land for the abuse, for the torture, for the smallpox blanket, for the Jim Crow laws, black people, I apologize for Kramer. In fact, you know what? We're going to change the world tonight for our kids and their kids. On three, I want every white person in this audience to say, I'm whiting! And I apologize! One, two, three. I'm whiting! And I apologize! I'm going to cry. That was beautiful, man. That was great. Whoo! That was out scene. We cracked the door a little bit. That's beautiful. And by the way, if you're not white, you should probably accept our apology because did you see how fast we got organized? There's a hell out of me too, man. Because all we really need is two beers and an idea. I wrote that bit because I have kids now. By the way, I didn't give a flying rat's ass about this world before I had kids. I just wrote jokes, jokes like this. Hey, did you guys hear Dr. Adkins died? Slipped on some ice, hit his head, died on life support. The man in the event of the all meat diet, died of vegetable. That's a damn good joke. That joke's like a minivan, reliable, not inspiring. And then I had these kids and I'm ever waking up one day and kind of coming aware of the fact that my daughter is learning her colors from the terrorist alert rainbow. Oh no, she thinks Winnie the Pooh is a medium threat. Comes in every morning for a briefing. Now, Daddy, what's today? Well, it's an Alamo day, honey. I'm going to go get some food. Where is my pretty pony duct head? Get it, damn it. This isn't a game. And by the way, I'm not kidding. That color chart thing screwed my daughter up. She's a little kid. She's learning. Honey, what color is that? Elevated. I shouldn't have had kids. I admit that freely. I'm a retard. I shouldn't have had kids. I'm a retard. I shouldn't have had kids. I'm a retard. I'm a retard. I'm a retard. I'm a retard. I shouldn't have had them, man. I shouldn't have had them. Because before I had kids, I was that guy in the airplane. Just hated them. You know, your kid was screaming, excuse me, Sturtis. Those little pillows fit directly over a three-year-old face. Aw, he's a little angel now. Didn't he look at him? Same color blue as a seat. Really? Were you oohing that one? Why don't you guys go watch Lifetime? And then I had some and I just, they love them and they're great, but man, it's just, I, you know, and your first kid for a guy is amazing. Your first kid is like your first car. You love it. You can't believe you have it, but you're going to put some dents in it. In child services, it doesn't like when they find that your baby has Bondo covering a dang. Shut up, honey. If I keep standing ahead and get round again, just shut up. I did not drop her. I don't believe that sleeping with somebody qualifies you to be a parent. Because we've all been to Walmart, right. And you see those little bastards running around. All you can think is, I want to punch his father in the throat. Those are my kids. I'm not good, man. I believe, I believe if you want a child in this society right now, you should have to go to a parenting class before you have one. Or if I could have rented a midget for like two years. You know, just rented a midget, dressed him up as a baby, had him walk me through everything, you know. I pay some good midget money too. I'll be flipping out. Hey, midgets get screwed over in America every day. You ever seen him working at the mall? No, because all the counters that high. What's a midget going to do? There are no Starbucks midgets. You ever seen any of that? Can I get your latte? I was doing a show for Comedy Central last year, and then we had some actresses in it. Deborah Caren got a midget. So I'm on the radio when they're talking about it. And I keep saying the word midget, and this angry midget calls in, because they all are. Well, they live at ass level, I think you would be too. So he calls in, he calls in, and he's just mad. And he goes, hey, well he said, hey! Saying the word midget is like saying the n-word. Is it really? I don't know, because I don't remember the time in our nation's history, we took a bunch of boats to Munchkin land. We took a bunch of boats to Munchkin land. Filled them to the top with midgets, brought them back and made them pick cotton for 400 years. Although cotton's only that high, so it's a much better idea, frankly. That's right, that's the right response. Hell yeah. Yes, you guys win. And then you say, wait, we're being pussies. Ha ha! And by the way, if there's any midgets in the audience tonight, I'm whitey, and I apologize. I'm not good, man, I'm not good. I knew I was good at kids three months from my wife gave birth. I was hanging out with buddy Chip, we're at his dad's house, we're building some hot rods. And we have his 10 month old son Brock with us. Brock, isn't that little walker thing they give him? But he doesn't have wheels on it, he's got balls on it. Is that the best way to teach a child how to walk? Because by the way, Brock is seven now, it looks like he's hammered all the time. So we're working on the car, we're checking on Brock. We're working on the car and checking on Brock. And we're checking on him every 8-10 minutes. How much trouble can it get into in 8-10 minutes? I know now, alright? And some people build their houses on hills, and it's not my fault. So working on the car, checking on Brock, working on the car, in the middle of working on the car, we hear this noise. And on top of that noise, what I can describe is a terrified cooing. And we both look up, and Brock had found the garage door a moment before, and he's now going down this 100 foot driveway at about 35 miles an hour. And that little walker thing is just spinning, man. And you can tell by the look on Brock's face every time he came around, that was not intentional. And some people put gravel at the end of their driveways, and it's not my fault. Those little balls hit the gravel, which stopped them really fast, man. Like against the laws of physics fast. And as they say at NASA, Brock was launched. And you can tell from the trajectory that re-entry was going to be trouble. Because he hit the gravel just balled up, and when he stopped, man, it looked like a chip. I know! And Chip, when I turned to each other and went, here's what happened. And you know what, I didn't learn anything from that incident. When my daughter was four months old, I started throwing up there and catching her. Because by the way, ladies, every guy you meet will do this, because we don't know what to do with something this small. And I'm not going to throw it in the bread box, not remote control, I must be able to throw it. So I throw it in my catcher and she goes, oh, and I remember thinking, uh, she loves it! So I just start winging it. Oh, I'm raising an X-Games baby. Her nickname, hang time. And this goes on for like 10, 11 months. Now she's getting language pretty good. And we had a dinner party at my house, all my friends are over. And I'm going to throw my kid is because, well, she's a Cirque du Soleil baby now. I pick her up, I go, boo! I got it, I got it, I got it. And when I catch her, she looks right in my face, in front of all my friends and goes, no, like that! She's talking very well, isn't she? I had been terrorizing her for like a year, man. A midget would have said something. Oh, I got two kids. I got two and a half year boy, five year girl. My little boy, you know, I don't like him much yet. He, uh, well, I made him smile a couple of times, but I'm funnier than that. And if I'm paying your rent and feeding you, I'm the funniest son of a bitch in that house. This is how you wake up. Ah! You're killing me, dad, it's time, I can't take it. You're gonna make me pee. Oh, wait, I'm already pee. Sorry, it's okay, go ahead. Now, he's going, like, my daughter's, my daughter's five and, uh, and there, it's cool, man, because at that age, two to five is magical, where they can just say everything they hear, they suck it in, they say it exactly how you said it to them. It's amazing. And kind of like living with a witness for the prosecution, man, because we had a little incident. Our first incident, my daughter was 18 months old. I had to take her for the day, because it'd been 18 months, and my wife needed a shower. She was getting kind of funky, lady, I'll admit that. So, I got the kid in the car, and by myself, I don't know what I'm doing, I'm just driving. And we had a little road rage incident, not my fault. Shut up, lady, you don't know me. The guy cut me off, man, I catch up, all right, man, it's on! And from the backseat, it's on! But no real damage done, right? Except, I'm the new dad, I'm still my old punky self, I don't let the guy go, I start chasing him down the freeway. What a dick! What a dick! Now I gotta take her home to her mother, and there's no duck tape in the car. So I went to the Walgreens and got some Benadryl. The $7 babysitter! Oh, man, I walked in the house a couple hours later, she was great, I don't know what you're bitching about all the time, she didn't make a noise. Why are you whispering, she's not gonna wake up for a while? And what she does, she's gonna know some new words. But some good ones too, like adult and dosage. She is so precious when she sleeps with her eyes open like that, she's like, So I can do it with that one pretty clean. Three months later, my wife asked me to take her out again because she needs another shower. How many showers does this woman freaking need? So I got the kid in the car and we're driving, and we have another road rage incident, not my fault, but I see a pattern. The guy cuts me up, I slam on the brakes, you know, and I slam against my seatbelt, she jams against her 48 point harness. But I'm a good daddy, I learn my lesson, I don't do anything. I just go, From the backseat, son of a bitch! We're gonna have a little talk with mommy when we get home. It's on, that's right, it's on, hell yeah. Hell yes, it's on. She's cool, man. Both my kids fiercely independent. At 13 months, they both decided they could handle their own lives. Maybe it's because I'm their dad, they're like, Dad, I got it. My boy's like, I don't need you to feed me, give me the fork. Ding, ding, ding, ding, ding, ding. Then child services comes over, I'm like, he did it. And my daughter, man, when she hit three, you couldn't get near my daughter. I take off my own clothes, I take off my own clothes. Okay, hon, but taking up a long, deep turtleneck sweater to a three-year-old is like space travel to us, big people. But here's what I learned, let them do it. So I just back up, let her do it, but I'm timing her. 22 seconds in, the sweater's wrapped around her head four times. She got one eye shown, but it's rolling back due to lack of oxygen. Now the sweater's over her face, she can't see, so she starts to panic and starts running down the hallway to her bedroom. But she can't see, so she's just bouncing off the walls and furniture, and I really want to help her, but I'm laughing so hard I can barely stand up. And she goes into her bedroom where her grandmother happens to be sitting with the little one in the rocking chair. She finally gets a sweater off, goes, ah, son of a bitch. And grandma's looking at me like, it's on. He's so smart. She used it in context. I'm not good, you women, you guys are good with them, you're good with them, you know why? Because you see them differing, you think they're special and precious, instead of tiny and unemployed. Which are the facts. I always tell my wife that she gets pissed, and she's like, look at her, she is Jesus, his little diamond encrusted angel full of love, hope and joy. Every moment with her is a memory. Look at her. She's only going to be this big for three seconds. Look at her. Oh God, now she's only going to be this big for three seconds. I have pictures of my first kid at three seconds, six seconds, nine seconds, and then 15 seconds because dumbass couldn't get the camera ready fast enough. Ha ha ha, she wrote that in the photo album. Although your second kid, you're a little lax with pictures. In fact, if my little one gets abducted, I'm going to have to hire a sketch artist. He's about that big, his head's kind of roundy. Horrible sense of humor. I'm not good, man. You know why? Because I'm a guy. I want it bigger, faster so I can teach it stuff. I don't know what to do with a blob. Let's go pick it up. The car's the detail, lawn's the mow, let's go. The lawn has looked like crap since a midget left. Pick it up! So from day one, man, I got Mike and Todd home from the hospital. I get up every morning and try teaching her, and I talk to her. Parents talk to baby talk to the kids, crack me up. Because you're teaching your child a language, nobody knows. So when it's fine, they'll go, aw, how come your kids retarded? I taught them that. So we give every morning, watch CNN, hey babe, look at CNN, look at that, it's Wolf Blitzer, and that's a two-pay. Oh look, lady newscaster, she's black, Asian, Latino, and a woman. Now that's because corporate America doesn't seem to like to hire a lot of minorities, so instead, they try to hire all their minorities in one. Maybe one day you can change that. Remember this phrase, I'm whitey, and I apologize. Oh look, look, there's a bicycle, yeah. And that's a trolley car, look at the trolley car. Yeah, and that's an airplane, music, airplane, and that's the World Trade Center. Holy shit. On September 11th, my kid was 16 days old, and that morning I got up, let my wife sleep 5am on the west coast, and I'm feeding her a bottle, watching TV with her. New dad, TV shows on the air, new baby, yes! The world rocks, and the towers fell. And the first thing with my head is my dad's voice, well, you brought a new life into the world, and the world's over, nice timing, num nuts. And I freaked, man, I jumped up, I'm sorry honey, it's the worst time of the world, and when I apologized, everything was cool like 2 weeks ago, I swear to God. Because ladies, I want you to understand, something about 9-11 for us men. First of all, it sucked for everybody, but for men, ladies, we protect you. It's our job, we can't stop it, but I have never met a man that can go, 7-47 coming, I got it! And I don't want to diminish what you ladies do, I know pushing out babies is hard. On September 11th, I panicked and tried to put one back. Much harder. My wife was pissed. I got kicked in the face like 4 times. What happened, man? It's been 5 years, this head was going to be 6 months, 5 years. In these countries that hate us, Iran, Iraq, Syria, Afghanistan, first of all, any country that doesn't listen to their women at all is going down. Yes, yes, yes. Ready? Okay. And you're also not easily manipulated, that's nice. You know why, ladies, I'll tell you why, because you are our conscience, that's your job. We're men. Every man you meet, all we want to do is the biggest thing we can do. I'm going to build the biggest thing ever built! And you keep us down, you keep us from being too stupid, it's your job to go, that's great, I got it. Your ambition is incredible. Before you build the biggest thing you ever built though, I want you to remember that you are still you. I'm going to go watch the World Series of Poker. That's your job, but those cats in Afghanistan didn't have that. Damn well some women overheard them planning it too. They were planning 9-11, someone was bringing them food, I don't know what they eat over there, fried dirt, whatever it is, I don't know. I don't see any corn growing, anybody else? Anybody seen a loose cat running around? Nothing. So she's going, here you guys go, here's some snackies for you. What? What you're going to do? What? Is this a drinking game? No, I think it's a bad idea, then tell me to shut up, okay? When you got lost in the desert last year, who got your ass too jalalabad, my friend, that is me? Yes. So let me explain what you're going to do now. Okay, you're picking up the stick with the nail in it, I'll shut up now. By the way, I would have made you some hot food, but you won't let me learn to read a fucking recipe book. Enjoy your cold dirt. By the way, you're from the Middle East. I'm Whitey, and I'm not ready to apologize yet. I'm going to need some time. I don't know, man. In these countries that hate us, for some reason, the more we bomb them, the more they hate us. That's because they don't get it. I think we need a new plan. I think the next country wants to take us on is sending bombs right away. Let's send everybody in that country a color television and a satellite dish. And give them the basic package, not HBO, screw those people. And before the war starts, we make them sit down and watch ESPN 2 for 24 hours. Because if you watch ESPN 2 for 24 hours, you will understand America a lot better. Hi, we're America! We build monster trucks for fun. We develop the top fuel drags for zero to 330 miles an hour in under five seconds. Because, well, we were bored. Piss us off and see what we build. And we may feel bad about it later. Ask Japan. But before we feel bad, we're going to jack you up. And then we're going to send you food. Because we're America. We're schizophrenic. Don't mess with a nation that needs medication. What pisses me off about this war the most is that these rich white men that started it did not send their kids. They sent your kids and your friends. And what is Bush talking about? We have torture centers really compared to who? The guys that were fighting, they're cutting off people's heads with hacksaws, videotaping it and sending the videotape to the family. They call that justice. They call it torture when our guys put underwear on a guy's head, strip him naked, put an egg between his butt cheeks and made him do jumping jacks. If it can't get you into a fraternity at Chico State University, it's not torture. And a big pyramid of naked guys, you're just pledging. The correct response is, sir, may I have another? Dunking a guy's head in the toilet? That's called a swirly. You hook some wires to that toilet? That's an electric swirly. And not as fun as it sounds, frankly. And that chick that was pointing at the guy's penises and laughing, man, I used to date chicks like that. Quit looking at my crock. I did some shows with the troops. I went to Iraq. I went to Iraq. I was in Iraq. I was in Iraq, man. It's cool. I've never flown to a gig in an Apache helicopter, man. That was cool. And in Apache, I'm like, this is the baddest ass shit ever. And then there's cobra helicopters on each side of gunships watching over us. And I'm like, yeah. And then I thought, wow, we could get shot. I don't want to be here anymore. I want to go to a show I can skateboard to. And then I was in Fallujah. I'm on stage in Fallujah and the base is blacked out. And in the show, 350 Marines, they all got guns with them, like during the show. So if they heckle, I'm just going to go, you're right. Good point. Moving on. In the middle of the show, I'm like mid-joke. I was like, boom! And the building shakes and nobody moves. They're like, so I just keep going, you know? I keep doing my jokes. I was like, boom! And nobody moves. Did anybody else hear that? And some guy goes, don't worry, man, that's outgoing. Does that mean there's going to be incoming? Because I'm going to need one of those metal hats. Then I went to Europe to do some stuff for the guys coming back. I was in England actually performing for the troops. England, the day I'm in England, that freaking day I'm doing my show in England. England security, let a man in a Batman suit, Climb Buckingham Palace. I felt so much safer. Who was on the gate that day? Oh, right, step through, step through, step through. You at the goatee. I don't like your look. Empty your pockets, take off your shoes, Batman, go ahead. Yeah! I believe your search is going to be a bit more intensive. Oh no, no, no, no, no, no, no! What? Of course I let him through. He's a superhero, isn't he? Well, how do you know it's not the real Batman? Batman was on the wall of Buckingham Palace for five hours. Yeah, that wouldn't happen in America. Three minutes dead Batman. Dun-dun-dun-dun-dun! Because we have guns here, and we use them. They don't have guns in England. They couldn't get his ass off the wall. They got his sticks. Batman grabbed into my baton and would pull you in. Batman, you're making us look stripping. I can't get him down. Well, maybe I need a bigger stick. What do you mean, why? Look at him. He's huge. He's a bloody Batman. Let's have that half-man. Stupid. But that's also why they caught their terrorists. You guys remember the bus terrorists? They caught those guys in like four weeks because they don't have guns in the country. They could put the picture of the terrorists on TV. The whole country is looking for them. They knew they were going to catch them. You can't do that in America. You put four pictures of four Middle East-looking cats on television in this country and you tell this country, go find them. Yeah, you got 4,000 dead Middle Eastern people the next day. And a couple of Puerto Ricans, frankly. Look, just like him. I've been buying gas from him for a while. Last time I bought my Lotto tickets in my Slim Jims, I suspected something. Then I was in Germany. I was performing for the first Armored Division. Now check this out. The first AD was in Iraq early. They were there 12 months, four days before they were supposed to ship out. They got told they had to stay four more months. Yeah. The only thing I could compare it to is I used to work at Kentucky Fried Chicken. Is that funny? One night they asked me to stay 30 minutes late. On a Friday. I know. I tore my paper hat, punched my assistant manager trainee right in the face. You tell the Colonel he could eat me. So I'm getting ready for the show. I'm over there. I'm getting ready for the show. Here's what I didn't realize. I didn't realize how young these kids really were. I met some of these soldiers and it was like, are you going to war today? Who's going to war today? Yes you are. You got a nice metal hat. Don't you? So young kids, two young. I'm walking around and getting ready. And these four MPs walk up on me and they walk up harsh. And they're like human trees with baby faces. So it was like, ah. And they walk up serious. Mr. Tidus sir, excuse me. Mr. Tidus sir. You can say it all you want, man. I'm not doing push-ups. Very funny, sir. Sir, our sergeant, Sergeant Pepper is a huge fan. Would you come over and meet Sergeant Pepper, sir? Sergeant Pepper. Yeah, then maybe you can introduce me to Colonel Chicken. I told him to eat me a while back. Again, sir. Hilarious. Sir, please come over and meet Sergeant Pepper. Fine, let's go meet Sergeant Pepper because I am the war risk. Cuckoo cuckoo. Let's go. So we start walking across the base and here's where it gets weird. Because these guys aren't hanging with me. They're just walking with me. There's two guys in front of me, two guys behind me. And they're just walking in lockstep. And I'm between them. I'm like, what the hell? What did I say? Because two of them are green berets, man. And they could kill me with a napkin. And we don't stop for anything. We just haul that across the base and I'm like, what is going on? And I finally see why because I see Sergeant Pepper. And Sergeant Pepper is bigger than all these guys. And he's got a big mug of beer in his hand because we're in Germany and that's what they do. Except Sergeant Pepper is in a wheelchair and he's got the top of his arm blown off and both of his eyes got blown out in Iraq. And standing next to the wheelchair is Sergeant Pepper's pregnant wife. Yeah. And one of the guys goes, Sergeant Pepper, comedian Christopher Tyder is standing right here. He seems to be hilarious. And Sergeant Pepper turns and goes, Titus! Dude, your show rocked. And I want you to know, me and my guys appreciate you coming all the way over here and performing for us. I cannot tell you what it means to us. Thank you. You're welcome. And I didn't know what to say. And I'm pretty good at finding funny in a dark place. I have no fear of that, but I had nothing, man. I'm just a douche. I don't know what to do. And it's just this weird silence. And then one of the guys saved me and he goes, Sergeant Pepper, who'd you like a picture of you and Mr. Titus? And Sergeant Pepper turns his head and goes, who the hell's the picture for? And dude, I'm on the floor rolling on the grass laughing. And the dude was making fun of himself and after all this stuff and my first thought was, my God, is that who we sent over there? Is that the kind of heart and character these kids have? Because if that's the case, the world's not coming to an end right now. And I had some hope. And I went home and let my wife give birth to our first child for the second time. And I started watching CNN with her again. Hey, look at CNN again. Look at that. Yeah. Yeah, look at that. It's a park. And there's a white guy and a black guy and an Asian guy and a Latino guy. And, okay, that guy, he's Canadian. Don't worry about him. They never affect the world much at all. But you see what they're doing, huh? That's called praying and they're doing it for each other. Your daddy's never seen this in his lifetime. Maybe I was wrong. Maybe this is the best time to be born because that right there, that's what it means to be an American. And they're praying for peace. And if we can have peace, we destroy the people who screwed up the peace so we can have some damn peace. I'm going to teach you how to pray. We're going to go to church. No, wait, we can't. You might get fondled. No, you're a girl. You're safe. What is going on? End of the world. Guy's supposed to leave the world. What is going on? End of the world. Guy's supposed to lead us to glory. Do it over their hands on little kids' pants. What is up? One priest in Boston. One dude. Messed with over 100 kids. 100 kids? Yo, Father Gropie, it's not an Olympic event. How sick is that, dude? He's up there on Sunday preaching looking down. Ooh, his vestments are tight and he's swinging that smoky thing, shaking it. I don't know what the smoky thing is called. Don't you think if you're jonesing for a boy scouting you have an altar boy monkey on your back, you should find a way to stop, man. Go to the home depot, get a sledgehammer. Kill the urge. I feel bad for these priests. You know what I wish they had? I wish they had, oh, I wish they had like a god to pray to for guidance. Or maybe like a book with some rules in it they could read. And don't misunderstand me. I believe in God. I look at my two kids and I know there's something. I was married 15 years. God exists. I survived three years on the Fox network. There is a God. But I don't trust the church anymore and that's sad because they've done good work in the past. They fed the hungry. They've helped the homeless. When it comes to raping little kids, they dropped the ball. How do we help the church get their respect back? I have a plan. Pedophile crucifixions. It's their idea. We're just going old school. BC dog. I'll tell you what, you walk in on Sunday, one of those bad priests in the hill up there, it's going to change your opinion about the church. Holy shit. God did. Wow. I'm wearing a mask. I'm wearing a mask. I'm wearing a mask. I'm wearing a mask. I'm wearing a mask. I'm wearing a mask. Oh, I'm wearing a tie next week because it comes in when my father said, step up or step aside. The one thing the church hasn't done is step up and deal with the problem or step aside and let the authorities do it. And if they did, if they just did it and got serious, and all of us knew that the second someone laid a hand on the kid wrong like I was gone, you know what would happen? The church would be full of the raptors again. You know what else would happen? Pious men of God would show up to be priests and getting great men. Men with light coming off them. So you went out on Sunday, they would be a great man of God in front of you. One of those old school guys, oh good morning everyone. Happy Sunday. How're ya feeling? How you feeling today? Well, well, first of all, I'd like to think that Tarelli Brothers, for taking down the life-size Jesus and nailing up Father Feeney in here. I know, I know. Shut up! Quit your screaming if it's good enough for Jesus, it's good enough for you. Now, today we're going to learn about retribution. Oh, and we're going to sing some songs. I want you to think of it as a crucifixion karaoke. Shut up! Take it like a man! Oh, I'm sorry, Gregory, I know that's what he said to you. Don't cry. Oh, don't be owing me in my own church, okay? I'm handling it, aren't I? And Gregory, wipe the tears from your eyes. Come on, do what Jesus would do. Cowboy up. Now, first of all, I'd like all the little children this bastard mess with to please step forward. All of you, oh, cheese and crackers, okay? Well, I hope Satan loves ripping the flesh from your bones and feeding it to the whorehounds. I'll hell you maggot! And that reminds me, don't forget about the bake sale on Wednesday. Now, I'd like all the children to please farm a single fireline because, well, I've only brought one nail gun. I wasn't expecting the overflow. And Gregory, you're first. Come here, boy, let them through. There you go, boy. Come here, there you go. The trigger's right here. What? Of course you can shoot them wherever you like. No, don't you be upset. This is just you nailing him. Come on. Now, if I have angered or offended anybody with that piece of material, all you have to do is give me the pro-raping little kid side of the argument. That's what I thought. And by the way, if you're in here tonight, all right, thank you. Thank you. That was great. Because you guys are like, you guys say, hold up, hold up. No lightning bolt. All right, we clap a little bit. No, his ass is in a burning ember on stage. Clap a little bit, all right. And by the way, if you're in here tonight and you're really high up in the church, I'm whitey. And we're still waiting for our apology. I got to tell you, you know what? In the last 20 years in this country, I believe we have pushed out of society. You guys remember your fathers and grandfathers? They've taken the crap we've been taking the last 10 years? Hell no. If I'd have got messed with the church and my father'd found out about it, papers would have read a lot different. It wouldn't have said priest, lead counseling. It might have said massacre in church. Because my father had an on-off switch. That's all he had. Amen. I'm a light of candle for you before I go. Remember those guys? We need to be those guys. My father was insane. My father invented road rage. He wasn't the first guy to get mad in the car, but he was the first guy to get mad enough to make the paper. Oh yeah, this happened when I was 6 years old. It was a time before car seats. When if you're a little kid and you got in a car accident, you just bounced around the interior until you hooked the door handle. You were just a little kid. You were just a little kid. You were just a little kid. You were just a little kid. You were just a little kid until you hooked the door handle. My father picked me up from school. My dad's 6'4\", a three-piece suit, salesman. Driving home and this kid in this impala is just mess with him. Trying to run him off the road, flipping him off, screaming at him. And my father handled it pretty well. I knew he started to get pissed though, because he put down his beard. And he pulls over these railroad tracks and he stops. And the kid screams up behind him. He's flipping him off, yelling at him. I'm now standing on the passenger seat looking at the back window, because I know there's going to be a show. And my father didn't say a word. Just got out of the car, walked back to the kid in the impala, who was dumb enough to leave his window down. Not my father's fault. And he's still swearing at my dad, who's 6'4\", and looming over him. And I can see what the kid's saying, because I could lip-read swear words when I was a fetus because of my father. But the kid only gets half the word out. He goes, mother! And my dad goes, wham! And I'm 6. Here's what I saw. Here's the kid's dashboard. All I saw was, mother! And he never came back up, man. It was just an abandoned vehicle at this point. And my father didn't say a word. He just kind of checked his work, got back in the car, went, sit your ass down! And we went and got ice cream. And I said, mother, don't get up. It's like... Remember those guys? Here is the most sentimental of my father, because he's guys weren't big on sentiment. My father had a bunch of heart attacks. I think he was going for the record. And after his fourth heart attack, he sat me down, and he said, look, I've had four heart attacks, my body can probably only take three more. So when I go, there's some things I want you to handle, and I said, now, right? No, because I don't tell you now, you'll screw it up when I'm dead. I want to be buried in a cardboard box. What? Shut up or I'll flick this in your other eye. Cardboard box. I want to take the box, I want you to put it in front of the audience at the funeral. Ho, ho, hold up, dad. Did you just call it the audience? Are you going to charge a cover? What do you think we could get? Hey, ladies, get in free. Now, I want you to leave the lid of the box open. I want you to let everybody, who I've pissed off in my life, step up and take a piss right on me. What kind of music do you want with that, dad? Blue Eyes Crying in the Rain by Willie Nelson. Okay, dad, let me get this straight so I don't screw it up. While we're at your funeral, and it's ladies night, while your friends are urinating on your corpse, you want me to play a song with the word rain actually in the title? Now you're getting it, numbnuts. And after the funeral, I'll bury next to grandpa. Shut up, I don't want to be buried next to a bunch of dead people, especially my father. I want to be cremated. Then I want to take the ashes, I want to put them in a douche bottle, find a hooker and run me through one more time. On my children, I did not write that. I am repeating it. And it's one of those things when you hear it, you go, oh! Hmm. Disgusting yet whimsical. We had New Year's dinner with them a couple years ago. And at this point in my dad's life, my dad has had six heart attacks. I'm not sure if I'm going to get it, but I'm going to get it. And at this point in my dad's life, my dad has had six heart attacks. He had dinner, ordered himself a 24-ounce prime rib. And I'm a grown man, I couldn't even talk. I went, mother, are you, what the, I can't, you know what, you didn't, you didn't, ah, ah, ah, ah, and he looks at my wife and he goes, California public schools, can you translate? And by the way, if he goes first, I'm going to be all over you. Dad, what? My doctorate to HMO said I could eat as much fat and crap as I want. It makes my heart work harder, makes it stronger. Well, with that logic, dad, let's put some cheese on it. And after dessert, I will punch you in the A-order. So the show is going well, I bought myself a gift. I bought myself a Dodge Viper. Cool car, except we were going to the snow, yeah. Said you can't take a Viper into snow, only had to learn that one time. Ha, ha, ha, ha, ha. So I said dad, why don't you take the Viper for a couple of weeks, send it back to LA when you're done, because all this will make sure you put a 450 horsepower vehicle in the hands of a terminal heart patient. I'm a retard. So we went to the camera, the camera for four days, on the morning of the fourth day at 7 a.m. I get a phone call, and this is verbatim how I hear my father pass. I pick up the phone, the guy goes, Mr. Titus, Newark Police Department, your dad's dead. Kind of harsh, isn't it? And I know a lot of comedians, and it sounded so weird the way he said it, I went, Okay, fucker, who is it? So it's Newark Police Department, your dad's dead, don't call me fucker. And although we had been expecting it for a long time, you are never ready for something like this. And my brain kind of snapped, and I went into denial, and I said, poke him. And there's this really long pause, and the cop says, excuse me? And I said, poke him, he could be dicking with you. And there's a much longer pause. Sir, we've poked him, he's not dicking with us. And then I said something that sounded so wrong, and I did not mean it in the way it sounded, I said, is the viper okay? Because I thought I'd given him the death car, I thought he flew off a cliff, or wrapped it around a tree, I thought it was my fault, but the cop didn't hear that part of it, he goes, sir, your car is fine, again, it's your dad that's dead. Shall I poke the car, sir? So I gather everybody at my head down the mountain, I have to admit this, I had mixed emotions, although my dad and I fought his whole life, the last five years of his life, we were best friends, I was sad. I was also really pissed, I was like, I couldn't get the deposit back on the ski condo, I rented for the week, you know, it was like his final FU to me. Well, your dad's got a terminal heart problem, and you're going snow skiing, not for long. So I show up at the house, the whole family's there, and I'm the oldest kid, I got to plan the funeral, so I go down to the funeral home, but I take my brother and my sister, my sister Shan is here, my brother Dave's here, and I'm sitting in front of the funeral home, in the eye guys office, and they have, they make so much money, man, the guy's, I'm sitting in front of an $8,000 mahogany desk, the guy's got a $3,000 to $85 haircut, perfect funeral guy, and he goes, Mr. Tider, we are so sorry for your loss. Did your father have any specific wishes on how he wanted to be there? And I look at my sister, before I can say a word, she goes, you tell him. And the man knows I have a TV show, so he's showing me the most expensive caskets they make. He showed me, I'm not making this up, a $17,000 platinum casket, with a DVD player in it. Yeah, it's in the viewing lid, there's one of those headrest screens, you can slide a DVD and play a tribute video to the person actually in the casket. And all I can think of is, my God, man, you're in a so fight over that DVD player? I said, no, that's nice, but my dad didn't want to be buried in something metal. Or wood. Did you have something... corrugated? Pardon me, sir, cardboard-y-er. Excuse me, cardboard, my father said he wanted to be buried in a cardboard box. And the man had obviously never heard this sentence before, man, because his face went into like epileptic seizure. Frankly, it looked like he tasted butt, man, because he went... And my brother Dave tries to help me, but then he goes, hey, hey, hey, not like a refrigerator box, something nice. And my sister loses it, he loved cardboard. And you ever tell somebody something, you ever tell somebody something they didn't want to hear, so they decide that you didn't say it? He just pushes the expensive casket, because I take out the Walmart casket, and it starts clipping through that one, and I'm going, no, no, no, and get down to the cheapest casket you can buy, which is basically a slat crate with Home Depot burned in the side of it. And I got pissed, I said, look, my father said he wanted to be buried in a cardboard box, then we'll talk about the cover charge. And he slams it, and he goes, fine, I can give you a rental casket. To which my brother Dave says, who brought it back? Which is a genius question, by the way. But the guy gets the butt-tasting look on his face again, and he goes, no, we have caskets for situations like these, looking at me like cheapest bastard in the world situation. Well, the end of the casket opens up, you take your father, put him in a cardboard liner, slide him in and close the end on him, so now my dad's in this huge pez dispenser, great. And we had the funeral, and my dad's best friend Bob said to me, Titus, that was the best or worst funeral I've ever been to. Because number one, standing normally, packed to the walls. We made about $2,000 on the door. And everyone got up and told an honest story about my dad. Not some BS, this was the greatest man ever. Here's one of the stories, they used to go houseboating every year, and all they would do was drink all day with a bunch of firemen buddies. My dad hung out with firemen because he smoked in bed. And then we could hammer to sleep on top of the houseboat at night, and during the night instead of peeing in the boat, you know, in his head, they would just pee off the top into the lake. Well, one night my dad gets up eight times, hammered, steps on everybody, pees off the boat like eight times, and they get up the next morning to look around and have him peeing. All night my father had been peeing off the top of the houseboat into the driver's seat of his homeboat. That's a beautiful story, isn't it? It's beautiful. And there was ten stories like that, man. So here's the funeral, historical laughter weeping, historical laughter weeping, and it was beautiful and offensive and perfect, and I believe illegal. And then it was over, and everybody went home, and it was just me and my dad. So I peed on him. But now I'm freaked out because I got to find a hooker, you know? And if I'm asked for the normal stuff, it's already going to be weird, but now I'm getting out of the car in an alley, you know, I got the whole family getting out behind me, everybody's crying, I've got an urn and a douche bottle. Lola, is it? Yeah, we want something a little freaky. And I couldn't go through it. I called my brother and sister, we had a no douche meeting, I said, I'm not doing this. So we came up with a compromise because he's stolen it on my father, right? So here's what we did. We took half his ashes, spread them at various Victoria's Seeker dressing rooms around the country. The rest of his ashes went to Caesars Palace in Lake Tahoe, Nevada, because my dad was a huge gambler. He's one of those dads who had a little quarter jug, he'd fill it with quarters at the top, and when it got to the top, he'd take his little jug to the casino, you know, and then he'd take like ten grand out of the bank. And casinos have a lot of rules, one of the rules is not to not spread your father's ashes amongst the casino patrons. So my brother and my sister and I walk into Caesars Palace, 7 p.m. Saturday evening, pockets full of day. And I walk to the back of the casino, it goes all the way across, and I start walking down, and I start flipping out my father. Amazing great house, sweet, the sound, ding, ding, ding, ding, ding, ding, ding, ding, ding, that's it, oh, it's seven like me. And I get to the end of the aisle thinking nobody saw him, cool, I look back, I'm leaving a con trail of smoke behind me, like I'm a jeep going across the Calahari Desert, man, and the whole casino's kind of looking at me, and I have a TV show on the air at the time. Is that Titus? Is he on fire? What distracts them is my sister Shannon, who's way crazier than me. She takes a handful of my father, walks to a packed blackjack table, and goes, magic dust! And now there's this cloud kind of hanging, and the pitfalls start walking over, and I'm just stuck to the carpet, man, I don't know what to do, man, I'm frozen, I'm freaking out, man, this is the weirdest thing I've ever been involved in, and I've been involved in some pretty weird shit, man. And I couldn't move, and I thought I was having a stroke, because my heart was pounded, and all sound went away, and I swear to you, the only thing I could hear is my father hysterically laughing, and I knew he was there, because of the cloud settled, and parts of him dropped into people's drinks. He gave me a sign, because the dealer was right in front of me, he put a blackjack in a whole table lost, oh my god, he's here right now, that's what happened to him every time, that's why I went to community college. Worst part of my dad dying, two weeks before he died, my wife told him she was pregnant with our daughter, yeah, nice timing, numb nuts, dad, what did you say my whole life, huh? You better not have a kid, you're a retard, you'll probably kill it, remember when you didn't feed the dog when you were seven? That's gonna happen to your kid, you're gonna need grandpa around to raise that kid, turn that kid into an adult, isn't that right? And what happened, huh? What else you stuff up my ass my whole life, huh? Step up or step aside, right? Step up or step aside, and what happened, huh? World's coming apart, I got two little kids, and you're not here. You stepped aside, that means I gotta step... up. Oh... funny. Okay, smart ass, Kenny, come here, grandpa wants me to tell you something. Come here little one, come here, come here. Listen, um, look, I'm just your dad, okay? I'm not a superhero, I can't even climb Buckingham Palace. And I can't stop some idiot from crashing an airplane into a building or blowing up a bus. I can only be your dad and give you a few pure truths. Number one, duct tape will save your life. Number two, Tupac is alive. But I need you to keep that on the DL because of Suga. Number three, and this is the most important one, don't be afraid of anything, except for the television news, because they're lying to you every night. And don't be afraid of failure, be like your father. If I don't fail, I succeeded finding what doesn't work. And little one, don't be afraid the world's going to come to an end. It can't. Because you're here now. And I promise I'm going to get up every day and I'm going to fight to make sure you have as many birthdays as you're supposed to have. But I'm going to need you to get up and fight with me, okay? Okay, daddy. It's all. Thank you, people. You guys are great. Thank you so much, guys. Thank you, Miami. You guys are great. Thank you, guys. Thanks again. Thanks for listening. We haven't had a long time. Thanks, man. Thank you, guys. Good night. Thank you. See you again. Thanks. Thanks, guys."
}