{
    "url": "https://www.youtube.com/watch?v=lMdbiUvn_kc",
    "title": "Def Comedy Jam - Martin Lawrence",
    "transcript": " Single Jia came in return for company tlogue.소ing-j etc. Fuckin' high enough! Shit. I don't sit there and try to look cool and shit, like. I don't give a fuck who you want. You know what I'm saying? Put your money in my motherfucking pockets. What's your name, man? Hobo Scratch. Who? Hobo Scratch? You got a girlfriend, man? Man, you better get another name. You don't call nobody house. I speak to the peanut. Yes, can I tell her who's calling? Hobo Scratch. That shit don't mix, man. Darren, you're Darren now, all right? I'm a fucking Darren. That's your thief name, Darren. What's up, man? All right, shit getting a little fucked up up in here. I know you want Dresda Grove, but right now, something's not like a Chia Pet type shit. It's not flowing. It's not. I'm fucking with you, man. Just fucking with you. Yeah. Ha ha. I feel good though, y'all. I feel good. I mean, thanks to all you guys. How y'all doing up there? I ain't forgot about y'all. Thanks to all you guys, I'm doing well. I'm very happy. I'm fat like that. I'm growing like that. What the fuck is that record? What is that? I mean, first of all, I said, give Capri a round of applause. He's... My fucking blew up, didn't he? He's arrogant now. I said, hello, kid Capri. Oh, I'll see you on the set. You've changed, man. What is that record though, man? What is it? I'm fat like that. I'm cool like that. Oh, you know that. He know that. I'm cool like that. What is it? Diggable planets. I'm cool like that. I'm fat like that. I'm fat. What the fuck are they talking about? I'm gonna fucking make an album or anything. I got shoes like that. I got shit on my mind like that. I'm just tripping like that. I stink like that. I fuck like that. And it's shit selling. I go back to the old days with the rappers. I'm gonna, you know, I'm into that shit, man. Run DMC to all the boys, you know? But y'all some cold fans sometimes. Y'all do rap boys bad. If you're gonna support them, support them always. If these brothers working hard, they get staying out the street. Nah, cause you know, I was in Atlanta, you know, and I saw a Mo Die. I remember a couple of years ago, Mo Die was the shit. How you like me now? Saw him in Atlanta with a crisscross jacket on. Confused like a motherfucker, dude. I'm telling you, I must be doing well. I'm at Michael Jackson. He wanted to meet me, y'all. That shit tripped me out. You know, I was like every brother in this motherfucker, I was like, you know, cause I thought I would never meet Michael Jackson. And, you know, I was like, fuck, don't give fuck about no more fucking Michael Jackson. I mean, he was bad when he was doing AB. I was like, what the fuck, man? I'm not gonna let him do that. I'm not gonna let him do that. I'm not gonna let him do that. I'm not gonna let him do that. I'm not gonna let him do that. I'm not gonna let him do that. He was bad when he was doing ABC and all that shit. You know, but fuck him other than that. Soon as they came to me and said, Michael wanna meet you. Michael, who? Michael Jackson. Shit. I was like a little bitch walking to Michael room, huh? How you doin' Michael? Let me feel your toes, oh my god. Oh my god. Yeah! Ah! But that's the best hip band motherfucker boy though. Ain't nothin' changed, y'all. But I'm havin' fun. And these comics are comin' out here because you know we present all the best young comics out here, you know what I'm sayin'? So if anybody tell you they ain't out here, that's bullshit, cause these brothers are workin' hard for you. These are guys you don't see on even at improv or comic strip live, cause they don't want you to bleed they out here. These motherfuckers here tonight on the death jam. This is where we as black comedians come together and unite as one. On the motherfuckin' death jam. We grab our dicks, we do everything. On the death jam. So y'all ready have a good time? Yeah! Let me say it, huh? Yeah! Now louder than that. Yeah! And what the fuck are talking about?"
}