{
    "url": null,
    "title": "Jimmy Carr Laughing and Joking (2013) - FULL LIVE SHOW",
    "transcript": " Well, let's crack on, shall we? Good evening, you well? Yeah! Fantastic. I've been described as the hardest working man in comedy. Not that impressive, is it? The hardest working man in comedy. That's like being the best looking guy in the Burns unit. LAUGHTER No offence to any Burns victims we go in. Are there any in if there's one? They'll be fucking loads. They tend to stick together. LAUGHTER And we're off. Someone came up to me outside and went, I thought you'd be younger. I said I was. I'm 40 years of age, but girls still check me out. I wouldn't mind, but they're so bloody obvious about it, pointing and whispering, Stranger danger. Every night after the show, I have attractive women banging on my dressing room door, and sometimes I let them out. Are there any comedy groupies in here this evening? Any gag, hags, any chuckle fuckers? The only reason I ask is if any girls come up to me after the show looking for sex, I'm going to have to disappoint you. I mean, we can have sex. Just it will be quite disappointing. I wouldn't lie to you, it'd be like throwing a sausage up an alleyway. More information than some of you wanted, OK? I'm a stand-up comedian, a TV host, an actor and a writer. People ask me, what's your secret? I'm the M4 rapist. LAUGHTER It's a joke. I've never been wrongly accused of rape. We all like a laugh, yes? Yes! That's the one thing we've all got in common in this room. We all like a laugh. It's a very British thing, I think, to come out of an evening with the express intention of just having a laugh. Here's a great fact about this country. The average person in Great Britain laughs out loud ten times a day. Not everyone, obviously. If you work in a hospice or with learning disabled adults, it could be ten times that. LAUGHTER Sky's the limit. LAUGHTER Yeah, that's my laugh, which is... Someone said my laugh was weird. My laugh isn't weird, it's wrong. Cos you're meant to laugh on an outbreath, aren't you? You're meant to laugh on a ha-ha, ha-ha-ha-ha-ha. I laugh on an inbreath, it's ha-ha-ha-ha-ha. Sounds like a goose being interfered with. Someone asked me the other day, is it fake? Why would you fake that? Ha-ha-ha-ha-ha! They say that laughter is the best medicine, so maybe, just maybe, if we all keep laughing at people in wheelchairs... I'm a dreamer, what can I tell you? I was at a show recently, I don't know if anyone's had this experience, I was at a show, watching a band, and standing just under the fire escape, watching a band play, pint on with a mate, relaxing, and a lady from the venue came up to us, in the little waistcoat and the little name badge came up, and went, excuse me, you're going to have to move, because if there's a fire, you're blocking the exit. I said, I'll tell you what, love, if there's a fire, I'll move. Ke-ree-tah. What did she think I was going to do in the event of a fire? Just stand there going, nobody move! Why has everything gone orangey and hot, I don't like it! Oh, mobile phones off, I should have said that at the top of the show, mobile phones off, has occurred to do to the other patrons in the auditorium. I say mobile phones, what I mean there is phones, no-one's brought a landline, have they? Let's face facts, the landline is dead. When the landline goes in our house, there's panic. Shit, the bed, who the fuck is that, we're both here. A lot of people text whilst driving, I'm not excusing it, but we've all done things we regret when we're drunk. I saw a thing on the news, it said that bad drivers are going to get on the spot 100 pound fines. I thought, it's a bit sexist. Do you understand that? Yes you did. Yes you did! I'm not being sexist, how could it be, some of my best friends are slags. If this sexist, you could be the judge on this, sorry for being rude, but do you think chat-up lines are sexist? No, they're not, they're fun, right? They're cheesy, but they're meant to be cheesy, that is their charm. I like that one, get your coat, it's cold in the boot with my car. I don't know if this ever happened to any of you, I was checking into a hotel recently, it's about one o'clock in the morning, after a gig up in Manchester, walked into the reception area and the guy recognised me, he went, Mr. Carr, we put you in a disabled room. I said, what's the difference between a normal room and a disabled room? And he said, the disabled room's got a walk-in shower. It's taking the fucking piss, isn't it? I've got a question for you, ladies and gentlemen, does anyone in this room believe in the supernatural, ghosts and spirits and the like? Quite a lot of you, it's actually easy to tell if your house is haunted. It isn't. Grow up. That's me being cynical, but that's this job, being a stand-up comedian, I think makes you a bit of a cynic. Has anyone in here actually seen a ghost? Well, come on, what did you see, madam? Tell us the story. There was no one there. Come on, what did you see? I'm not, I make you nervous, you've seen the undead. And I make you nervous. Doesn't really show me in a good light, does it? Where were you when you saw the apparition? You were in a friend's house, right? Her stepfather was what, sorry? I think I may have cracked this case already. There's a stepfather involved. Was there ectoplasm? Go on, what happened? Were you upstairs? You were in his son's bedroom. Of course you were, love. Go on. He had died. You should have mentioned that sooner. And then you started seeing weird shit. I'm loving this. There's a special name for people that have seen ghosts. Schizophrenic. All the best with your future. Quite an in-depth story. I'll leave it at that stepfather did something terrible. And you've recoded that memory. Of course, not all fat people are jolly. Some of them are women. It shouldn't be mean fat girls got feelings. Mainly they're hungry. It's only a joke, isn't it? It's only a bit of fun. I told her the other night, I got up and walked out. Well, waddled out. I presume offended, possibly just peckish. Whenever I'm in the changing rooms at the gym, I'm always embarrassed by the fact my penis is so much bigger than everyone else's. But then in fairness, it is erect. I'm not a fan of the Islamic fundamentalist sex dolls. Do they blow themselves up? In Palestinian passports, under occupation, do they just put Israel? I joke he's only there to test where the Guardian Readers are sitting. No further questions. Back to the knob gags. I do talk about sex a lot in my show. I talk about sex all the time on stage. A friend called me on it recently, came to see the gig, and he went, you talk about sex all the time? Are you obsessed? I said, well, I'm not obsessed. But sex is the great universal topic for comedy. It's still quite taboo to talk about it openly in public. Everyone's interested, everyone cranes forward, and there's a lot of tension around sex, and where you find that kind of tension, that's also a great place to find laughter. So sex is a great topic for comedy. But it's difficult to stand in front of you good people and talk about sex without sounding crude. So to try and mitigate that, to try and alleviate that, this evening, if I refer to a vagina at any point, I'll be calling it a twinkle cave. As in, so there I was, licking out a twinkle cave, while she deep-throated my tummy banana. It's nice to be nice, isn't it? I saw a woman wearing a top, it said, super dry on the front. I said, have you thought about lubricants or HRT? Maybe a little bit of Aussie charm? Are you familiar with the term Aussie charm? Just means... Australian charm, you're welcome. A very pleasing look from the ladies of London, as if to say, well, I didn't know that had a name, but yes, that does happen. My girlfriend bought a t-shirt for £80. That's a ridiculous amount to spend on a t-shirt, am I right? It said D and G on the front, I suppose, fair enough. One of her tits is bigger than the other. I thought my girlfriend was a slag when she told me I was her 32nd lover, and then I realised she was talking about time. There is a minimum comprehension level you may be asked to leave. My ideal woman would be a single mum once I'd finished with her. It's a joke, I beg for the abortion. Ah, I got you again, I fucking wouldn't. Let's talk about something a little bit more serious. It can't always slapstick abortion stuff. My first wife was from Thailand. Well, don't, because you'll feel bad. It's actually quite a sad story. My first wife was from Thailand and she died of testicular cancer. Probably the best way I could describe it is her twinkle cave was an alti. I saw a transvestite in a mini skirt. I thought, that shows a lot of balls. Let's hear from all the heterosexual men in the room. Can you just shout out the heterosexual men? I'm guessing from that expression. I can't remember which one heterosexual is. I'm not taking the chance, maybe this is how they recruit them. The most annoying thing my sister does is that show Chatty Man. I'm not going to say that. That's the most annoying heckle that I get at gigs. I like it when people join in, I like a bit of a heckle and a bit of fun. But the most annoying one I get is when I've set up a joke, just about to the punchline and someone goes, invariably it's the same thing, it's always, where's Alan? Where's Alan? It's not more like bet noir, it's just a bit annoying. Where's Alan? Who's in your house fucking your dad? I think we all knew, including him, I think we all knew that was a trap. I could feel you as one going, hold, hold, hold. And then one brave soul over there said no. Now I'm taking one for the team. Or rather your dad is. Of course, not all gay people are happy, camp and fun. Some of them are lesbians. If you're a lesbian and you didn't find that funny, you're surprising no one. Are there any lesbians in? No, my gay dar is pretty much honed in on this, this pair down there. Hello, how are you two, you all right? I presume you're a couple. Married. You're married? Congratulations. Fabulous, how long have you been married? Since October. Since October, my god, it's new and fresh. Have you even finished consummating the relationship? You don't know when you're finished, do you? That's one of the problems. With your lifestyle choice. We'll just put that on hold, we'll be back in a minute. Well, so you're married, you're committed to each other. Well, it's maybe a crazy question to ask you, because you're in this long-term relationship and you love each other, but what would it take to get you back on solids? She's a definite no when you're a maybe, okay, great. I love my job. I tell you what, I'm going to do a test and see whether we've got any other sisters in the room, see if there's any other lesbian. Sisters, like I'm a lesbian, I've got the haircut, come on. I look a bit like K. D. Lang, I could get away with it. I'm going to test the heterosexuality of the other ladies in the room. Just a simple question to test this. Ladies, have you read Fifty Shades of Grey? You've all read that book, you love that book. I would describe Fifty Shades of Grey as the ultimate flick book. It was the best-selling book last year. What's the world coming to? It was the best-selling book last year. I can prove it. Last year, Wettest on Record. I think it's a very interesting book, because although it's not a great piece of literature, it's more gusset typing. It's interesting because it's pornography for ladies. That's what it is, right? And men, that book is in our houses, isn't it? Fifty Shades of Grey is in our houses. We've not even picked it up. We're not looking at your pornography ladies. We're not interested in your kind of pornography. We're very happy with the service broadband is providing. Ladies consume pornography in a very different way to men. And the genders are very different in our consumption of pornography. Here's a fact, gentlemen, that will blow your minds about women's consumption of pornography. Women watch porn films to the end. You know why? To see if they get married. Well, it's probably a good time to talk about how political correctness works in stand-up comedy. Some people think it's a free-for-all. You can say whatever you want on stage because of freedom of speech. That is not the case. There are rules and regulations that govern what I do. Basically, how political correctness works in stand-up comedy is, if you're directly affected by something or involved in something, you get a free pass. You're allowed to joke about that thing. So, for example, homosexual people can joke about being gay. Disabled people can joke about disability. Black or Asian people can joke about race. Those are the rules. So, these two pedophiles walk into a park. Child abuse, there's a touchy subject. I saw a headline in the paper. It said, please smash pedophile ring. I thought, good, let's see, are they fucking like it? Have we got any teachers in this evening? Can you show any teachers? Oh, loads of teachers in. You work bloody hard, don't you, teachers? Half the year, five hours a day. I'm not knocking it. I could never do what you people do for a living. Not because it's difficult. I wouldn't pass a CRB check. I've actually got a bit of a soft spot for teachers. I used to go out with the teacher and she was lovely. But if ever I wanted sex, she always insisted to put my hand up first. That is ruder than it first appears. You're welcome. Have we got any special needs teachers in? You teach special needs? There's a woo over there. What's your name, madam? Danielle. Danielle, very nice to have you in. All I was going to say about special needs teachers is you are the best and the brightest, in my humble opinion, the best and the brightest teachers. Because I can prove it. We all know teachers socially, yes? Everyone knows teachers. And teachers are always moaning on about, oh, I've got homework to mark this evening. Not you. How are you, Danielle? You're not grading potato paintings, are you? Fucking. Your evenings are your own. Fair play. Is that a little yay? See, the other teacher's looking. I'm fucking annoyed. I didn't think of that. What's that? What, sorry? You used to teach at my school, at Burnham Grammar. Not when I was there, surely? No, unless you moisturise a lot. Where are you from? You're from Belfast, right? Ginger and community. That and ha-ha-ha. Ha-ha-ha-ha. Ha-ha-ha-ha. I was just saying what you said to me back. How come you're teaching over here, then, you and the witness relocation scheme? What the fuck happened? Fucking grass. What do you teach? What subject? English? English, you could barely fucking pronounce. I did Countdown recently, the TV show Not Dracula's Special Needs Brother. What for the staff room? And I got asked when I did Countdown. When I did Countdown, I got asked, by every man that I know, everyone asked me, how fit is that Rachel Riley off of Countdown? How attractive is she when you meet her? And it wasn't like a rhetorical question, they wanted me to answer. And I thought, well, I should be able to say what even a work colleague and a friend is, without sounding misogynistic, without being sexist, shouldn't I? Let me, you be the judge. Rachel Riley, let me put it this way. I would crawl over broken glass to suck the cock of the last man that fucked her. I don't think that's overstating it. Ha-ha-ha. I like to fuck her brains out, take her eages. Ha-ha. Now, I should warn you, there will be some audience participation this evening. Apologies. And the only reason I mention it explicitly is because sometimes when I ask them a direct question, they get a bit flustered. I think it's because they used to see me on TV, so then when I ask them a direct question, they get a bit, what the fuck is going on? I didn't press the red button, it's gone all fucking interactive. I got a guy wonderfully flustered the other day, front and centre where you're sitting there, and out of nowhere I went, are you married or single? And the guy next to me went, he isn't. How could you fuck that up? There was a lovely little pause, he went, I think I might be single now. I wonder, who's seen me lie before? Give a shout. Yeah! Well, you know, every year my friend Chris does illustrations for me. For jokes that I write that I think are a bit esoteric, that require a visual element to be fully enjoyed, would you like to see them? Yeah! Well, good, otherwise he'd be fucking gutted. And we'd be having some quiet time, which would be shit. Right, well, I'll show you some. Obviously, we'll kick off with some thoughts and ideas that I've had recently. Right, so, if you like looking at flowers, but you can't be arsed with gardening, simply run down a kid outside your house. Can't believe you didn't think of it! On Bond Fine Night, I hope our neighbours keep their pets locked up, because there's something about fireworks that makes me really horny. You don't get many homeless gay men, which is a shame, because they'd be fucking bums. I was outside a nightclub recently, and I discovered that women can be bouncers if you're travelling fast enough when you mount the pavement. LAUGHTER The thing I worry about when I hear kids in the third world are working 18 hours a day to make my trainers is, what are they going to get a chance to finish my fucking laptop? I was in a hotel having breakfast, and the waiter said to me, he said, you want white or brown toast? I said, all toast is brown, you're thinking of bread. At any one time, a bowl of nuts on a bar will have 17 different types of urine on them. And that's why they're called peanuts. Wayne Rooney wears the number 10 shirt, or as he calls it, the stick and the circle. All the celebrities get plastic surgery these days. Colleen Rooney's just had some work done on her arsehole. He's had air transplants. My friend reckons football violence and aggressive behaviour are triggered by primitive tribal rivalries, which are projected onto opposing teams and then expressed through exaggerated displays of loyalty. But he's a lying goon atwats who can suck my fucking cock. All that groaning and grunting in women's tennis, it reminds me of sex, in that I'm watching it happen on screen whilst masturbating. To explain spot fixing in cricket, it's what happens when something I don't understand is done by someone I've never heard of. In the middle of something I couldn't give a fuck about. Spiders used to give me nightmares. Anyone else? Yeah. So what I've done is I've stopped eating them just before bedtime. Of course, the worst thing about being bitten by a poisonous spider is that you're probably Australian. Are there any Australians in? Yeah! Welcome back. I don't like zoos. I prefer to see lions, tigers, elephants and bears in their natural environment. The circus! Is anyone here afraid of clowns? You're afraid of clowns, sir. There's actually a special name for people that are afraid of clowns. Mummy's Little Benders. This may interest you, though. Clowns have to register their facial design to make sure that other sex offenders don't use it. Dwarves. Often get overlooked. I can say that to look up to me. Do you want to show yourself to another dwarf joke? Tell you what I know about dwarves. Very little. Come on. Here's a random fact. It's random, but it's true. One in ten British kids is now conceived in an Ikea bed. True. How it works is their parents insert flap-hane to slot B and then screw until the nuts tighten. In 2009, Nadia Suleiman of California gave birth to Octuplets, two daughters and six sons, owning her the nickname Octo-Mum, although she's also known as Gigantosnatch. Those babies were walking before she was. Come on. I think the men in the room will be able to relate to this. My girlfriend always wants to stay in and watch Downton Abbey, but I want to go out and get a new girlfriend. I thought it'd be OK for me to have sex with other women because my girlfriend and I were on a break, but apparently I ruined that weekend at Centre Parks. I was going to tell you a story about the poshest place I have ever been. I got invited last year to Clarence House, where Charles and Camilla live in central London. I got invited. I'm involved in this hospice charity because I'm such a fucking terrific guy. Not because I was pressed ganged into it. No, no, no. Maybe a little. Anyway, I'm involved in this thing. Camilla is the patron of this great charity, so she organised drinks and a concert and dinner in her home to thank the corporate sponsors and to get more people to donate money, raise a bit of money, raise awareness, that sort of thing. In her home, though, she put on this event. So we're all in her front room, literally Charles and Camilla's front room. It's the most ornate, like, highly beautiful sort of ceilings, and they've got a telly in a couch in the corner, like normal people might have, but every square inch of mantelpiece and shelf and sideboard has got a beautiful object on it that they've been given by visiting dignitaries or they've picked up on their extensive travels of the world. It's a very intimidating space to be in. So we're all standing there having a drink and she's coming around saying hello to everyone, and she gets to me, and because I'm a dick, as I feel we've established, she gets to me and goes, so how are you involved? And I went, never mind about that. Have you seen Cash in the Attic? Because we're sitting on a gold mine here. And to her credit, it's absolutely true, she went, yes, winked and fucked off. I did another weird royal thing last year. I did the jubilee. Do anyone see the jubilee? I did a little thing where I had to introduce Grace Jones in a hula hoop. Nice work if you can get it. In order to do that, I had to get past security at Buckingham Palace. Here's what it consisted of. So I met an armed police officer. His only job is to guard our Queen, to make sure that no one steals our Queen and uses her head to photocopy it and make their own money and stamps. So I walked up to this armed police officer outside Buckingham Palace. I said, security, he went, yeah. Here's his question. He said, are you in Al Qaeda? I went, no. As you were. I thought this guy seems fun, so I asked him. I said, does anything funny ever happen when you're rolling with the Queen? He said, yeah, I'll tell you this story. It has to be in confidence, though. I said, you can trust me. He's not a good judge of character. I'm also in Al Qaeda. No, I'm not. Or am I? No. So he told me this story. He said the Queen, a whole entourage, she travels with about 15 people. They went up to Glasgow last year. She was opening a drop-in centre for homeless alcoholics. Of course in Glasgow. Where else would you fucking put it? It's very much ground zero for homeless alcoholics. It's their biggest export. So the Queen's there, and she's cutting through the ribbon like a fucking ninja. And all the usual suspects are there. There's the mayor, there's the local dignitaries, there's the chairman of the charity, the people that work in the local office. And they've got a couple of the homeless guys, the alcoholic homeless guys from Glasgow, that the charities helped in other locations, suited and booted, washed and brushed there to meet the Queen, so that she could see the people that benefited from her kind works. Lovely. So the Queen, as we all know, has only got one bit of shtick, which is the question, what do you do? That's her only question. She doesn't point like that, that'd be mental. But that's her only question, what do you do? That's all she asks. She said to a Scottish alcoholic homeless man, what do you do? And he came back rather epically, I feel, with, same as you, nothing! Apparently she was fucking terrified. A friend of mine quite recently, a couple of months ago, got proper old school flashed. Guy in a Mac at D'Arts Skinner Park, one of those. Sorry, I've added that. I don't know if you did that. You would though, wouldn't you give it a bit of cockslap? You'd probably treat her to the windmill, wouldn't you? Who you? Anyway, she got proper old school flashed and she shouted, rape! I thought, don't give him ideas. Got a workshopper, you fucking lunatic. Has anyone in here been flashed? Go on, what happened, Madam? Is there a funny story or is it distressing? I was in a club and someone flashed you in the club. Are you sure you didn't go off with a man in a club? I was kissing him, I did his zip and then he flashed me. Go on, what happened, tell me the story. Middle of the dance floor and he was throwing some shapes and one of his was... No, my friend told him that we were lesbians. So to get rid of the guy, your friend told him you were lesbians. That's how these two died, but then... They liked it, so they stuck with it. And did that work? She said, we don't like cock. She said, we don't like cock. So sorry, so someone flashed, someone got his cock at in the middle of the dance floor in a club and you went, oh no, sorry, we're lesbians. You could have just told him to fuck off, you're incredibly polite. I'll make up an excuse so he doesn't feel bad. I don't want the flasher to feel rejected. How nice are you? Has anyone else been flashed? You got arrested for flashing. Well, don't take it out on me. What do you mean you got arrested for flashing? I was going for a piss. You were going for a piss? This sounds like bullshit to me. You were going for a piss, where were you going for a piss? Set the scene for us, I've never met anyone that's flashed, go on. It's going for a piss in a primary school. Got in a car park, okay. In a car park outside, you're going for a piss. Court short, late at night, fine, okay. I needed a piss, so I went up against a tree. You went up against a tree? Turned out it wasn't a tree, it was a fat girl. Go on, so you walked up to a tree to take a pee in a car park. This doesn't sound terrible, so far I'm on this guy's side, go on. So there was a woman in the trees. There was a woman in the trees. Sounds like you've broken Dogging Etiquette by pissing on someone. So you went up to take a piss on a tree, and there was a woman in the tree. She was walking as a pathway. She was walking, okay. And it was outside a police station. And it was outside a police station. Kind of a fucking idiot, are you? You went for a piss in the police station car park. Why don't you just turn yourself in? That's a cry for help, if ever I heard one. Lock me up before I hurt someone. And what did she scream? What happened? She went into the police station, and they came out and arrested me for indecent exposure. They came out and arrested you for indecent? Is it because you're a bit ginger? Do you think they would have let you off if you hadn't been quite as... I'm sorry about these lights as well, we could well be giving you skin cancer. I think I'm on your side there, if you're taking a piss, that's not indecent exposure, is it? What do you think? Are we on this guy's side? No! There's one that, no? Stop pissing outside, you crazy fool. But because there was a woman in the other night with a story, she said, oh, I got flashed. And then she told me the story, and I wasn't sure. She said, I said, is anyone been flashed? She went, yeah, I got flashed in Disneyland. I said, I'm all ears. I said, I'm all ears. I said, I'm all ears. I said, I'm all ears. She said, I was in Disneyland, Florida. I was walking in past the hotels in Disneyland and into the park, and I looked up at one of the hotels, and the guy was opening his bedroom curtains, flashed me. I said, no, he didn't. You are a peeping Tom. My girlfriend wants a diamond ring, and the only reason I know that is, it's pretty much all she fucking talks about. Let's face facts, anyone my girlfriend's getting a diamond ring is if the Vajazzla slips. I don't really understand the Vajazzle. I mean, I know what a Vajazzle is. I know what it is. They whip away all the hair from your foo-foo, and then they de-amontate it. I say, they, I imagine you get some Pritzick and glitter, and have a crack yourself. Have a sparkly crack yourself. You're welcome. I just don't know who that's for. I've never met a man who said to me, oh, I love vaginas. I've never met a man who said to me, oh, I love vaginas. I've never met a man who said to me, oh, I love vaginas. I've never met a man who said to me, oh, I love vaginas. I love vaginas. But I wish they were a bit more juggie. A few more sparkles wouldn't go amiss. I want a glamapus, a showbiz entrance. Has anyone had a Vajazzle? She had. What motif did you go for, madam? You had a heart because you were embarrassed to ask for... Like something spectacular. You were embarrassed to ask for something spectacular. You were fine with someone putting glitter on your fanny, but you went... I don't know, asked for anything embarrassing. How adorable. And was it for a special occasion, or was it just... No, I just thought, why not? You thought, why not? What fanny of fucking reasons? Basic hygiene. Your boyfriend could chip a tooth. And it was definitely a prop of a Vajazzle, not a Liverpool Vajazzle, which is just a euphemism for herpes. Is anyone else come across a Vajazzle? He has. He has. Not hers, I hope. What did they have? I can't remember. It was my stag do. You can't remember. It was your stag do. Oh! You can't remember anything. Sounds like a Liverpool Vajazzle to me. No love, I don't know what happened. It just really hit you. Fucking hell. Obviously I could never get a Vajazzle because I don't have a Vajajle, but I would consider glitter balls. You know, for a special occasion. Oh, speaking of special occasions, there was a couple in a couple of weeks ago at one of my gigs, 35 years married. I got a chance to them because I thought, well, quite an incredible thing in this day and age. I got a chance to them. I said, what do you get her for the anniversary? And he said, Deep Fat Friar. I said, well, what did she get you? And he went, chips. And they seemed thrilled with that arrangement. They got me a chance to be able to about, why is the worst gift you've ever got? Birthday, anniversary, Christmas, Valentine's, the worst piece of shit you ever got. We've had a heckle. What was that, sir? A little bit louder? Tickets to this shop. No, that was fine. What's your name? Toby. What's your name? Toby. Toby, do you mind me sharing with the group? Thank you very much indeed, Toby. That makes it much easier because there's a heckle. Quite funny heckle. But we have to do a heckle put down now. God. I would love if I could just let it go, but I can't. There are rules. But you don't mind me sharing with the group, so it makes it much easier we can go old school. What, sorry? Stop stalling. Stop stalling. Don't panic, sir. I've got this. I'll have to put you on arsehole waiting. No. Toby's mum... is so fat. She's a fucking disgrace, Toby. Your mum is such a chunky monkey wobble slob. Fatty boom, batty, blubbernaut. She's so fucking fat when she fell down the stairs, I thought his tenders had finished. Boom, boom, boom, boom, boom, boom, boom, boom, boom, boom, boom. APPLAUSE True story. Ahem. You, sir. What did you say? What was it? Stop stalling? Yeah? What's your name? Gary. Are you trying to say Gary? Watch me. Gary. Yeah. Yeah. Yeah. The fuck is that? Well, Gary, if you want my comeback, you'll have to scrape it off your mum's teeth. Worst gifts. What's the worst gift? What's the ring? You got a bread maker. Your husband bought you a bread maker. What a fucking asshole. I just hate the whole concept. Because bread makers, I spent like 200 quid on a bread maker. That's convenient, isn't it? Because you don't live near shops and bread isn't fucking cheap. Oh, I'll just make my own. That's fine, because the ingredients cost more than a loaf of bread, but don't worry about it. So what did you get him? Instead of an engagement ring, you... You've got a bread maker instead of an engagement ring. You broke up with him, right? You've just divorced him. Yay! Why did you go through with marrying him? I mean, that must have been fucking awkward in the office. Look at this. Oh, that's a nice one. Sparkly. Your poor thing. Any other bad gifts? You got what, ball water? A dog booper scooper? Do you have a dog? At the time, yes. The fuck have you done with your dog, dude? Why haven't you done? You don't have him anymore. Oh, Toby's mum, et him. The fat bitch. Ha, ha, ha! Sorry, dude. Any other bad gifts? What did you get? Nothing. Jesus, listen to the bitterness there. I think there are worse gifts than nothing. It's like women get bought hoovers by their other half. And it's not just a shit gift, it's a bit of a dig. At least something in the house has got some fucking suction. Or you said you wanted a bag and a belt, that's got both. You're welcome. There was a girl in the other day for her 21st birthday from her nana. Now, nana's a mental anyway, but her nana bought her gift-wrapped, beautifully gift-wrapped, an Argos catalogue. With two pound coin cellotape to the front. Ah, pikes. The worst one that I think a lot of people do, secret Santa. Do you do secret Santa at your work? It's a nightmare, isn't it, to get something good for under a fiver, under a tenor? I went out and bought a brawn moustache trimmer. She was livid. No pleasing some people, not like she didn't need it. The best gift is obviously anal sex. Not for a secret Santa thing, that's a fucking disaster. But no, it is. It's better to give than to receive, and anal sex is the gift that keeps on giving, unless it stops giving and in which case it tears. Oh, too much. The worst one I think a lot of people have bought gift vouchers. Who here has bought gift vouchers? What were you thinking? You walked into a shop and went, excuse me, I wonder could you help me? I've got some money here, this is accepted everywhere. Could you fix it for me so it just works in this one shop? For a limited time period, I should explain it to Gifton, I'm a fucking idiot. It's a great feeling when you get a woman, you've been chasing for miles. I've known thousands of women in the biblical sense, and by biblical sense I mean made up women that don't really exist. A lot of people just drift into relationships without really thinking about it, and we call those people men. A lot of men say when they first get together with a woman, they can't initially tell if it's the real thing, but I can because I've got a special little indicator that sticks up. Come on in, sit down, what's your name, madam? Alexa. Alexa, and what is it, some sort of cystitis? What's the matter? What do you do for a living, Alexa? Lots of things. You do lots of things? Yes, I think I've seen a card advertising your services. Are you new in town? Go on, sir. Don't let me guess. No, I'm an aspiring presenter. You're an aspiring presenter? Yeah. Ooh, well I'll say to you, when I say to all aspiring presenters that I meet, I'll have an Americano, please. Oh, I fucking love my job. Gentlemen, do you remember what you were doing the first time you told a woman that you loved her? I do, I was lying. Don't give me that look, it worked, I fucked her. We went out for a drink the other night, me and my girlfriend, and we were chatting about what people actually think about when they're having sex. Not a conversation I would recommend. She said to me, she said, what kind of a man fantasised is about his partner's friends whilst he's actually having sex with his partner, and I said, I promise you won't get mad. What do you think is the most important thing in a relationship? Give us a shout. Sex. Sex? How long have you been together with your woman? Four years. Four years and sex is still the most important thing. Well, you, sir, are a liar. After two years, I would give you. After two years is fine, but sex is the most important thing, you're ripping each other's clothes off, it's fantastic. After two years, what's that coming up on the inside? Coming up pretty fast, Sky Plus. Any other thoughts, most important thing in a relationship? Trust. A lot of ladies saying trust. Any other? Cricut. Cricut. Cricut. Cricut is the most important thing. Are you the guy from Quantum Leap who you just got here from 1970? Cricut is the most important thing in a relationship. Have you ever become engaged by awarding someone a bread maker by any chance? No, not the weirdest answer. The weirdest answer I had recently. I said, what's the most important thing in a relationship? And although it went, consent. There was a guy up in Edinburgh, I said, most important thing in a relationship, and he went, me. A terrified looking woman next to him going, any other thoughts? Lubricant. Well, if you run out. Any other? Watery. A puncture repair kit. Funny, I like that. I think you deserve more. Come on. Any other? Watery? Laugh. Grow up. Who are you in a relationship with? You're my little pony. Any other thoughts, most important thing? Laughter. Well, I don't know about that. I do think a sense of humour is what I'm trying to say. Because if a woman can see the funny side of life, she's much less likely to press charges. I think trust. For me, I think trust is the most important thing in a relationship. Because if you're with a woman, and you don't 100% trust her, how do you know she's not going to tell your wife? I do love it when a woman says those magic words that mean she's definitely up for sex that night. I think trust is the most important thing in a relationship. Because if you're with a woman, you can't tell her that she's not going to tell you those magic words that mean she's definitely up for sex that night. This drink tastes funny. Laughter. I'm joking. You can't taste it. Laughter. I'm not a prude. You'd agree with that, wouldn't you? I'm not prudish. Here's the thing. I don't like swearing during sex. Who wants to hear that kind of language, especially from a child? Laughter. Oh, the look you gave me there. You prefer a sweary kid, fair enough. Laughter. The thing happened to me recently, a little bit embarrassing. I got caught. I didn't think this could happen when you were a grown-up. I got caught masturbating. Buy my girlfriend. Laughter. What do you say? Laughter. Sorry I woke you. Laughter. You've got sleep in your eye. Laughter. I don't know about you, but I don't like celebrities that are only famous because of who their parents are. Like Callum Best and Peaches Geldof and Jesus. Laughter. I heard a reporter on Sky News say at least one person killed in suicide bomb attack. Laughter. Yeah, obviously. Laughter. That is the bare minimum you need to qualify. Laughter. It was something about burning a copy of the Quran in Afghanistan. I was watching it thinking, I would never burn a copy of the Quran because I've got a Kindle. Laughter. Just delete it, don't fuck about. Laughter. I'm not worried about Islamic suicide bombers. They can only do it once. A Hindu suicide bomber, that is more of a threat. Laughter. Because of the reincarnation. Laughter. Oh, I don't know what's going on. I was going to talk to you about terrorist threat levels in this country because our government picked the weirdest words for our terrorist threat levels. You know, sometimes they announce them at the end of the news. The weather, the pollen count, and then the terrorist threat level, for no reason at all. Laughter. And it's words that I don't understand. So at the moment, the terrorist threat level in this country is substantial. I asked a police officer, what am I meant to do with substantial? He said, watch yourself. Laughter. I said, well, I'm not involved. Laughter. Do you know what the highest terrorist threat level is? How's this for a creepy word? Imminent. Laughter. The fuck am I meant to do with imminent? Laughter. I imagine, clench. Laughter. I mean, I've never been near a bomb when it's gone off by imagine. Nah, take the edge off, wouldn't it? Laughter. And we all know that isn't the highest terrorist threat level. The highest terrorist threat level, as we all know, is, I don't care if this does look racist, I'm getting off the bus. Laughter. Laughter. That is a massive rucksack, and he doesn't need to be saying his prayers out loud. I'm fucking doing one. Laughter. Applause. Laughter. Applause. Where middle class guilt is overtaken by fear, you know you're in trouble. Laughter. Laughter. Of course, with these jokes, I can face the wrath of Islam, which I've always thought sounds like a shit pub. Laughter. Where we going? Wrath of Islam. Off for fuck's sake. Laughter. There's no booze, there's no fruit machine, there's no pork scratchings. Laughter. Yeah, but women can get stoned. Laughter. Laughter. Sometimes doing this job, you feel very exposed. Not when I'm doing jokes, but when I'm doing an observational bit of comedy. Laughter. Laughter. You feel like if no one can relate to this, I'm going to feel a fool. So, you need to share with me if you've had a similar experience. It's always embarrassing when you get an erection during a prostate exam. Laughter. And they realise, hang on, you're not a real doctor. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Sorry, do you want to give a shout on your teenage girls? Laughter. Sorry, I realise that is a creepy question. Laughter. Laughter. Laughter. The reason they ask, I read a thing recently that said that 90% of teenage girls are sexually active, bullshit. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Laughter. Yes, obviously she's too young for you if you're having to say peek-a-boo, but yeah You can laugh or an intimate the tough bit comes 20 minutes later when you're trying to laugh or into a taxi home I don't want to make a big deal of this but I recently adopted a newborn African child He was just seven pounds plus postage and packing That's how they get you if only they put holes in that box And that is the joke interestingly that Richard Curtis said was a bit much for the comic relief gig Have you all been on that first foreign holiday abroad like the first foreign holiday you went on without your parents everyone been on that holiday? Has anyone not been on that holiday yet? Oh quite a few of you you've got a lot to look forward to it's an amazing trip It tends to be all the guys go away together all the girls go away together somewhere hot in Europe That's cheap that year. We went away five of us that went all the way through school together We just got a regular results one away for two weeks in falloracky. It was awesome Sun sees sex and Sam. That's what we're looking for. That's what we found It was an amazing life affirming wonderful holiday when in those two weeks. I had sex with 12 different people I'm not bragging. I was gang raped I Still I didn't let it's form a trip If there's a fight I let my fists do the talking please don't hurt me I Went to a fairly posh single-sex school, but I never really fitted in I think it's partly because I'm male Partly because it was 35 when they caught me My granddad always used to insist on standing up whenever a woman entered the room Which is ultimately what led to him losing his disability living allowance? I was up in North London I saw a guy in the high street with a guide dog and a white stick and I went up to him I went you must be blind. He said tell me something. I don't know I Said there's a tree over there Don't be a dick about it You never forget your first especially if they've got an unusual name are Kayla There's something I don't understand about a woman's G spot I can't quite put my finger on it I Can drive a woman Let's hit home there has it touched a nerve so to speak No, very apt. Um, I can drive a woman wild with my tongue. Would you would you like me to demonstrate? Okay, pay attention all the action is happening here young man drive woman wild with your tongue. Have you palm weight? Ain't all sex is overrated it's fucking shit It's like buggery I tried it with my girlfriend she was bored to tears Is Everyone that's gonna get it got it. Let's move along We've been together now for 12 years me and my girlfriend so to keep things fresh in the bedroom We do a little bit of role play She pretends to be a nurse and I pretend I'm still attracted to her That's divided the room isn't it there's people that thought that was funny and then there are unattractive women Some girls like to have the lights off for sex to happen They're like all the lights to be out before they have sex and they've got a name. They're called fuggly muntas I've never had a complaint about that joke. I've never had a woman come up to me after the show gone. Excuse me. I'm a fuggly muntur How do you think I feel? hungry Are there couples in give the show I've got a theory about sex in long-term relationships, so the received wisdom is it's men that instigate sex within a long-term relationship It's the man that says should we go upstairs for a bit of slap and tickle better house your father better sticky belly Whatever you call it in your houses But it's the man that asks I think that is misogynistic bullshit That's like saying the man's got the sex drive and the woman is just passive I reckon it's about 50 50 in most relationships The reason you don't notice when women ask for sex is because when women ask for sex it happens We've got the expression getting lucky because we're rolling the dice ladies If your woman says to you join a cop says and fuck yep It doesn't matter what else is going on you could be full of flu You could have just received devastating news you could have just been shot in the leg by her Yes, I do But sometimes gentlemen you'll know this sometimes in a long-term relationship you'll you'll suggest Becoming amorous with your partner you'll suggest having sex and she'll say no And then she will give you some kind of mercurial strange reason as to why sex could not occur at that moment in time And you would like to respond you'd like to argue back But you can't think of anything because you can't think at all because all the blood is somewhere else So I thought well, why don't we take advantage of the situation we find ourselves in why don't we workshop it? What reasons have you heard gentlemen not to have sex and will come up with a response? What what have you heard? headache Tired, okay. Let's deal with those in order headache easy if almost as well. I've got a headache just say I'm gonna be right at the other end I could not be further away Problem also, I'm gonna fuck you. We're not doing Sudoku. You're not gonna need your wits about me Tired tired is tired is like the modern equivalent of headache And I think genuinely if a woman says you look I can't have said some tired what you've got to do You've got to listen obviously you've got to acknowledge it's not enough just to listen She's got to know that you've heard and then make a suggestion. That's my advice anyway Don't don't demand anything from a woman make a suggestion So so for once a lot of kind of sex I'm tired. I'd say of course you're tired. I hear you you've got the kids You've got the house you've got work. You must be exhausted So why don't you and it's just a suggestion, but why don't you do you normally do and just fucking lie there? You lazy fucking cow Any other excuses for not having pregnant She's too young This is a long-term relationship you're in right I really can't have sex with you. I'm too young Yeah And yet what was that one? Pregnant are you trying to nudge it towards a three-way? It's that bad clearly yes I Don't alarm anyone but we've got a pirate in the house Heist the main sale he's dead She's dead and yet you're still hearing a voice saying no That isn't her that your conscience you monster Don't any other any other excuses for not having sex your cocks too big try fucking a grown-up Any other Sorry, sir, could you just repeat what you said there? She's on the blob How nicely put sir, I think I Think a lesser man might have said menstruation or her time of the month or maybe period even Arsenal are playing at home or she has the red devil in her belly upon bricks But you won't with the much more genteel on the block I Think it all seriousness if woman says what I can't have sex I've got my period I would say well your ass isn't bleeding is it? Yes Give me a moment to work my magic The best one I heard recently someone someone said a very nice gig in Cambridge I said any reasons for not having sex within a long-term relationship that you've heard from a woman and I want one went Morning Fanny She said morning Fanny I went I heard you I don't I don't know what that is It's morning Fanny and she said you know morning breath It's that downstairs I'm telling these rather bawdy jokes, but actually quite a sensitive kind of guy quite metrosexual I remember the first time I got together with my girlfriend 12 years ago now First time we had sex first time we hooked up I cried I don't know whether it was the physical act or the emotion of it or the pepper spray, but I teared up People do weird shit sexually should we should we talk about some of the weird shit people do Gerontophiles if you're not familiar with the term Gerontophiles are people that find the very elderly sexually attractive And a bit of a mouthful isn't it Gerontophiles I prefer to call them OAP dose Like a bit of granny Fanny, where's the harm 50 shades of very very different thing for them Years ago this woman introduced handcuffs into our sexual relationship when she called the police I said I'll come quietly If you strangle yourself during sex it's called auto erotic Exphyxiation if you do it to someone else, it's called a serious sexual assault A fluffy do you know what a fluffy is a Fluffy is when you're having sex with a woman and sorry scratch that when you're having sex with a woman when you're making love to a lady And as you make love to that beautiful lady a fluffy is when she farts on your balls I Thinks couple of quick things firstly really that's happening enough that we needed a special term for that and secondly How do you ask for that? Not that I would want that to happen, but When you find out that's your thing, how do you ask for it tap because presumably no one asked for that the first time it happened That was a happy accident He was working away and one slipped down and he thought that's not an unpleasant sensation But then it's very difficult to ask for that to happen again How do you three difficult to come across as mr. Darcy the king of romance when saying to the woman in your life? Would you mind later on when we make love? fighting on my balls Think much easier take her out for Indian food and hope for the best Has anyone in here ever walked in on people having sex what did you walk in on sir your parents What can what kind of special hug was mommy doing with daddy? What did you actually see when you walked in? What was your dad up to and I mean his balls presumably but Did you did you get an eyeful so obviously not like that that'd be awful You'd have to think that was pre-meditated if you walked in he was all this is gonna be brilliant You saw your parents because I presume you followed the classic etiquette of walking in on people having sex which you walk in I see Your case straight to therapy Does anyone else walk you know people having sex go watch your walking on sir? I don't know why that's bad. I get so much worse Because if it was your son, I think we would all go get go on son Cool my son, but with your daughter you can't walk in a go on love You look like you're fucking loving that There's my little girl I Mean hopefully it was a guy you were proved off was it a guy you approved off He's saying next to you I hope you obeyed the etiquette you walk in you walk out straight away There's certain things that people do sexually though that could not be a response Are we all familiar with the rusty trombone? This is sexual practice whereby a lady is kissing a guy's ass. I don't mean that metaphorically I mean that in a far more literal and rime type sense and as that's going on She's also administering a hand job. So there's this movement and the purse lips when you can see how they got to rusty trombone I've got no problem with the name per se my question is if you walked in on people doing that What would your response be? Are you sure? Got a question for the ladies all women I know have got a very clear line on one side of the line things They're happy confident comfortable and enjoy doing sexually with a loving partner on the other side of the line Things they've been asked to do that. They've said no What I would like to know ladies is what have you been asked to do that you've said no I don't mean like reverse park or wash up What where do you draw the line is really why I'm asking what have you been asked to do that you said no You look confused. Did you not realize you could turn shit down? You're just hearing now that I You draw the line at anal What sorry? Yeah, totally, but but on his birthday. Yeah Man up lady That's what you draw the line. Okay any advance on that any other weird things a Threesome what kind of threesome was it madam was it was it two guys and you or a proper one? I What kind of threesome was it Two two women I think see I think that on the surface that sounds misogynistic doesn't it sound he's gone I need two women to satisfy me because I'm such a man. I don't think that's what it's about I think he was thinking of you He was thinking wouldn't it be lovely if after love making she had someone to talk to Thinking of you And any others any advance on this egging what's a I'm not sure if I miss hearing or you can't talk it's tough Peggy pegging the fuck is pegging Isn't I just running what pegging I Do you mean for playing And she and she wouldn't do that sir what a prude Blumkey I think I'm not mistaken. She just said it's when you give a guy blowjob while he's having a shit I need and sorry madam a guy asked you to do that You know what though I admire that guy Because that's what made this country great That's what made civilization great daring to dream There's an optimistic man. Oh, I'm having a shit. I've had loads of shit. It's pretty boring What about? This whole area is free What point in the relationship did he ask for that the ends? Not a bad way to end a relationship Things aren't going well. You're not getting on. I'll see if she'll suck me off while I'm having a shit Is this if she says yes, I think she loves you And any other any other weirdness the reason I've asked that question a few times now is because it's my favorite bit of the show Because I know that there are women out there who are currently having pressure applying to their legs By the men in their lives There are men out there going I just wanted to fucking try it shut up The weirdest one I heard about recently from an audience member was a Simba have you heard of a Simba? You know their Simba a Simba is from the Lion King I believe So when you're with a beautiful lady, you're making sweet love to her and you finish on her chest fine Little bit disrespectful some might think but fine and you take Simba Bring in a little Disney magic to the bedroom I'm not sure my girlfriend would appreciate a Simba, but I think I think I could just do it on my own I think the next time I Think the next time I'm at home, and I've got broadband and a bit of time to myself. I think I might try and finish there Simba I've got a tip for the ladies or if you like I could put the whole thing in Does a sure one do you want to know the secret to the perfect hand job use your mouth I Left my last girlfriend because she got really fat. I'm pregnant. There's always an excuse I Breath-feeding in public does that annoy anyone else and always me the baby's head gets in the way. I can't see a fucking thing Now no one likes having their parenting technique criticized But would you agree with me that seven is too old to be in a pram would you agree with that? Yeah, would you've said anything? Because I said as much it's a wheelchair is it? Who's got kids give us a shout Who hasn't got kids? We sound happier Which is weird because we're not trying to get anyone to join our gang People with kids never stop going on about it especially when you're my age people with kids join us We're so happy you don't look happy you look tired Who's gonna take care of you? Medical professionals I've got to go now. I've got to have 12 hours sleep Not even tired Of course the pill revolutionized the way that women control their bodies before its invention up or Nana said to take it up the wrong Or face falling down the stairs In a hot bath drunk on gym with the coat hanger chaser My best friend's wife is is having a baby and I asked him I said what you want a boy or a girl They thought about it. He said I wanted a blowjob Really mournful I Like a blowjob off the misses. I don't know if you get this. I don't know if you get a blowjob off my misses, but About oral sex my partner think the thing most men enjoy about oral sex from our partners not anything sexual ladies It's the peace and quiet Ladies if you've ever been going down on a guy and he's gone, oh That's not your technique that's not the sound of his sexual ecstasy. That is the sound of a man not being asked a question I Would think about adoption. I don't have kids, but if I had kids, I think I would have them adopted People criticize Madonna but the kids she adopted fair trade Have we got any dad's in give a shout the dads Did you cry at the birthday of first child oh? Oh very few of you are meeting it a lot of guys are embarrassed by the fact they cried at the birth of their first child I think it's because they don't quite know why they cried There's different theories some people think it's the biological bond with the child that you meet for the first time But that can't be it you're any meaner for the first time. It's not like the mother that's been carrying inside And that's more of a biological thing with the guy. No Some people think men cry at the birth their first child because the gift that's been bestowed on them by the woman in their life That would make them tear up No, I Think the real reason most men cry at the birth of their first child is because they see what the lot she had stoned to the Mrs No, no she's got a vaginas If my grandmother knew how much I spent on her funeral she would be spinning in her ditch When I was a kid I didn't want to imagine my parents having sex I'd watch them from the wardrobe Can closet gay agriphobics ever come out How can you possibly explain the concept of death to a young child well you need a hammer and a hamster He's not going to live on a farm as he's all over the fucking job It always feels so much better when you have a wank with a dead arm, but apparently I ruin that funeral I remember in the playground my dad's harder than your dad It's not really the issue the issue is both our dads have erections in a playground Researchers have created a contraceptive pill that deactivates sperm before it reaches the womb my girlfriend's got something similar called stomach acid Ten percent of women have cried in a shop changing room I guess they weren't expecting to see me there Is an interesting fact the reason Morris dancers wear bells is so blind people know their cunts too They say a problem shared is a problem halved didn't really work with AIDS did it You know you can get AIDS from a toilet seat, but only if you sit down before the last guys got up My girlfriend asked me recently she said what's happened to your sex drive I said I burnt it and smashed it with a hammer I was worried the police were gonna get hold of it Humans and dolphins are the only mammals that have sex for pleasure, but a dog will do it for a biscuit If you suffocate in a bag for life You'd be fucking livid wouldn't you the irony he'd kill you and I've recently read great expectations and it wasn't as good as I thought it was gonna be I can do a brilliant Michael Jackson impersonation would you would you like to see it? I just need a young volunteer that can keep a secret You know those human statues you get in the middle of town, you know the ones painted silver and gold stand stock still and then if you give them like 50 People in your walk pass they move their hand like a fraction Actually works out cheaper if you're gonna go pass them every day just to buy a taser I had a thing happen in the high street the other day You know the charity muggers you know the ones with the clipboard and the optimism in the in the high street I dodged two of the cunts and the third one got me with what I consider to be an unfair tactic the backwards walk and talk So I hadn't stopped I hadn't made eye contact and she told me her sad story She tried it along backwards and the wording was just perfect for me. She said you know how often people die from AIDS I said I'm not an expert, but I'm guessing just the ones I Saw an extraordinary anti-AIDS thing recently I was in Johannesburg last year doing some gigs and I saw in Johannesburg This charity had printed a leaflet with everything you need to know about HIV and AIDS because there's a lot of myths about AIDS in South Africa So it print up this leaflet and because they raised more money than they needed they decided to attach a condom to every leaflet Good idea, so they stapled a condom I Genuinely true the Everest of fuck wittery It's weird that I very South Africans in That's quite a few white there's weird and linguistic differences you notice when you travel like light in this country when you say I'm not racist What you tend to mean is I'm not a racist in South Africa When someone says I am not a racist It means they're about to say something fucking racist Is this racist to Chinese people have guess who I Tried that joke for the first time in a tiny little 50-seater theater above a pub and there was a Chinese lady front and center And she laughed enough that she's all bent forward and it looked like I'd gone no Genuinely weird I like to think I'm I like to think of myself as an equal opportunities offender I like to think I offend everyone and therefore no one because it's kind of a blanket bombing approach to offense It's like I'm not picking on any group and also I'm not really making any points. Am I I'm just trying to make you laugh for a couple of hours That's my only job in this world I'm not trying to make any points or change anyone's mind about anything and the best defense of a joke is always just a joke There's only joking relax. Just trying to make you giggle When you try and say something that's true earnestly from the heart that's when it can fuck up much more Spectacularly in your face. I've got a story about this. Do you want to hear it? PC blowing up in a friend's face. So this mate of mine. It's quite a long story Which is unusual for me, but it's a doozy you'll enjoy it. This mate of mine runs a comedy club Okay, Addy University. He's in his mid 60s now. He's been running it since the early 80s. It's a legendary club Anyway runs this thing. He's quite a right-on kind of guy if there's a petition to sign He's signing it and forwarding the email to me if there's a march to go on He's on the March very right on political involved kind of guy. Anyway, he runs this comedy club This incident happened about 12 years ago He decided to put on a night of American stand-up comedy that happened to be three American stand-ups in London the same weekend Okay, so he decided well instead of just booking one of them I'll book all three of them will make it like a themed evening like the 4th of July will get hot dogs and Budweiser and what have you be fun? So everyone comes to the evening It's like 300 people in the club and he's all excited about it. The first act goes up on stage He's a black American stand-up out of New York City and he does what I would refer to as an uncle Tom routine If you're not familiar with the terminology that means he did a racist routine all his jokes were based on negative racist stereotypes He got away with it. He was a very charismatic performer. He was very handsome, but the material was it's terrible I mean it was like at best it was a white guys drive like this and black guys drive like this nonsense ill-observed nonsense At worst it was stuff that would make your skin crawl. Okay? He totally got away with it that night He got a big round of applause at the end of about half an hour set and he walked back to the green room at the club and My mate went in after him and he went up to him and he said I want a word You'll get paid for tonight's gig. There's no problem with that, but you would not be welcome back at my club telling those kind of jokes I think it's racist. I think it's wrong. I don't think it's okay for you to tell racist jokes Just because you're a black guy. I think if anything you should know better I think it denigrates the struggle of the African-American people and You can never say that no one's told you so because I'm telling you so right now It's racist and it's wrong and the comedian when I Agree When you're right You're right, but I'm the other black comic. I haven't been on yet I Couple of quick things sometimes if I buy a girl a drink after the show she gets the wrong idea She thinks I'm just a nice guy buying her a drink No, no, no Who's going out after this who's going out tonight? Loads of you well, I've got nothing but aberration. I mean well done, but I can't wait to get home to bed I've had a lovely night. I've really enjoyed talking to you, but I want to get to sleep now I've got to an age where I talk about sleep like I used to talk about sex You should have seen me last night I Was at it for eight hours I did down sheets blackout blinds the fucking lot this morning the snooze button did not know what fucking hit it Well, let's break out some rough stuff. It's that time of the evening tell you a couple of jokes that channel 4 told me were not acceptable Okay, it was the week of the tsunami remember the tsunami All I wanted to say was the tsunami was terrible Tokyo was covered in raw fish and seaweed a situation the mayor described as delicious Could have been worse because it said delicious I Didn't because that would have been razy laces I had a similar thing with hurricane Sandy You remember hurricane Sandy that devastated the eastern seaboard of America all I wanted to say was it was the worst thing to hit New York since those two planes Possibly they got it right on that one I tend to get into trouble with the papers for a joke once a year obviously last year I went rogue I Tend to get trouble for a joke with a journalist once a year last year the joke that got me into trouble with the journalist was Was this one you probably remember it from the last show why they called sunshine variety coaches when all the kids on board look the same Now the word variety is doing a lot of the heavy lifting in that joke right It's not that bad the journalist in question said you can't say that about retarded children I Because variety the children's charity they do great work They do a lot of stuff with mentally disadvantaged children But they also do a lot of stuff with physically disadvantaged children and socially disadvantaged children You can't lump all those kids together and go bunch of retarded kids You can't call anyone retarded kids. You're a journalist You should know better and also being offended on behalf of someone else in my mind is literally fuck all that's just you taking the high Moral ground for you to be offended I think minimum you have to be the one that's offended so if you're genuinely offended by that last joke you're retarded While we're talking about charitable stuff as you leave this evening there's going to be a bucket collection There's people with buckets and tins and I'll just briefly tell you what it's about We're collecting money this evening for abused children and if we raise between us just 500 pounds We can buy their silence That's clearly a joke right The reason I say that's clearly a joke is because I did a gig in Croydon a couple of months ago And a woman genuinely came up to me after the show and went where are those collection tins? Just unpicked that for a second so no only did she not realize that that was a joke she wanted to help Anyone totally unafended by anything I've said You're totally unafended by anything what what's your name sir? Hamdy Sun use your name you don't hear that every day. Well, I imagine you do it's your fucking name Have you bought you do handy your student. What are you studying? Economics whereabouts royal Holloway. Well, maybe if you'd worked a little bit harder for your a-levels Just say royal Holloway is not I mean come on there are universities that have always been universities Universities that used to be polytechnics that then became universities and then there's royal Holloway Which I think used to be a 24-hour garage And they fucking went with it God love you Right, let me try an offender All right when I was at school mate of mine got caught wanking in the showers Nothing well it ruined the school trip to Auschwitz I Can't tell you a more offensive joke than that But I can't tell you a story about me that will change your mind about me and then change it right back Do you want to hear it? Well it concerns it's It's basically telling you about what it's like being famous What it's like is people ask you to do things and it's nice to say yes because normally it's fun stuff Do you want to be on top gear? Yes, I do do want to do a jubilee? Yes, I do Do you want to come and visit a hospice? It's palliative care for teenagers. Yes, I do. I got that call about six years ago I said yeah, I'll go I didn't know what some of those words meant I thought sounds all right teenagers I imagine that would be fun now it transpires palliative translates to dying and I found myself in a situation where I went well, I've got to go I've said I'll go and thinking this is gonna be shit And on hard I thought this is gonna be fucking shit But I said I go so ago so I went there with very low expectations I thought I'm gonna I'll be lucky to get through this without tearing up. I went there was genuinely I'm gonna couldn't believe what a fucking asshole I am because it was genuinely inspirational It was brilliant to go if you get a chance to visit a hospice go to a hospice. They're amazing because I don't know what inspires you But I like the idea of car pay DM living in the moment now being where happiness is and if you meet life-limited teenagers They're having that because they're aware of how precious time is and I think we often forget in our day-to-day lives It was amazing to go and to be around I've been back many times since and I'd recommend it as a thing to do It's really fun. They don't want to be shut away They want to be part of society the thing that blew me away when I went there was an incident So if I go out to get coffee before the show if I go to Starbucks, obviously my coffee shop of choice But if I go out to get coffee before the show right if there's a group of 15 year old girls in the coffee shop They'll be really flirted with me not because I'm some super attractive dude But because I'm a celebrity and there's a cash-a to celebrity in our society for better for worse There just is it's a fact so I'm used to that kind of flirting in that context I wasn't expecting it within the context of palliative care for teenagers in a hospice. There's a girl in there She just turned 15 pretty little thing and she's a massive comedy fan And she had all the DVDs seen everything on YouTube like really into it and she was really flirty and really tactile And I thought what all she wanted was a kiss and I thought well, where's the harm? She's gonna be dead before she can testify I can see you think that's bad I can make that worse Which is two words true story It is a true story just happens to be about a different Jimmy Right final thought if only Africa had more mosquito nets then every year we could save millions of mosquitoes from dying needlessly of AIDS You"
}