{
    "url": null,
    "title": "John Pinette  Still Hungry  Full Comedy Special  Live In Chicago",
    "transcript": " You're not suck. You've been so kind. It is a pleasure to be here. Some of you are asking, I wonder how much of this show will be about food. Whoo! Play a bit. If you're here for a WikiLeaks joke, you get the wrong guy. I don't know. You know, I've been actually trying to lose weight because the shows on TV have been scaring me. They have shows where they take big people and they throw them in vans and they put them in caps. Didn't that happen before in history? Have the Nazis come back? We have nutrition Nazis. So, I see you have a little Chicago hot dog on your face. Get in the van! You are a porka! Somebody in Chicago set me up a picture undocked of a Weight Watcher's next to a Cold Stone Creamery. I love that picture because it's everywhere I am in life with the ups and downs of my dieting. I mean, like leaving Cold Stone feeling guilty, well, I guess it's time to go back to Weight Watchers now. Or I'm leaving Weight Watchers going, I can't take it anymore! Weight Watchers is a great organization, but they won't let you to buy more points. I'm going on a cruise! I am now part of a road splinter organization where you can buy and sell points in the secondary market as needed. I'm going to Las Vegas, here is my credit card. But then you try your dieting and you turn on TV and there's all shows about food. They have shows about just one kind of food. They have three shows on about cake. They have a show called The Cake Boss. This man is the boss of cake! You are the boss of cake? I did not know you could arbitrarily make yourself the boss of a food. I am now the boss of ham. I... My name is Boss Hog, please come make it. I don't think you can just make yourself boss. I think there has to be a decision made. I think the commission has to meet. There has to be a sit down. So what is decided? Don't buddy will be in charge of cake from West Hoboken to West Orange. How did it ever come to this? My son Santino, covered in frosting. I don't want his mother to see him like this. Look what they did to my boy. I never wanted this for you Michael. I know Santino would have to make cake and Frater, well he's a cream puff. But I always thought you were going to other pastries. Maybe eating pastries. Who knows, different types of meats and fishes. Now, I watch cake shows once in a while. I think if you're watching, and this is me talking, I think if you're watching cake more than one or two hours a week you have to reevaluate your decisions in life. I do think there's more to do than watch cake. John, what you doing? Watching cake. You watching cake, the last time we came over there. We're all going to come over and talk to you. We've written you all letters and then you can do whatever you want. I had a cake intervention. The thing is that these shows don't change very much. I like dynamic shows. You know, I like watching Lost. I didn't understand it, but I liked it. I like Family Guy, Battlestar Galactica. I have a really eclectic taste. But the cake boss, I haven't seen next week's episode. But I'm pretty sure it's going to be about cake. I'm going to tell you what happens. Somebody's going to walk in and need a cake. You're thinking, how does he know he's a Hollywood insider? I'm thinking it out. After watching several episodes, it's a template. And they'll come in and go, buddy, it's my son's birthday. I don't know what to do. I need a cake. He really likes the movie Shrek. Can you do anything with that? Then they interview Buddy in a very serious sit-down interview. And Buddy screams at the TV. It was the kid's birthday. He really likes Shrek. And I'm thinking, I'll get him a Shrek cake. How does he think of this? It's like CSI cake. Now he tells you how he's going to make this Shrek cake. He'll take two regular five-layer cakes, carve them into like a Shrek, then cover it all in a lovely green fondant. Watch this show. You want to play a drinking game? Whenever he says fondant, take a drink. Fifteen minutes in the show, you will have to call an ambulance. Oh, please don't say fondant again. A fondant was ruined. We get it. He can stop saying fondant. It's like the sheetrock of frosting. You build with it. I understand, though, that bakery that they have in Hoboken is amazing. And there's a two-hour line to get into that bakery. I could not stand in that line. Because people walk up to me and feel that they can say whatever they want. And I don't want to hear it. Standing in a cake line. Excuse me, sir. Are you waiting in line for cake? You have nothing better to do. You're right. With my luck, my cardiologist would drive by while I was waiting in line for cake and beep the horn. Get out of the line! I didn't know they sold cake here. I thought it was a pharmacy. I was going to get my vitamins. My cholesterol medication. And you know what? I ain't waiting in line outside for food. I was in Birmingham, Alabama. And they love the Olive Garden there. Now the Olive Garden is good. The main thing is, though, you can have all the salad you want. Oh, you spoil me. They do use a lot of dressing in the salad, though. I've had lettuce floating and dressing like a dead body. Oh, God, they whacked the salad. It was a hit. And in Birmingham, Alabama, people are waiting outside to get an Olive Garden. They think they're in Italy. They love it there. And the nice hostess goes, you know what, it's going to be about two hours. Is that okay? For lunch at the Olive Garden. Absolutely. I'll be outside. You come and get me. Make sure you look for me. I don't get that at all. My sisters got me a panini maker. I don't like paninis. First of all, my sisters are very, very nice. They got it for me for my birthday. And I tell them, don't buy me anything. Because I don't want anything. I want to give. It's better to give than to receive. And the gifts are stupid. And I can't pretend anymore. I can't look at them and go, oh, a panini maker, how did you know? I was having trouble making sandwiches. And you saved me. You want to make a panini? Get a frying pan. Put the bread on there. Put stuff in bread. Wait five minutes. Turn it over. Wait five minutes. Then punch it with your fist. Here's your panini. Because the panini is so squished, you don't know what's in them. And there could be vegetables in there. I bit into a panini and I tasted arugula. Where did arugula come from? We had no arugula when I was growing up. My mother never said, Sean, I want you to go out in the garden and pick some arugula. I'll be right back, mom. Tomatoes, cucumbers, arugula? No! It's a pretentious, horrifying vegetable. People serve just so they'll look fancy and elegant. It's the emperor's new clothes of vegetables. People don't want to speak up. Spit it out at the table. What are you serving, man? It's arugula. It works with a lot of vegetables. It works with the rest of the salad. Yes, it does. The bitter with the dirt taste makes me grateful for the rest of the salad that I would ordinarily hate. I had a panini with roasted eggplant in it. I know eggplant. I think you know I know eggplant. There's two ways to make it. Parmesan, that a member of the family taught you how to make. We'll leave it alone. I confront people at the supermarket. I don't know, excuse me, I've seen you have that eggplant in your hand. You get like your Aunt Marie's recipe or something? No, I just, I looked up on the internet and there was this little red stuff. Put it down! Get it out of your hand! Go get some arugula. You've done enough, damn it! Martha Stewart makes me laugh. She gives you instructions to make stuff. I'm waiting for her to go one day. Today we're going to build a pyramid. Based on the ancient pyramid at Giza. She says things, doesn't she say like start with the directions where you go, well I ain't making this. Like, okay break out your chest, not roasting pans. Honey! Where's that chest not roasting pans? I'm not much of a cook, I will admit that. You know I eat out and that's, it's very hard to be, you know, eat more calories when you eat out, it's a proven fact. And I didn't even have a toaster. I just bought a toaster reason. I didn't even have a toaster reason. I didn't even have a toaster reason. I didn't even have a toaster. I just bought a toaster recently. Well I had one, but I toasted low carb bread and it exploded. So I go to buy another toaster. I didn't want any trouble. I went to a nice store and talked to this nice young lady. I saw a toaster for $49. I said I'll take this toaster. It was a lovely toaster as toasters go. And she said to me, could I have your name and address? No? You can have $49. And I will take this toaster. And that's really all I planned on today. What do you say? She goes, we really do want you in our system. But I'm not adopting the toaster. Is this like a foster toaster program I didn't see me sign? Once I walk out the door with this toaster, you're never gonna see it again. They want your email, they want your address. Remember when you could buy shit and walk out the door? I remember that. I tell my nieces and nephews that they don't believe me. You know, they used to buy stuff and walk out the door and they didn't ask any questions. Oh, Uncle John, you tell funny stories to make people laugh. No! They used to buy stuff and leave. And that's all that happened. I tell my brothers and sisters, back me up, tell them you used to buy stuff and leave. They go, oh, don't fill their heads with nonsense. So I go to buy my $49 toaster and it's easy for me to say that I have lost my cherub like demeanor. She said to me, would you like to buy the warranty for the toaster? No. It's $49. I think I'm gonna absorb the risk on this one. If this toaster should break, and God forbid that day should come, I'm gonna take another $49 out of my pocket and buy another toaster, because that's how I live. On the edge, baby. I'm not a gambler, but I'm feeling lucky today. I went to Bed Bath & Beyond. Very nice store, but I go without a coupon just to freak them out. They don't understand, because everybody has coupons. A lot of you have them on you. They're this big. You look like Willy Wonka's golden ticket. My sisters have stacks of them. They have a holster for Bed Bath & Beyond coupon. One time I was with my sisters, and they were at the other end of the store, and they saw me at the cash register. They knew I didn't have a coupon. They jumped over people. They trampled them. You have one, get in there. I'm not lying. This lady thinks it's let's make a deal. I'll give $50 for a Bed Bath & Beyond coupon. I'm not going lucky. One time I went to Bed Bath & Beyond, and I didn't have a coupon. People talked about me in line. He doesn't have a coupon. Is he all right? You don't think he's dangerous, do you? One lady felt sorry for me. You don't have a coupon? Do you know how to get home? Is your name in your jacket? They have money. Money is the original coupon. It says in God we trust. Don't you trust God? I must say one thing about Bed Bath & Beyond. I do shop there. They are not fussy about the coupon. They're not looking for expiration dates. It could be from linens and things. They closed. You could write coupon on the back of a Snickers wrapper. They will swipe it. I could write coupon on my ass. And slide. That is a double coupon. I go to Bed Bath & Beyond without a coupon. And the cashier gives me a coupon. And this is how it went. Now life is precious. And we've got to make the most of it. And I don't have time for useless, ridiculous things. And she said, you don't have a coupon? I said no. She said, well, here's one. I don't have a coupon. She said, well, here's one. Thank you. Here. Doesn't make any sense. It's silly, isn't it? Wait a minute. I'll tell you what happened when I bought the TV. I needed a TV. And buying a TV is always such a joyous thing for me. Because when I was a kid, we had five channels on our TV. Two of them didn't work. Yeah, you know people would say, these people piss me off. Don't ever say it in front of me. And I have a cherub like demeanor. But this makes me my eye twitch. We were poor when we were kids. And you know we didn't know it. Really. Because I was poor and I was certain of it. And it really bothered me. After the fourth night of Frank and Beans, I would say, hey, we're poor. And when I get older, I'm talking. So to be able to go in and buy a nice TV, just, you know, I count so many things as blessings and just another wonderful thing in my life. And I had a great attitude. Then they started talking to the salespeople. And they said, okay, you're going to buy this TV. You need a surge protector. Okay, I don't know what a surge is. But I called my brother-in-law. They said I need a surge protector. What do I do? He said, buy a surge protector. You need one that's about $200. If you have high-end electronic equipment, it might save your equipment one day. If there is a surge. I hadn't asked the neighbors about surges. But I bought it. It was one for $200. They go, no, no, no, no, no. You don't want this one. I don't even know why it's out here. Then they brought me over to the $500 one. I didn't say you want the $500 surge protector. I said, break tail. What does a $500 surge protector do? Apparently, there can be a lightning bolt from Mount Olympus that hits my condo. And I'll still be able to watch the cake boss. They said, this surge protector is so good, your condo could blow up, and the TV will still be on. The condo blows up. I don't give a shit about the TV. I have other things in my mind, like funeral arrangements. So I bought the $200 one. Now they don't like me. I bought a $2,000 TV, because I'm not home very much, and I want a nice TV. They said, okay, you bought the $2,000 TV. What about sound? I said, I would like it to have sound. Could I have sound, please? They sold me one of those $2,000 sound systems. And it's very good. My house sounds like a movie theater, but it's driving me insane. Every time the phone rings on the TV, I get up to answer the phone. You know how many times phones ring? Up and down 80 times in three hours. Hold on. This is not watching TV. This is Pilates. Rip it out. Rip it out. Then they said, then they said, okay, would you like to buy the extended warranty? And they try to scare you. They go, you know, you really should get the extended warranty. It's only manufacturer's limited warranty. And it's just for six months, and if that expires, we got to bring our guys in. And we have to bring our guys in for at least a week. Sometimes we have between two and four guys. We might have to send the TV to Japan. Could cost $80,000. You could lose your home. The TV cost $80,000 to fix. I would throw it away and save $78,000. Oh, I told you they didn't like me. And then the guy said, I just really think, this is just, this is just cut like everyone does. It's just signed here. I said, no. What do I need an extended warranty for? He said, well, in case the TV breaks, the TV's gonna break, I'm not buying it. His eyes went dead. Nobody had ever sent that to him before. Nobody ever questions them. We just signed on the dotted line, and it's wrong. It's not up for all of us. I said, the TV's gonna break, I'm not buying it. He said, sir, this is one of the best TVs in the store. Then what do I need an extended warranty for? In case the TV breaks. The TV's gonna break, I'm not buying it. It's not gonna break you son of a bitch. Hold your voice down. What do I need an extended warranty? In case the TV breaks. Just buy a warranty. You got the money I saw you on Last Comic's stand-in. That wasn't me. That was Ralphie May. You're... You can't even keep your big guys right. Now what do I need an extended warranty for? He just said, shut up and sign. I said, get your ass outside. We went outside and we fought. It didn't take very long. It was a tie. My next martial arts days are over. We felt very silly. I took a step back, I said a little prayer to myself. I'm a better person than this. Why am I so mad? And I looked at him and I said, what do I need an extended warranty for? In case the TV breaks. It's gonna break, I'm not buying it. It's not gonna break, I swear to God sir. I've been here seven years. Not when it's broken. Then what do I need an extended warranty for? In case the TV breaks. Are you fat and stupid? That's when I beat the hell out of him. Now I drag him back in the store. And I flip him over. I step on his chest. I said, what do I need an extended warranty for? He said, in case the TV breaks. Let me give you some air. I want you to know, although you may not live through the day, I admire your tenacity. What do I need an extended warranty for? We get a hundred dollar bonus if you buy it. Well then I'll take it. Let me help you out. I wish we had more lights. We could just put one in my ass and put me on a front lawn in a Santa suit. Next special we need fifty more lights or I'm walking. The first show went very well in my producers and director life. We got it. You can play around a little bit, you know. Say some different things. You'll be sorry. I might river dance. Who knows, we didn't clear river dance. Well, fuck you. You know, I don't like to be scripted as a stand-up. I have certain bits, but I like to kind of make it casual. Alright, I'll get back to the special now. I'll get back to the special. I went to a health and fitness place. Last summer, I went to a health and fitness place. Yes, and I had a stress test in blood work. And I go to this doctor there, wonderful lady. But my stress test and my blood work are good. And she's shocked. I mean, at least be a little happy. Don't look like horrified that I don't have anything bad. This is how she told me. I guess she bet the over, I don't know. Is this yo? These are good. Your blood pressure is 112 over 70. We'll have that checked. It must be Celsius. Is there Celsius on there? No, there is not. Can we have a little joy and gratitude? Being healthy. The doctor at this health and fitness place told me one thing. She looked at me very seriously. And, you know, I'm not getting any younger. And I was nervous for a minute. And she said, did you know that you're allergic to wheat? And I looked at her and said, but I'm a wheat farmer. I'm allergic to wheat and I thought, oh, well, I can't harvest wheat anymore. I'm hanging up my sickle. Because don't friends call you in the fall and go, we're harvesting this weekend, you never miss. I can't. I'm allergic. Then I thought, wait a second, you make flour out of wheat. Perhaps I should inquire further. I said, what does this whole wheat thing mean to me, pray tell? She said, well, do you eat a lot of gluten? I don't know what gluten is, but I would say yes. I'm fairly certain I'm mostly gluten. And she said, well, you should avoid anything with gluten in it. I said, OK, thank you. And started to leave the room and I said, what has gluten in it? You know what has gluten in it? Everything! Every reason to wake up in the morning. I'm looking at this thing of things to avoid and I said, check again, maybe it's just cancer. How am I going to live? She told me to go try gluten free products. Now, I went to a health food store, which was a new experience for me, and now I like shopping at health food stores. And if you want to know where the gluten free stuff is, look for a gentleman with a gun in his mouth. Because bullets are gluten free. Have you tried gluten free food? It needs gluten. I don't know what gluten is, but apparently it's delicious. And you need to put that back in there. I tried the gluten free pasta. And at this point I'm thinking, I hope to make a gluten substitute, like a sweetened gluten, or I can't believe it's not gluten. Now, I think we have people here that know pasta. Pasta, you boil. You are my people. Pasta, you boil boiling water, 10 minutes or less, little olive oil, little salt. Gluten free pasta, 90 minutes. Enjoy. Appendons. And I tried the gluten free bread, and it made me long for low carb bread. I tried to toast it. It broke the toaster. Should have bought the warranty. And it caused a surge. So I shop now at these health food stores on the road, and there's some healthy things that I like. Some people there have boundary issues. They walk up to me and one lady said to me, do you like your beef cruelty free? Oh yeah. I would have it no other way. Take that cow to Disney World. Put them on the rides, get them Mickey ears, couple of pictures, then whack them on the way to the airport. Didn't you like taking your picture with Mickey? Put it right in your hoof to pitch you. You like to pitch you. Alright, don't turn around now. Vegetarians, I completely understand. You have health issues with it. You have ethical issues. Completely understand. A vegetarian said to me, but I'm a vegan. Oh, what is that? What is that? We don't eat meat or dairy. What do you do? I'll tell you what you do. They lose their minds. They go to the store and they buy 50 pound bags of almonds. And they make it into stuff they wish they could eat. They don't have a stove. They have a Play-Doh fun factory. What you making there? It's a pork roast. No, it's not. It's almonds. It's almonds. It's almonds. It's almonds. It's almonds. It's almonds. Mush together. Have a cheeseburger. You're losing your mind. I went to a health food store and it is not lost on me that people on a limited income cannot eat healthy. And I hope we work to change that in the future. I've been... Well, listen. It's true. I try to eat berries a lot because I really like them and they are part of the super food group. I picked up berries that were $15. And I went, wow. I want to taste what a $15 strawberry is. These better be great strawberries. I better not see any marks or anything. They better be ripe. There should be Belgian diamond merchants in the back looking at these strawberries. What do you think of the strawberries, Adi? This is a good strawberry. I'm not saying it's a $15 strawberry. But it's a good strawberry. A lady in the vitamin section, a beautiful lady walks up to me and said, do you clean your colon? And I'm thinking she's hitting on me. What do you have in mind, baby? I said, no, I have a colon cleaning lady. She comes in twice a week. She's been with us for years. She's like family. We can't let Doris go. Someone asked me if I tried yoga while living in LA. Have you tried yoga? You know, they have gentle yoga. I tried gentle yoga. You walk in, they go, take your head and stick it in your ass. I don't want to put my head in my ass. It's dark and scary in there. And there's so much gluten in there. What if I have an allergic reaction and it gets stuck? Try to find your EpiPen with your head in your ass. They go, if you can't put your head between your legs, just do what you can. Well, I took a nap because they gave me a nap. I tried to do this on the road, though, these healthy things. I was in Des Moines, Iowa. I'm usually in places between two and six days. I'm in Des Moines, Iowa. Nice people. I enjoy the performances. But there's not a lot to do during the day. I always make the most of it on the road. But the third day, the owner of the club says to me, matter of factly, you know, there's a rib festival in town. About a thousand rib boots at the fairground. Would you be interested in something like that? Get in the car! So we go to the Iowa State Fairground, and it's filled with ribs. Now, I had my monogram rib bib that I carry with me on the road. Well, thank God I packed it. You should see me in my monogram rib bib. I'm adorable. It looks like a Bob's big boy, come to life. I have my bottle of cholesterol medication for the dry rub. And I'm happy. There was a long line, but I didn't think that, you know, my brain would start because all you could get, or a half a rack of ribs, or a whole rack, it's going to move. No! People watch the Rib Boss or a rib show. Now everybody's an expert. They're asking questions to the rib guy. What kind of wood do you use in your smoker? Get out of the line. Is this a vinegar-based barbecue sauce? Get out of the line. Is your cayenne pepper in this dry rub? Ah-ha-ha-ha. Get out of the line. Then I was almost going to get ribs. I had a couple in front of me, and then it was me. I was home free. I was going to get my ribs and have fun and be at a festival. But the couple in front of me, they were chatty. They wanted friends more than they wanted ribs. They were very nice. They couldn't yell. You know, I had to internalize it. Get out of the line, get out of the line, get out of the line. See, they were talking about the fact that they were from Nebraska, and they had driven there and they're brand new Winnebago. Well, it's not brand new, 9,000 miles, but it might as well be brand new. They bought it from the neighbor across the street. His wife had a stroke, and they couldn't travel as much as they had wanted to. Now, Evelyn and George had lived with them for over 23 years. Their kids grew up together. They went to the same grammar school. They both sent to the Catholic school. Not that the schools in the area aren't wonderful. They are. And then they went on to the Catholic high school. They had a very good football team, and our sons played together. Now, when Mary had the stroke, we were at the hospital every day, and I think they would have done the same thing. Get out of the line! I don't remember what happened after that. I guess I got ribs. I woke up in the woods. There were bones everywhere. I hope I didn't stalk and kill a deer. That would be awful. Last year, I went on a tour of Canada, and it was amazing. I love Canada. I will work there forever. It is a lot of traveling, and it is becoming harder and harder to fly now. First of all, the restrictions are draconian at this point. They won't even check you in! I'm going to Las Vegas. They just stare. They punch into the computer, and then they say, Go check in over there. There's a machine. Check yourself in. I'm going to Las Vegas. Yeah, well, check in over there. We don't check people in. You check yourself in. Do you have your confirmation number? Do you have your confirmation number? I gave you money, and you said you would fly me to Las Vegas. We had a deal. Well, you have to, sir, it will tell you how to check yourself in. But I don't work here. Do I have to de-ice the plane too? How much help do you need? Let me load the luggage for you. I had a bag that was a pound over. It was 51 pounds. I thought they were going to call the police. Take a pound out of the bag! Take a pound out of the bag! What do you want me to cut a pair of underwear in half? Here's a sock. Leave me alone! Now, they give you the full body scan some places. And I don't need that. I believe you can do it psychologically. I believe if someone has something in their ass, you can just ask them, and they won't be able to lie. You don't know if they're lying, because you ask them out of the blue. So, going to Las Vegas today, I love Vegas. God, where did I stay the last time? What shows did we see? Is there something in your ass? A sock. They wouldn't let me pack it. I'm going to Las Vegas. So, last year I flew all over Canada. Actually, we drove a lot of it too, which I enjoyed. We drove to Prince Edward Island. If you want to know where Prince Edward Island is, it's at the end. Drive until you're done, and you'll see a bridge. Go over the bridge, and they're right there. And we had a thousand people on Sunday and Monday. And it was so touching. I'm thinking, this is like everybody. And they couldn't have been nicer people. It's not a big town. There's like 12 stores on the main drag. It's a beautiful place to go. If you want to get away and quiet, it's a beach community. And there were 10 Anne of Green Gables gift shops. Anne of Green Gables is early 1900s. It's a book young ladies would read. I guess it's a nice thing. You read it growing up. But 10 Anne of Green Gables gift shops. And half of them are Anne of Green Gables gift shops. And half of them are candy stores. You know, because you can't make money just off of Anne of Green Gables. The franchise isn't as big as it used to be. So they have these older ladies dressed from the early 1900s in jumpers like 12 year old girls. And they're all walking towards you with candy samples. And it gets creepy. It's kind of like the thriller video, you know? But I highly recommend it as a place to go and meet nice people. I was in Ottawa and they asked me if I skated. I said, oh yes. I am a skater. I competed in my younger days. I was short and sassy before Dorothy Hammer. People skate there. They skate all day. They skate so long they have snack stands on the ice. And on these snack stands, they sell these things called beaver tails. And they're giant fried dough. And they cover it in hot fudge and M&Ms. And I wanted one. They make you skate to it. And I'm standing at the edge of the ice like the kid from UP. Thank you. I waited three days and they said, no you have to skate, it's tradition. I waited three days. Three days, and I couldn't take it anymore. So I put skates on. And they pushed me. And I skated. I was… And I didn't do one block around or one surround. I went right to the fried dough stand. I didn't want to mess around. And I was going to make it to the fried dough. There was a family in the way. My mom and dad and two little kids. They shouldn't have been in the way of the fried dough. They turned around and they saw me. You know what I saw in their eyes? They saw hope. You know, like, oh, he'll stop. I couldn't and I didn't. And they went down like a set of bowling pins. But I bought them all fried dough while the paramedics looked them over. So it worked out pretty good. Ice skating is now on my list of things in life I never care if I do again. It's like an anti-bucket list. It rhymes with bucket. I can tell you that much. I can't. Hiking. If I'm not ice skating, I'm hiking. What do I think of hiking? I hate it. I hate it. You hike down a mountain. You hike down a ravine. Horrible stories start with, well, we were hiking. And you ended up in North Korea, didn't you? Why were you hiking? Because people do this in LA all the time. Oh, we're sick of the city. We're hiking. Do you know how to hike? Well, no, but we have new boots. I'm tired of anybody that gets new boots in a compass thinking they're a hiker. Happens every year, doesn't it? Two people go out new boots compass. And they get lost. Then they have to send a hundred people out to find them. Then 10 of those poor bastards get lost. They've got to send a thousand poor bastards out to get there. Pretty soon, 10,000 people are looking for two assholes with new boots in a compass. Right now my director's going, okay, well, we can beat that. That's okay. Even the food that's for hiking. Oh, they have those power. It's not like protein bars. Protein bars? They're not good. And I'm chewing on them and my brain is going, why are you eating this? They have to make it honest. They have to call it like an eat this or die bar. I went hiking once. I would have killed for a roasted eggplant panini. I would have. Oh, I got one of my crazy friends to health nut. She goes, I made my own trail mix. Trail mix. It has trail in the name. It tastes like trail. I had this. I was sure I'd been into a twig. I'll tell you what they do. They put M&Ms in there to fool you. So you're about to spit it out. You go, oh, twig. Oh, no, M&M. No, twig. No, M&M. No, that's a twig. M&M. I make my own trail mix now. It's a one pound bag of M&Ms. And everybody wants to try mine. I went on a little vacation of St. Martin. It's a beautiful island. It's half French, half Dutch, magnificent beaches. A running theme in my life is the airlines losing my luggage. Well, they managed to do it once again. Now they're on a lot of big and talls in St. Martin. So I bought an extra large shirt at the gift shop. That worked out okay. It went up to about here. And it was so hot, I had jeans on. And I couldn't take it anymore after the second day. I cut my jeans off and I cut them too short. Sorry, I have to be in the front row for this, friends. Now I look like a hooker. And I'm not talking about a high end escort. I mean a hoe. Like an HBO documentary. He walks the streets of St. Martin. There was a group of Japanese tourists that saw me. I always fascinated Japanese tourists. They saw me to get out the cameras right away. Look, look, look, look, look, look. How come you're dressed like a hooker? Do you know you can see your berry? You can see his berry? You can see his berry? Here's $20. Let me rub your berry. Thank you. I rub his berry. Now, they had this fun little water thing. I had long put on my name, Nailist, you know, water skiing and parasailing. But they had this thing called a banana boat. It's a giant inflatable banana. It's fun, but it's unstable. Like most of the people in my life. And it's pulled by a motorboat. Two bananas going out at once. Very popular ride. So I look like a hooker. No use being on land. Now I go in the giant banana. Now I'm on a French beach. And they're going crazy. They think it's kind of a Cirque du Soleil thing. And I don't blame them. It's a big guy dressed like a hooker on a giant banana. Me down's in the chair. Cirque du Soleil. I get on the banana. And I was having fun. But the boat. The boat took a hard left. And I flew off the banana. Into the other banana. And I look over. And it's that poor family from Ottawa. And now they're mad. They don't even have fried dough here. Why are you being so mean? Two summers ago. I had the pleasure of performing at the Edinburgh Festival in Scotland. And I thought what a huge blessing this is. To work in Scotland. I started stand up 25 years ago. In Boston, Massachusetts. It has been a wonderful journey. It really has. And I thought Scotland. Just another blessing that this occupation has given me. But everything great in my life has a catch to it. My manager has been my manager for 20 years. He's my best friend. He's one of the smartest people I know. But not this time. He forgot to read the contract. I'm going to work 26 out of 27 nights in Scotland. That's too many for me. Remember, I'm used to being in places between two and six days. After the third week in Scotland. My brain is screaming at me. Why did you move to Scotland? 26 out of 27 nights. And it rained every day. It was the worst rain since the time of William Wallace. Known as Braveheart. Every man dies. But no, every man has an umbrella. The Scottish dialect. I think I have a pretty good ear for dialects. It's very thick when they've been drinking. Which is quite a bit. We didn't want to go now. Add it to Broadway. You got it pal. But every day, think about it. Every day for a month. Every day for a month. Every day for a month. Every day for a month. Every day for a month. Every day for a month. Every day for a month. I would wake up. It would be raining. And I would be in Scotland. It's like the movie Groundhog's Day. I'm calling up old girlfriends. Apologizing. Take the curse off of me. Now, that being said, if you're going just for the Edinburgh Festival, go. Just don't go 26 out of 27 nights. You're going to have a fruit on bed. You know what a fruit on bed is? It's a little more comfortable than a yoga mat. That's all it is. There ain't much to it. Some of you have fruit on beds. And I actually like fruit on beds because they're honest. They have FU right in the name. So, some of you have a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little bit of a little little bit of a little bit of a little bit of a little另外 a little bit of a little bit of a little bit of an additional level there for you. And we're going to come you and go. We're coming to visit. We're going to be taste of Chicago. We're going to come to visit. Sure, you can sleep on the food time. You know, if you have a food time for your guest, they won't be staying long. And they made you walk. They didn't pick you up. It wasn't in the contract. And I said, well, where is the venue? They said, well, you can see it from here. Then you can walk it from here. It wasn't a walk. It was more of a hike. And you know how much I love those. I don't look it. I used to be a comedian. Master says I must tell the jokes. I walked in to a sandwich shop. And it's not like our sandwich shops here. They're cheap with the toppings. You know how they load stuff up in a sub shop here? Now, can I have tomato? I'll pay extra. They think, oh, he's a big guy. He can't jump over the counter. Well, they're wrong. I'll be over that counter before they can look up. They're like, here I am. Put tomato on there. Black olives on a sandwich. How much are black olives? You have to pretend to sprinkle them like fairy dust. Open your hand, Harry Potter. They gave me a fried Snickers bar. How was that? Oh, it was peaceful. And I walked towards a bright light. After the third day of eating in pubs, I was going, can I just get an arugula salad? There was a Chinese buffet in Scotland. Now, listen, I don't go to buffets much anymore for health reasons and restraining orders. But I feel I was singled out a number of times, but I'm not going to fight it. I know when I'm wrong. And I started comedy in Massachusetts. And I put a few guys out of business, well, me and a few friends. One Chinese buffet owner from where I started comedy moved to Edinburgh. With a lot of bad memories, and he rebuilt his life and his business. And then I walk into his buffet 20 years later. Father, the forbidden one has returned. You think we forget about you, son of a bitch? We still have your pitch, you go now again. And I squeeze that in. See, I grew up in a predominantly Irish and Italian community. And my father was a bartender at the Irish American. And that's why I first learned to like dialects, because he had friends from Ireland. And I get to listen to them, and they tell me all wonderful stories about growing up in Ireland. It was quite fascinating. But you know what? Honesty is part of their culture. And they said, you're a good boy, but you're a fascist kid. I don't want to frighten you. But if you're too far, you just won't be able to count on me. You just won't be able to carry it to heaven. Actually, my dad's friend from Ireland gave me the best diet advice I ever had. I'm going to give you a diet. It's going to work for you your whole life. And it is, you know, because I've been up and I've been down, and I feel pretty good now. And he said, it's the only thing that's ever worked. Write it down. It's a good diet. Stop your eating. If you see it, and it looks all sweet and tasty, well then keep walking, because you're a fascist boy. That would make a good nutrissystem commercial. I'm Tommy Sullivan for nutrissystem. Send in $49.95. We'll send you a big box on nothing. Now go out and take a walk. The National Dish of Scotland is called haggis. I don't like to eat anything that rhymes with gaggis. Haggis is sheep intestines with oats and spices. Mmm. They ask you every day, one of the many things I loved about Scottish people are that they're fiercely proud and patriotic. And they ask you every day, have you had haggis yet? Oh, haggis is beautiful. Go get yourself a proper haggis. I waited. I waited for three weeks. I waited until my manager came. The gentleman that booked me 26 out of 27 nights, I said, where should we eat? I said, we're having haggis. Sit down. Now haggis comes with a whiskey gravy, that helped. It didn't have whiskey in it like... Is there whiskey in here? It had whiskey in it like, did I call you last night? I am not drunk. I am having haggis."
}