{
    "url": null,
    "title": "Principal's Office  Bret Ernst",
    "transcript": " What the hell are you doing in my office? You're a white kid. I don't get white kids in here. You've been here half the year and you've been in more trouble than most kids get in their lifetime. My understanding is you've been at 11 schools in seven years and your behavior has not changed which is troubling. You mooned the cafeteria like anybody wants to see that. Stold a candy money from the fundraiser and bought McDonald's for you and your friends? Stold a teacher's grade book and changed all the grades. You gave yourself two C minuses and a D plus. I don't get that. Climbed an eight story building and took a doo-doo off the building. That's nasty. Hey! Do you think this is funny? You've been in countless fights, handed out spreadsheets and started a gambling pool. Goodness. It's just like Godfather 2. Son, what do you want to be when you grow up? Superhero. Super... Let's be realistic. I want to play for Dallas. Probably have a better chance of being a superhero. I want to give you one week in-house suspension. No recess. Damn. Hey! You watch your mouth. I'm going to call your mom, have her come up here and whoop you. Now, while you're in there, I want you to think about what you've done and what you want to be when you grow up because this behavior, you're not going to be able to do anything. You're dismissed. I know what I can be. Ladies and gentlemen, Brett Ernst! Thank you guys for coming out. I know the big games tomorrow. I went to Super Bowl Cares. I got no money on it. I don't give a fuck. I'm a former degenerate. I still gamble, but whatever. My wife knows I bet, but she doesn't know. That's why I hate watching football with her because I'll be yelling at the TV. She's like, it's just a game. No the fuck it's not. We got rent riding on this motherfucker. That's why I married her. She's a good kid. She is. She's got a normal family, which that really threw me off because I grew up in dysfunction. If you grow up in dysfunction, it throws you off when you meet normal people. I don't know if that's ever happened to anybody. You don't know how fucked up your life is until you meet... Like a fish doesn't know it's wet. You like that? I read that on a magnet. Nah, it was weird, man. The first time I met a family, it threw me off like she had a dad. I'm like, this guy's been with you your whole life? All of you had the same last name. Same dude from beginning to end. No step. No, get the fuck out. Are you serious? I've poking him and shit. Nobody I knew growing up had dads. Everybody's single mom. There was one kid who had a dad. We heard about him, but nobody ever really met the kid. And why is that? It's always the dad that's fucking the family up. It's very rare. It's a mom. I don't mean to pick on fathers. I'm just saying. You're the one handing out the issues. It's usually the dad. You never hear of a mom having a whole other family nobody knows about. You know what I'm saying? There's no mom setting up apartments for their side dick. Yeah. It's always the dad. Yeah, my real father, man, he was, he was, well, he had schizophrenia. You know what that is? When you hear voices and shit and then he ended up killing himself when I was like 10. Or, oh, by the way, before I go any further, I just want to let you people know I like to talk about shit that's uncomfortable and personal to me. If I touch on something personal to you, just, you know, go home and cry about it. Seriously, I don't want to talk to your bitch ass out front. I'm just saying, if you're an adult and you're not emotionally stable to be in a room with other adults, listening to another adult talk about adult shit, then, you know, go home and kill yourself like my father did. No, you'd be, listen, you'd be surprised. All right. It's a very rough time to be a comedian. Everybody's feelings are coming into comedy clubs. Like, you know, I'm saying that I got people upset with me. I got a mental health group that's upset with me because they think I'm making fun of schizophrenia. You know, say I'm going to ruin your career. What career? What the fuck are you going to ruin? You can't get blood from a stone. I read that on a magnet too. Now, here's the thing. I'm not making fun of schizophrenia. I don't think it's funny. It's not a funny, you know, illness or whatever to grow up around. And those, you know, but the shit they do. Well, they hear voices, you know what I mean? Like my dad would fucking, he thought trees would talk to him and like little animals and shit. Squirrels, he had something against squirrels. I don't know, I'm dead serious. Like whenever he saw squirrels, it was on. Because he would start arguing with the squirrels. And in his defense, I don't know, something might have been going on. Because the squirrels were in it. Like they didn't run or nothing. Even as a kid, I remember going to my mom, I'm like, my, you think it's a good idea to let them talk to the squirrels? Because they're pissing them off and we don't know what the fuck to tell them. I don't want to get shot in my sleep because the squirrels are like, kill the farm, you know what I mean? Get rid of everybody. You'll be happier. I think it was drugs though. We had some drug abuse in my family. Which, you know, again, I find humor in that shit too. Maybe I'm not wide right. I don't know if you've ever had a family member go through like a 12 step program, but there's like a step where they apologize to you for shit that you didn't know they did. I'm like, that's where my Easter money went. But you helped me look for it. Well, no, that's why, you know, I don't, look, and by the way, I don't count weed as a drug or mushrooms, but everything else, you know, because that hardcore shit, you ever meet those asshole people that are always like, you know, anything in moderation? You ever meet that dick that's never seen a fucking thing in their life? You can't do heroin in moderation. All right? But we do know, it gives a fuck about pot. We don't know what to do. But we do know, it gives a fuck about pot. I think it should be legal. My dad smoked a shitload of weed, that I remember, because I used to have to pick the seeds out for him as a kid. By the way, if you're under 30, you don't know this, but pot used to have seeds in it back in the day, all right? Fucking kids are spoiled. You'd be like, get over here, you got little fingers, right? Now you had to pick the seeds out and... And here's the thing, if you didn't get all the seeds out, if they were smoking it, that shit would pop, right? So you'd be like... He's like, get over here, I give you one job. Like I'm six, you wacky motherfucker. Why don't you have the goddamn squirrels take the seeds out for you? But I never smoked pot, I never tried it, man. I'm for it, 200%, but I don't... I'm not gonna try it. First of all, you know, because I'm... I don't trust myself with anything. I'll be honest, if I smoke weed, next thing, then I'm like, everybody on the fucking floor, you know what I mean? Like, I'm zero to 100 real quick, real quick. And I know I'm fucked up, man. I was getting in trouble, you know, without doing that shit. I was always in trouble as a kid, man. I was a horrible kid and a bad early adult. My true calling in life is stealing. I don't do it anymore, but I'm good, man. I do, I know, I scan, that's how my mind works. I see everything in angles. Like, me and my wife went to the 99 cent store, right? My first thought is I'd have to steal over 500 items in order to be charged with Grand Larsen. You know what I mean? Who the fuck, what's wrong with... But as a kid, I used to rob... Me and my little brother used to rob everything together, you know? Well, we used to help my mom out, because we grew up pretty broke. Not just comic broke, but like... Like free lunch program. That's how you know you're broke, by the way, when you're on the free food programs at the fucking shitty public schools. Well, you had three lunch programs. You had the paid lunch, right, for the kids who had cash. Then you had reduced lunch, I guess for the kids who kind of had cash. And then you had free lunch, right? And you had a standing line like a dick with this little raffle ticket and... Even the reduced kids are staring at you like... Like, dude, lunch is 50 cents. How broke is your fucking family, man? Oh, you know you're really broke if you were on free breakfast. That's stuff to ask. You had to be at the bus stop at like 3.30 in the morning. It's cold and dark. It's like me and my little brother and the fucking squirrels. Nah, but we would... I'm not sugarcoating this, alright? Because people do shit like that. I'm just being honest. We would steal... But we would do things to help my mom out, you understand? Because she was always struggling and shit. So as a son, you want to provide, you know? Like, I turned into like a little Liam Neilsen. I went to my mom, I said, I have a special skill set I've developed. Certain amount of time. So basically, yeah, we... Me and my brother were always scamming. Like, we dressed up as Boy Scouts and collected money for like a month. That was fucking strong. That was my idea, by the way, I came up with... Well, that's how my mind works. I saw these Boy Scouts collecting for the Boy Scouts and people were just throwing them cash, right? So my first thought is, how the fuck they know they're Boy Scouts? Like, you don't know. No, you're assuming, but you don't really know. You never check a Boy Scouts credentials, you know what I mean? You never give him a rope and be like, hey, make me a Windsor Knot, you know what I mean? You're just assuming because he has the outfit on, so... Me and my brother got outfits and we went door to door. We were killing it. But how we got caught was, is my mom got off of work early, right? And she went to the grocery store and me and my little brother had set up a table in front of the grocery store. Right? I'm so sorry. I'm sorry. I'm so sorry, bro. I'm serious, we had a bucket. People just throwing us cash. I'm like, thank you, thank you. Turn around, there's my mom. I'm like, oh fuck. You know what I'm saying? Like, what the hell are you kids doing? I'm like, trying to pay the phone bill, Carol. Just trying to help out. Here, here's the money. Go get some groceries. Don't worry about it. Do Carol beat the fuck out of me and my little brother? She kept the money though. I'll tell you that. I was so goddamn awful. Like I robbed the book fair. You remember the book fair in fifth grade? Remember that scholastic book fair cart? Yeah, I took that bitch down. I did, I paper jammed the door so they thought it was locked, right? Then I came back later, kicked the door open and housed everything. And the whole school knew it was me. Well, I told everybody. You know what I mean? I had to move product. I did. I had like this black market book fair business, just going up to kids like, hey, how you doing? Listen, I got you Amelia Bedelia if you're interested. I got the whole Super Fudge series, Judy Bloom, Goosebumps, whatever the fuck. I got the whole Super Fudge series, Goosebumps, whatever the fuck. Dude, I got in so much trouble. Well, here's the thing, if you're a single mom and you have a kid and this is for people watching at home, I'm gonna tell you, especially your son, I'm gonna tell you how to handle a son. I don't know about daughters, because I'm not a daughter. Well, let's be honest, women, when you're acting up, you don't do the shit little boys do. You know what I mean? You're not robbing things. When girls act up, the worst thing you do is, I don't know, sneak out at night and blow your boyfriend or something. You're like fucking the whole neighborhood. That's how you act out, you know what I mean? But that's why young dudes are always in jail. So I'm gonna tell you what to do. Now, because you can hit your kid, you can hit him, but it ain't gonna do anything. And I'm not saying don't hit him, beat the fuck out of him, but that's more for you, so you feel better. It's not gonna deter him anyway. Here's what you do, moms. It's very simple, and you know this already. Just cry. Seriously, because it fucks us up if you make as a dude, there's this little bitch-ass gene that kicks in, you're like, how did I make my mom cry? You know, because we can't filter it. Here's the thing. I went to 15 different schools growing up, one high school, okay? I was always moving. And that's also how I know you're broke when you're always moving and shit, like in the middle of the night. You ever have to break a lease as a family? Like, why are we leaving the furniture? Let's go now. So this happened in the state of Florida. Now, what happened was, in fifth grade I got really sick, okay, I had pneumonia. And then when I came back, I got suspended, I robbed the book fair, okay? Same story, not a call back. This is just, I got a call back, I got a call back, I got a call back, I got a call back, not a call back, this is just, and then when I came back from suspension, me and my little brother were at the bus stop, right? And it just dawned on me that if we don't go to school, nobody's gonna fucking know. So we cut school for like three weeks straight, all right, and I would have gotten away with it, but what happened was, my class thought I got sick again, okay? And they made me get well cards with like macaroni shells and shit, remember that? And they dropped them off at the house, you know? And my mom's like, what do you mean, Brett's been in school? I'm like, fuck, right? The whole class dry snitched on me. So my mom beat the fuck out of me, all right? And she used the phone book, by the way, I'll tell you why, she was dating a cop at that time who later became my stepfather, that's a whole other fucking story. But I'm convinced that he told her, like that's how you could beat people without leaving marks, because the phone book just came out of fucking left field. And then she grounded me, right? But in my mind, after I'm done, I'm like, what am I gonna get into next? I didn't give a fuck. Oh, and I also had to sign in with the truan officer every day. He was like a cop for kids or whatever. So now I'm in my classroom, right? This is fifth grade, and while I'm sitting there, I'm doing my work, a fucking cop comes to the door, and he says, we need to see Brett Ernest, right? And all the kids are like, ooh. Because you know if the cops come for you in fifth grade, you know, you're a badass. You know, I played it up like, pfft, wonder what I did now. But in reality, I'm like, what the fuck did I do, right? So the cops taking me to the principal's office, like he's trying to tell me where to go. I'm like, dude, I fucking live there. I'm like, norm of the principal's office. I have my own chair and shit, right? So as soon as I walk into the principal's office, I see a cop, another cop, my little brother, the principal, some dude in a suit, and my mom, right? And they're arresting my mother. Now, in the state of Florida, because I missed so much school, it was a form of child neglect, right? So the state stepped in to take us away from my mom, right? And I just, they were, I started freaking out. I'm like, what the fuck? My little brother was doing a little brother thing, where he's just like, ah! He's like, this is your mother! And I'm like, what the fuck? Ah! Ah! He's like, this is your fault! I'm like, I know, dude, we're in over our heads, right? So I'm serious, man. I swung on the cop. I'm like, leave my mom alone. I'm crying. My mom's crying. The whole principal's office is crying, right? So the cop being a man, he's like, look, I can't arrest his kid's mom. It's, you know, parent, she's a good woman, and, right? So they made me sign this fucking contract, read me the law that if I cut school one more time before my 18th birthday, my mother would go to jail. Okay? Fast forward, sophomore year of high school. So I'm hanging out with my friends, right? You know, my buddy's like, yo, dude, let's cut class. I'm like, I can't. He's like, why? I'm like, because my mom will go to jail. He's like, what the fuck are you talking about? I'm like, dude, I cut a lot of school in fifth grade, all right? Now there's a law, like it's something to do with neglect or some shit. I'm not risking my mom's freedom, all right? I'll do whatever the hell you want to do. I just ain't cutting school. He's like, dude, that's the dumbest shit I've ever heard, man. That shit don't make any sense, right? She staged the whole thing. No, seriously, like, I started doing the math. I'm like, wait a minute, this fucking doesn't make any sense. The hell, right? Dude, for like five years, I thought if I cut school, my mom would go to fucking jail. And I was, I went home like, mom, what the fuck? How could you lie to me? She's like, you believe that shit? She's like, what do you want me to do? Your kids are horrible. It's amazing. I wouldn't cut school one day, but I stole a fucking car in middle school. Well, because I knew I was at risk in my mom's freedom. It was just mine. Yeah, I stole a car. Well, I didn't actually steal it. I just rode shotgun and laughed the whole fucking time. My best friend stole it. And he was that kid. I don't know, every guy, you have that one friend. You ever had that one friend growing up you just knew was going to go to jail? You know what I mean? Like that one piece of shit kid with like, no adult supervision. You ever had that kid? Motherfucker, like the kid was always outside. Like, you ever had that outside kid? It's like a Wednesday at midnight and he's just outside and shit hanging out. It's like, dude, where's your family? This kid, man, this kid was out of his mind, man. He was like a peanuts character, really. He wore the same shit every day and he had no parents. I don't even... Dude, this kid, I'm not even ex... This kid was the craziest kid. He's a legend where I'm from. The kid was out of his fucking mind. Dude, he stole an ambulance, all right? At 12. That's the greatest thing you could ever see as a 12-year-old, by the way, is your best friend stealing a fucking ambulance. What happened? The driver's pulled up, right? And the ambulance driver, they got a call for you or something and they left the keys in the ignition, right? So my boy was like, yo, B, let's take the ambulance. I'm like, uh, no, B. What the fuck is wrong with you? Right? So he just ran and then he got into the ambulance, right? And this is... To me, this is the funniest part of the whole story, all right? Uh, you may not find this funny, but I think it's hilarious. He was trying to get the sirens on first. Like, that was his... I'm dead... Like, that was his first priority. Like, all you heard was like, whew, whew, whew, whew, whew, right? And then the paramedics were in the store going, holy shit, there's a kid in the ambulance, right? And then he got him on and was like, whew, whew, and he just took off. We were like, holy shit, right? Here's the thing, he didn't even go anywhere. He was just doing laps with the fucking ambulance, right? And we were cheering him on, and then the cops were there immediately, right? And then he jumped out on foot and... Dude, they beat the fuck out of that kid. By the way, that's the second greatest thing you could ever see as a 12-year-old. There's your best friend getting kicked to sleep by the Pussegg, New Jersey police department. Dude, they were... Remember when I was seeing good fellas with Billy Batch? They were just... Dude, they beat... I thought they killed the kid. He was just laying there like a dick. And then they just threw him in the back of the ambulance and took him to the fucking hospital. We were cheering... No, here's my theory. Here's why I think kids in middle school lose their mind. Because you're not defined. You don't know where you're at in the kid hierarchy. You're in, like, kid purgatory. You know what I mean? Because you got, like, one foot and being a little kid, and then the other foot and being a fucking filthy teenager. You know what I mean? You're like both. Like a hybrid. Because... No, because I remember in middle school, like, I'm trying to finger-bang Jessica Lisa, but I'm still watching, like, Saturday morning cartoons. It's confusing, you know what I mean? Like, even at night that I stole the car, I went home and put on a Dallas Cowboy 1Z pajama outfit. Like, it was kind of a Thug-Wares-Foot-Seas, you know what I mean? And then you get to middle school, and it's even more confusing, because you expect everybody to be cute and little, like elementary school, which most kids are. Right? But then there's those old-ass kids that, like, hit puberty way too early in life. You ever had those adult kids in middle... They should have their own goddamn school, by the way. Like, why are they intermixin' with real little kids? Like, you ever have that chick with tits that could fight? You ever have that dude in middle school look like a fucking grown man? Uh, Delante. Dude, Delante was, like, six foot in middle school, okay? And he had a beard, alright? And not like a five o'clock shadow, like a Kimbo slice Rick Ross... He had a dick. He had a real dick in middle school. He had a grown adult dick. I know this, because he used to show everybody. He was always taking his root out in the hallway. Do I remember staring at him as a kid, thinking, like, how the fuck are you 12? Like, what are you, Benjamin Button? How old are you, Delante? He was old as sh... I think he was divorced or something. He was just... I hated Delante, though. Well, he was the school bully, you know what I mean? He was like... Everybody was afraid of Delante. Teachers were afraid of Delante. By the way, this was in South Florida, Delante. I stole the car in New Jersey, but this was in South Florida. Well, I went to three middle schools. So that's what happened is we were in New Jersey. My mom's like, this place is terrible. There's a lot of drugs and crime. Uh, let's move to South Florida. And Delante, everything he said was, oh, pussass, that's all he'd ever say. He said, oh, pussass, fuck it, like, that's all he talked. And they call white people crackers. I don't know if you know that, like, oh, pussass, cracker, oh, fuck, cracker. He's like, oh, hello, Delante, how's it going? He's like, fuck you, old bitch, ass, pussass. Right, he had a mouthful of gold teeth. So whenever he talked, he said, he's fucking gold. Oh, pussass, fuck it. Oh, fuck it. Oh, fuck boy. You hear that? Oh, fuck boy, oh, he called me a dick in the booty ass cracker one. Oh, dick in the booty ass, fuck it. Dude, my schools were rough, man. They were rough as shit. And that's the other thing, when you're white and broke, you're fucked. Nobody gives a shit. They're like, hey, you're white, just be happy with that. You know what I mean? Like, we had a day in my school, if this were the other way around, people would have been marching, would have been hashtags everywhere, all right? It was called Cracker Knockout Day. Google it, it's a real thing. It still goes on. It's like a fucking tradition in South Florida. Cracker Day was the worst, man. Teachers didn't even show up for that shit. And that's the day the brothers would knock out all the white kids, all five of us. Sucked ass, man. And that's why I hate Black History Month. I don't like it, not a fan. Well, it always happened in February, right? Because they would show those civil rights videos in the auditorium, getting brothers all amped up and shit, and you feel them staring at you, and it's like, I didn't do anything. I'm on free breakfast, man. Fuck you old pussy, right? Dude, Delante, man. That dude, man. He was not, he knocked me out. I got knocked out by him three times, man. Well, I got stole on Cracker Day. I don't know if you know what stole means, but stole means like when somebody hits you without you seeing it, right? Because you're just walking down the hallway and then, right? And by the way, getting knocked out doesn't really hurt, right? It's just more embarrassing than anything. If you've never been knocked out before, this is what it's like, all right? You hear a noise, which is your face, and then this one, blink real quick and go, meow, meow, meow, meow, meow, right? And you're like, oh, I don't know if I did my math homework to like, you have no idea what just happened. And to be honest with you, all right? If you put a gun in my head and ask me how many fights I've been in my life, I can't put a number on it, all right? And I'm not trying to be a tough guy, just it is what it is. But I'll tell you this much. I got about 90% of the time, and I'm not trying to be a tough guy, but I'm not trying to be a tough guy, but I got about 19 strong losses, like fucking epic. Like in the hospital, just bleeding, laying there like a dick. By the way, we're friends on Facebook now. I'm the hell out there. He hit me up to play Candy Crush, I feel like, oh, put my hands, Candy Crush, yeah. But as a kid, I wanted to fight him, you know? And he has a thing too, man, like, I didn't realize what I looked like, because you ever picture yourself as a kid, right? And then you see a picture of yourself, and it's nothing what you thought you looked like. You know, you're like, what the fuck is that? Because I saw a picture of myself at that age. Now, in my mind, I thought it was just a little aversion what I look like now. First of all, I was fat as shit, all right? I was a fat little kid, and I used to stutter really bad. You'll pick up on it now. I'm better now. And I used to list, I was all fucked up. Like, you guys want some books, right? And I'm dead ass, and I brow everywhere in the picture, right? I'm serious, I was in mid-list, I'm looking, I'm like... I'm like, that's what I look like? Dude, my wife said the funniest thing. She said, she said, I look like I smelled like cheese. But I showed her Delante, I said, baby, come here. How old do you think this fucking kid is? She's like, what is that, your guidance counselor? This motherfucker was in a suit, he had a cane. This little yearbook quote, old pussy ass, dot, dot, you know. But no, man, I wanted to fight him, but you know, you can't fight Delante looking like you smelled like cheese. I'm like, I'm not gonna fight him. You know, you can't fight Delante looking like you smelled like cheese. So I used to try and force puberty. Now I don't know if any dude's ever done this move. Again, as a kid, I thought it was a good idea, but I would be in the bathroom like... Anybody ever try that? Like, I don't know what I was thinking, like I'm gonna push my dick out or something, you know what I mean? And it sucks, because I was a late bloomer, like my balls didn't drop until like my sophomore year of high school. I don't know what, but my pubes decided to start growing in between seventh and eighth. I don't know why that happened. And then stopped growing. And they grew in on the side. I don't know if anybody had that move. No, see, for like three years, I walked around with no body hair, this little baby dick, and this weird fucking mustache. Dude, my dick looked like a hipster. Well, because I think guys, I mean, I think, I don't know, I mean, again, I can't speak for chicks, but if I were you, like, I would be afraid of your puberty. You know what I mean? Because that's some heavy shit to go through. Just to know, like, just the fact that you're gonna grow boobs and bleed for the rest of your life would freak me the fuck out as a little girl. That's gotta be frightening, because all guys get, all we get is just awkward looking, like, oh. You know what I mean? Like, ever grow five feet in a week? I mean, you're all ganglion shit, like none of your appendages match, or... You know what I mean? Everything's all weird. It was weird, I had these long legs, big feet, no calves, fat torso, I was just like, my nipples hurt, I don't know what the fuck that was. Anybody have tender nipples? Like, why do my nipples hurt? I'm just walking around like, oh, why is there a mustache on my dick? Just all fucking... Like, you look like, you ever see that thing on the car dealership, this fucking thing? But to be a girl, I'd be... Because I'd be more afraid of your first one, the first period, the one that you... you heard is coming, you know is coming, and I'm pretty sure you weren't prepared for. And I pray you were home. Because Mother Nature don't give a fuck where you're at. Anybody ever, if a girl get the period in your classroom? Fucking top five most frightening moments of my life. Beatrice Santiago. No, I'm serious, there was just blood everywhere. Nobody knew what the... I thought somebody walked up behind her and was like, this is for a little puppet. I just fucking shanked her and threw the shit. I thought she owed Delante a chocolate milk for some shit, you know? Because I was just sitting there doing my work, and then she sat behind me all of a sudden I just hear, somebody help me! Somebody help! And I turn around, I'm like, oh my god! She's like, somebody help me, right? And the teacher was a dude, he didn't know what to do, he's like, everybody just calm down, right? Kids were crying and shit. I'll tell you this, I'm just glad that Chick with Tits was in my class. When she jumped right up, she's like, I got this. Everybody relax, alright? This shit happened to me in kindergarten. She just grabbed me some water and some hot towels. Dude, she had Beatrice cleaned up everything, five minutes, like nothing happened. She was like Harvey Keitel in pulp fiction. The wolf? I'll tell you, I had a rough time with my older brother, because, well, he was gay and you knew it. You know what I mean? So his whole experience in school was way different, you know? Especially in my neighborhood. The only thing that, you know, they'd be like, old dick of the booty ass cracker, they'd be like... Now, we always knew he was gay, but he wasn't like, you know, like, he wasn't like over the top exhausting gay. You ever see those guys go, hey, what's up, cock? Woo, like that guy? He was more subtle, but you know. Well, that's why it pisses me off when people think, like, you know, people choose to be gay. No, if you lived around it, you know, they're fucking bored in that way. That bitch was different from day one. Now, I'm saying we always knew he was suspect as a kid. Well, he was just a different little dude, you know? He's quiet. He could draw. Here's the thing, too, he was really into women, which I found ironic, but like, gay dudes, like, women, they're really, like, they're into women, but they're into your beauty. No, like, he'd see a girl and be like, oh my God, she's gorgeous, I need to draw her. Then he would fucking draw pictures of women. You know, like, actresses and shit, and then he would frame them and put them on his wall, right? Which I also found ironic, you know? Little gay dude, pictures of women all over his wall, right? Little straight dude, black guys everywhere, all over my wall. Fucking Michael Jordan, Emmett Smith. But again, we knew, we knew he was gay. Like, when he came out, we had to act shocked. Well, as a family, because it was such a big deal for him, you know, like, he called us in the living room, and my mom's like, I think he's gonna tell us now. He's like, act surprised, and I was trying not to laugh the whole fucking time. She's like, listen, I gotta tell you guys something. No, really? We had no idea. Really? You had the whole family fool, man. I'll tell you, it was hand-drawn pictures of Susan Lucci on your wall, really threw us for a loop. I remember going to my mom, thank God, now we get to make fun of him in front of him. In 19 years, a good joke's out the goddamn window. I remember going to my mom, I remember going to my mom, thank God, now we get to make fun of him in front of him. Goddamn window. He was a tough kid, though. My brother could fight. He wasn't like, that's the other thing. Like, my little brother could kick my ass, and my older brother could kick my ass. Like, that's, but it's okay, my little brother, because he's bigger than me, but to have your gay brother beat the fuck out of you. But he was into like regular dudes, that's the other thing. Like, he dated dudes, like gay dudes that you didn't know were gay. Right? He dated a guy that was ex-special forces. Okay, who knew everything about sports. We used to bet together, and I made a killin' with that cocksucker. No pun intended. I'll be honest with you, though, I don't care how open-minded you claim to be as a person. There's nothing more awkward than talking football with another man while he's sittin' on your brother's lap. Right? I'm just puttin' that shit out there, and he's got his arm over my brother's shoulder, like, hey, should we take the over-and-under on Monday night? I'm like, well, maybe you should start by takin' your arm from over my brother's shoulder, but... You know, I don't want to say anything, because I'm a brother feel bad about who he is, and I don't want to get the shippied out of me at a Christmas Eve party before the fish comes out. It's a joke for the Italians. They'll get that at home. Yeah! Nah, but Scotty, man, I don't know if you noticed, but I'm speakin' past tense, because I ended up losing him, too, man, which, you know, that really fucked with me. Because, you know, he was... he was like my father, in a sense, because he helped raise me. And especially when I got married, I really wanted him with me for that whole process, because, you know, he could have helped my wife plan the fuckin' thing, and I wouldn't have had her been involved. I would have had to explain the bachelor party, though, you know what I mean? My buddy's be like, why the fuck we out of play? Let's just... Let him do what he does, alright? We'll hit the strip club after the pottery class. Now, eat your fuckin' quiche, and enjoy this. I'll tell you, I don't know if any dude's been through the wedding planning... Oh, it's god-awful. That's another reason why I'm for gay marriage. Well, weddings ain't for straight dudes. Alright, let's be honest. That's got nothing to do with us. I mean, it's not even our party. We don't even need to fuckin' be there. Seriously, nobody gives a shit... Nobody gives a fuck about the groom. Nobody stands when I walk into a room. I come out first like a dick, like, moon. Standing there for eight hours sweating. She gets music. Dun, dun, dun, dun, dun, dun, dun, dun! Everybody stands and, it's my day! I'm a princess! Everybody bow! And her father's like, here, take him. It's like, go inherit that financial liability. I saw this dude doing math when he dropped her off, man. He was just deducting shit. Ah, no more cell phone, no more health insurance, and I'm like, here you go, kid. It's the best day ever. And financially, it's the biggest kick in the ball as you can get other than, you know, betting Dallas on Thanksgiving. No, it's... And as a dude, he already tapped out and exhausted from the whole engagement ring searching process, which, you know, you want to talk about inequality. This is inequality. Holy shit, man. You have no idea, man. Like, I was, you know, investigating diamonds. I didn't know how much they fucked it were. I had to learn about their SPF or whatever the hell it is, like the clarity. And it's a lot of pressure on a man to get the ring, you understand? Because, you know, God forbid, we just focus on the love, right? Right? Because that's what it's about. Gotta get the right way. What is it, women? What the fuck? Why are you so obsessed with rings? I don't get it. Like, what are you, hobbits of some shit? Like... You're always like, let me see the ring. Oh, oh, oh. You guys love rings. You even make rings up. You ever hear of a promise ring? You ever hear that bullshit? It's a fucking scam, dude. It's another excuse for them to get rings. If you don't know what a promise ring is, it's a ring promising her an engagement ring, which leads to a wedding ring. See? See what you're doing? What do you need three rings for? What are you, fucking Saturn? And here's the other thing, like, that's the one... I was looking forward to getting engaged. I planned everything. I practiced my pitch, you know what I mean? Like, my little speech. I'm dead serious. Here's what happens. The minute you start dropping to a knee, they start freaking the fuck out, right? And she starts making, like, baby seal noise. Oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh. Right? And I'm trying to throw my pitch at her. You know, my whole life, I've been waiting to use that Rocky II line, you know, when he was in front of the tiger cage. I'm like, yo, what are you doing the next 40, 50 years, right? Dude, she baby sealed all over the fucking Rocky II line. The whole Rocky II line done. So once we got engaged, she says, you happy? Yeah, okay. So am I. It's great. Now, go playing your party. I don't want to be involved. Go do the wedding. I'm not gonna... Seriously, I'm not offering anything. I'm not bringing anything to the table, other than just, you know, logic and fiscal responsibility. So go playing your party. And they make you involved, man. Every woman in the family, they turn on... My mom turned on me. Because they're sitting there playing and shit, and you're like, excuse me, why do we have to rent napkins? Why don't we just use the napkins that come with the food? I don't want to know why. Well, because those are off-white, not egg cream. You don't know what the fuck you're talking about. You're like, okay, fine. And mom's like, shut up. Her grandmother, her mom, her sister, everybody, cousins. It's like, why am I here? Then you just start agreeing to everything, even though you know you're getting robbed. You know, you're just sitting there going, oh, yeah, a harp, that's a great idea. We really need a harp. No, it's, what, $1,300 for some chubby bitch to play for 40 minutes? We better fucking, we better jump on that, man. That sounds like a real bargain right there. And I don't even know if she was good. It just sounded like the same song. It sounded like one song. It sounded like somebody was grantin' wishes and doing magic for fucking 40 minutes. She ate all of her shrimp. No, I'm saying I caught her stealing shrimp, man. And I obsessed on that. Like, that bothered me. My wife's like, why do you care? She's not stealing it. It's included. We already paid for her. I'm like, no. She's stealing the shrimp because she fucking thinks she's stealing the shrimp. And her stand is the principal. She did. We had a raw bar, right? She was eating fucking oysters on her chest like an otter. Oh, I'm serious. She's just cracking oysters on her chest. All you saw around the heart were just shrimp tails and cockle shells. Sir, I went up to her. I confronted her. I said, come here. I said, listen. We both know, we both know what you did. Right? We both, no, no, no. You know what you did? No, I told her, I said, look, I caught you stealing shrimp, all right? Now, here's what's going to happen. You're going to play to heart now for the fucking flower, right? And you're going to enjoy yourself, OK? You don't have to sneak food like an animal, all right? This is an Italian wedding. Everybody sits. Everybody eats the fucking valleys. Everybody. Everybody sits. We're all family tonight, OK? So you play your heart for an hour, OK? Then when you're done, you can sit down. You can have your choice of fucking whatever, vegetarian, shrimp, fish, whatever fucking, you probably eat every entree we got. It's fine. It's all covered, OK? You can drink all night. It's an open bar, all right? Get hammered. Have fun. I'm pretty sure one of my degenerate friends is going to try and fuck you. But you play that harp. Listen, she's an asshole for playing a harp anyways, all right? It's a dick instrument. Seriously, what are you, a mythical creature? Who the fuck? I'll tell you, another scam is that fucking save the date card. What a goddamn... I wish I thought of that shit. That's like one of the greatest scams of all time. It goes Ponzi scheme, dressing up as a boy scout and collecting money, and then save the date cards. All right, if you don't know what those are, those are cards that you buy, that you mail people, to let them know you're going to mail them a fucking card. That's like me calling you going, hey, yo, hang up, I'm going to call you. And then you charge me $300 for the first fucking phone call. And you know why they want the engagement cards? That's where they get to show off those fucking horrible gay ass engagement photos they make you take. And let's be honest, there's no word to describe it other than gay. It's gay as shit. It's so gay that if my gay brother was alive, he'd be like, dude, this is the gayest shit I've ever seen in my life. And I've seen some hardcore gay shit. I've seen gay shit where there's just dicks everywhere, and this is gayer. You could have been blown a dude, taken in the ass, watching glee, and that would have still been ten times more masculine than these engagement photos. And they're all a lie. The whole thing's a lie. They're just pictures of us doing stuff as a couple we've never done before in our life. I'm a goddamn grown man, frolicking every photo, jumping in the air, yeah, everywhere, just jumping. And why are we jumping in the air? Like, what, are we, in a car or something? Like, what the fuck? And why are we wearing shoes? Why can't we wear shoes? Like, what does that gotta do with being in love? Who walks barefoot in Chicago? That's when we took our engagement photos in Chicago, you know, because that's where we met. So we're just fucking frolicking. And every photo they make the guy look like a goddamn cuckold. By the way, anybody who laughed at that watches porn. Dude, there's a picture of us holding hands, right? Walking in a sunset. Get the fuck out of here. We never did that. And in reality, what asshole couple does that in real life? You know what I mean? Like, seriously, what annoying hamster couple. And we'll be like, oh yeah, no, that's our thing. No man, sunrises in sunsets. It's what we do. It's like we get up early, we have coffee, right? And then we walk around all day, and we make sure not to let each other go. And then, at the end of the day, we like to watch the sunset, and we walk towards it for no goddamn reason, and then we jump in the air and get stuck. I'll kill everybody. I got a Yorkie now. And I'll be honest with you, I love the dog, but, you know, she's obsessed with the fucking dog. She does take pictures of a goddamn dog. She'll call me in the living room or something. She'll be like, get in here. I'll be working. What? What? Like, I think there's a problem. She's like, look! And the dog's just fucking eating breakfast. It's not doing it. And then we're staring at the dog, and then the dog's creeped out because it feels like staring at it. She's like, get the camera, right? And I'm trying to get the dog to smile. I'll be honest with you, though, it is cute. Like, if you're left alone with it for a while, I don't know if you... it sucks you in. Like, yeah, it's me. I'm alone with it. I started staring at me, and I'm like... I'm like, what the fuck you... what do you want? He's like... What do you want? You hungry or something? You want a drink? You want a treat? Is that what you want? Is that what you want? You want your squeak toy? Where's your squeak toy? Where's your squeak toy? Right? And the fucking thing just takes off, and... and you can tell it's thinking, I got him. You know what I mean? It is, man. It's so cute. I hate being around it, man. This is fucked up. It's so cute, I want to hurt it. You know what I mean? Now, don't get me... I don't mean like, throw him up against the wall or some shit. Right? I mean, like, you ever, like, pet him, and then just squeeze it a little, and it goes... You're like, it's okay. It's okay. I'm here to protect you. From me. Um... I just... Well, alright. I want to... My goal is to statement. Like, I just want to be married for the rest of my life. I don't want to fuck it up. I want what my grandparents had. You know what I mean? No, I'm serious. That's all I want. My grandparents were married over 60-something years. You know what I mean? That's what I want. I want that. You know, a lot of that had to do with... Well, I don't know. I don't know. I don't know. I don't know. I don't know. I don't know what that had to do with... Well, my grandfather cheated on her when she was younger. She took him back, and I think that helped. Because that was a wrap. That motherfucker never said anything ever again. Like, you know, like... Never won an argument. Nothing. I'm dead serious. Like, she'd be like, I feel like going to the movies. He'd be like, I feel like sitting at home today. Well, I didn't feel like you fucking that flapper back in 1920. Alright, let's go get your coat. You know, we weren't even married yet, but that's okay. I was just overseas fighting for the country. Life was rough for them, man. You know, my grandfather was always ready to get down. He used to make weapons. Like, he had weapons all the time. You ever see those old man weapons and shit, like they would make, like in the shed? My grandfather had a sock with like $900 worth of quarters in it, just fucking... You ever see the shit they would make? He had an axe handle that was like this big, right? That he would keep under the seat of his Lincoln, that he would drive around with tape at the bottom of it, I guess, for grip, right? And then a fucking nail in the top of it. I remember as a kid going, what's that for? He's like, just in case. In case of what? Like, what are you, brave heart? What the fuck is that thing? By the way, the reason why we were in Florida is because my grandparents retired there. You understand? That's why we were... My grandparents really helped raise me and my brothers. You know, we were always down there. Now, both my grandparents worked. My grandfather worked at a gas station and my grandmother worked at a bank. Okay? Now, they used to have to get us babysitters, right? To watch us because they both worked. Now, the whole purpose we were down there was to stay out of trouble, but it really didn't matter because me and my brothers were horrible kids. Like, we were like the Simpson kids. Seriously, we were terrible. Like, we ran through babysitters... Like, we had this one babysitter, okay? We used to call her Aunt Face. Right? Now, she was this big lady from the south, right? And she looked like this. And she looked like a fucking aunt. That's why we called her Aunt Face, right? Now, if you're not familiar with Florida, there's still pockets that are very south, like very southern. You understand? And now, I don't know if you're familiar with a switch. You know what that is? Okay. Well, down south, when you're acting up, there's a thing called a switch. She'll be like, go outside and break me off a switch, right? And we were from Jersey. Like, what the fuck's a switch? Well, if you don't know, they take you outside. They make you pick out a tree branch, right? You have to break it off. You give it to them, and they fucking hit you with it. It's like some sadistic, like, Guantanamo Bay, Hannibal... Like, a mind-flick. Why do I gotta pick the weapon you're gonna beat me with, right? So, the next time we were acting up, Aunt Face is like, go outside and break me off a switch, right? So, now, I'm like, fuck you, Aunt Face. I ain't falling for that shit again, right? So, Aunt Face goes, fine, I'll do it myself, right? So, she went outside, right? We locked Aunt Face out of the house for, like, nine hours. All right? No, I'm serious. And she was running around, like, trying to get in. Like, she was doing her little old lady run, you know what I mean? Where they were, like, going like this, like... And me and my brothers would open the door and close, like, we were messing... No. Dude, my grandparents had this sliding glass door, right? My older brother was opening and closing the curtain, and I was just doing that little kid dance, right? So, Aunt Face tapped out, right? She didn't want to watch us anymore. So, now, my grandmother found this last-minute replacement, and I don't know where she found this woman. There's no word to describe her other than just, like, white filth. Like, she was just white... Like, she was pale and stringy hair. She had, like, scrapes and bruises and shit all... Like, she looked like she fell off a bike. She was all banged out, man. And her nickname was the Crazy Lady. That's what we called her, right? Because, like, she would never... When she would talk to you, she would never make eye contact, right? And whatever her last words were, she would always repeat them to herself. So, this is the 80s, so there's no background checks, right? So, my grandmother just dropped her off. She's like, watch the kids and fucking left, right? So, I'm staring at the Crazy Lady. She's not staring at me. Doesn't say a word, right? She just peels off and walks into my grandparents' bedroom, and she lays on their bed all day, right? Seriously, talk to her boyfriend all day, which was cool. She didn't mess with us. We didn't mess with her. The day's going great, okay? End of the day comes, and the Crazy Lady calls us into the bedroom. She's like, you kids get in here. I need to know if you cleaned your room, because if it didn't clean your room, you're not going to go to McDonald's. Now, it's important to the story to know it was Filet-O-Fish Fridays at McDonald's, alright? Now, and the reason that's important is because when we were kids, if we were good, my grandparents would take us to McDonald's as a reward, right? And as a kid, you know, McDonald's was the shit, man. I still get excited. You know, because they had so many things for kids there, you know, happy meals, Filet-O-Fishes. Like, I thought McDonald's was so cool. I had a cousin, Steve, that worked at McDonald's, and I used to brag that I had a cousin that worked at McDonald's. And none of my friends believe me. They're like, no, you don't. I'm like, yeah, get extra shit in my happy meal, like our new people. Right? So now we go to clean the room, okay? Now, my older brother, Scotty, he's 10. That's the gay one. I'm six. My little brother, Keith, he's three, so you don't really count right now, right? So we're making a bed, we're trying to clean. My older brother's gay gene kicked in, because this motherfucker could make a bed better than my grandmother. I mean, everything was perfectly folded, pillows were perfect, everything, right? So now we call the crazy lady in because she wanted to inspect the room. So I'm like, hey, crazy lady, we're done cleaning the room, you know, you want to check it out. Now, I don't know what the fuck happened, all right, but her head just, she started freaking out. Like, her head started going 100 miles an hour, and she was looking at the room. And I was like, wow. She goes, you think this room looks clean? It doesn't look clean to me! And then freaked the fuck out, right? And just started, like, messing the bed up, knocking shit off the dresser, skipping like a fucking maniac, right? And my grandmother, you know, we're Roman Catholics, so my grandmother had like those creepy saint statues. She bit Slavsay Peter on the floor. So my older brother's like, hey lady, why are you messing the room up? She doesn't say a word, she just catches him straight shot. Just, right, fucking dropped him, right? Scotty dry, I did the little kid thing where you laugh and then you freak the fuck out. You know, she hit him and was like, I was like, ah, ah, ah, ah, ah, ah, ah! All right, here's where the story gets fucked up. Now, my brother told me to do this, all right? He denied it this whole lot, but he was looking at me bleeding going, you know what you need to do? The crazy lady goes back in the bedroom, lays back on my grandparents' bed, on her stomach, and starts talking to her boyfriend, laughing about what the fuck she just did, right? So I walk in my grandparents' room, I look at her, she's laughing, okay? I look at my brother, he's bleeding. Under my grandfather's nut sack of change, he had this little baby axe, okay? So I look at her, I look at my brother, I look at the axe, then I got my own voices in my head going, you gonna let her get away with that shit? That's your brother, she bit-slaps St. Peter, that's fucking sacrilege, right? I grab the axe and as hard as I can, right in the back of her leg, all right? Well, I'm six years old, so there wasn't a lot of torque behind it, okay? But it was good enough to get in there, man. And I don't know what the fuck I hit, but blood went everywhere. Long story boring, the cops come, right? And they're interrogating me, and I'm crying, you know, because I know we ain't going to McDonald's now. Like, I know I fucked that up. And they're asking me questions, and I'm just like, all right. Now, my grandfather comes home, now mind you, back then, there was no, nothing, no cell phones, none. He just pulled up, saw an ambulance, the cops, he comes running in, and he's like, what the fuck happened? And I'm just like, ah, you know, we were a kid, he just throw out one word. I'm like, McDonald's! He's like, what the fuck? She told us to clean the room, or we couldn't go to McDonald's! And Scotty told me to do it. And she punched Scotty in the face, he goes, oh, what'd she do? I go, she punched Scotty in the face. B-line's it over to her, okay? Now, she's in a blanket, she's all wrapped up, all fucking crazy, right? Her father's there, the cop's there, he walks over, he goes to the father, and I feel terrible about this whole thing. Can I talk to her for a second? I want to make sure she's all right. He goes, hey, you okay? What are you, like, 20-something years old, you're an adult? Listen, if you ever put your hands on my kids again, I'm going to make one phone call, all right? I'm going to have your head chopped off, you're going to be wrapped in plastic, and no one will ever find you. Then he looks at me and he goes, we're going to McDonald's! Listen, guys, thank you so much, man, God bless you. Thank you. Next! Oh, my God, how old are you? I'm 12, fuck boy. What you got on these jelly beans? Now, what you mong with the latte? You"
}