{
    "url": null,
    "title": "Redd Foxx Stand Up",
    "transcript": " I횬. l'll never go to sleep. ważia Its here we go. Got to get my old duck seat, old press, shine my shoes, get my vest. Tonight I gotta look my best, Lulu's back in town. Got to get a hair from Buck somewhere, shine my shoes, slit my hair, get myself a boot in there, Lulu's back in town. Dull all my pets, Harlem coquettes, oh this regrets, she won't be around. You could tell the real man not to call, ain't coming home until the fall. I might not get back home at all, Lulu's a prostitute. Alright, let's get it on. Right now it's just about star time. We want you to sit back relaxed and get ready for a thrill. Let's get our hands together and bring to the stage the one and only, Red Fog Me Up! Music plays Chicago, Chicago, back to Harlem town. Chicago, Chicago, now let's show you around. Bet you bottom dollar you lose your blues in Chicago. Chicago, the town that Billy Sunday could put down. On State Street, that great street, I just wanna say, they do things they don't do on Broadway. Say, you'll have the time and time of your life. I saw a man eating his wife in Chicago. In Chicago, in Chicago, my home town. Music plays Thank you for being here. I know you heard I was dirty. And blue, vulgar, nasty, gross. Well that's a lot of shit. You folks that might cringe when I say shit and you'll hear plenty of times this morning. I only say shit because I'm too old to stand up here and say do do. I smoke. I've been smoking for 44 years. I don't have cancer now, I probably have something that would eat it up. A lot of people quit smoking, but that's wrong. You got to leave here somehow. A friend of mine quit smoking and got killed by the back of the truck. You folks that don't smoke, I'd like you to know that you're gonna die from something else. But you're gonna die. Nobody ever stayed here. If they did, where's Abraham Lincoln tonight? I'll tell you, he's somewhere in a long coffin with that tall fucking hat on. Those hats never come back in style unless you wanna take one on a picnic, ticket them to woods and shit in it. You folks that don't smoke, what do you do when you finish fucking eat jelly beans? Let me get a bit of this. Speaking of big pussy. Okay, then I won't speak on it. But that is an ugly son bitch, ain't it fellas? Think back fellas, remember the first time you checked it out clothes? That's an ugly son bitch, ain't it fellas? Look like Sammy with his eye out. It's a Christmas present from Betty Ford. Oh god damn it, go ahead and boom. You laughed at Sammy's eye. Cause to tell you the truth, I'd rather be riding in a car with Betty Ford and be riding in a car with Sammy Davis. Cause I know you can see with one tint. No, that's the way it goes. I talk about sex and I know some of you here tonight thinking about it. And the girl next to you is wondering if you're thinking about it. Girl asked me a couple of weeks ago, she said, can you fuck me and hurt me? I said, you got damn right. So I fucked and hid in the head with a brick. People have said I was dirty because I've said shit. Fuck. Well to me, fuck is not dirty. Fuck is only dirty when you don't wash up. Now I believe that if there's any proves here. I could say intercourse, but if you doing it right, you fucking. Fellas, tell the truth in your whole life, you never heard a girl say, oh intercourse me. Intercourse me. No, no, no, they don't say that. Girls are clever. Cause they know what they said, intercourse me, your worm might fall. So they tell it like it is. Fuck me. Hold it right there. Don't move it. See, I don't like a whole lot of talking. And ask me a bunch of fucking questions. Is it good? Is it good? Oh, dad, is it good? I said, shit, it's better than string beans. Speaking of muckin', a nigga tried to rob me in New York about a month ago. Now it wasn't that dumb, a nigga gonna stick up a black man. It is a difference. I'm black. People of color, black, white, yellow, brown and red. They had no Negro in the crayon box. That's right. Look at me, a black dude with these fucking thin lips. They get the job done. I hate them though. I can hardly taste barbecue. Yes, I eat pork. That's why I never joined no group. Most groups, you have to give up pork. Shit, a hog never did nothing to me. You think about it, a pig is no uglier than a cow. You look at a cow sometime with that big snobby nose and them dirty tits. One thing I can't stand is a snobby nose. I'll clean up a dirty tit. I hate big titties. They slow you down. Who wants to stop there? See, nowadays girls won't head. See how quiet it got? I'm asked one question, fellas. When I ask this question, look in your old lady's face. If you sit with another couple, look in his old lady's face. Question. Girls, if you love head and want some this morning, smile. Thank you. Pardon me, honey. Did you hear the question? God damn, don't sit up there like you know old Roberts, personally. Old Roberts. Oral. Ain't that the hell of a name for a preacher? Sound like you might eat the congregation. Let me tell you a good story about a preacher. See, it was an old couple, past 70, both of them. They were sitting in the front room with their home rocking, listening to the radio. They were comfortable because the home was almost paid for. They'd been living there 55 years. And one of those faith healers came on the radio. The couple were listening real tense. The faith healer said, I can heal you tonight. If you want to be healed, put one hand on your radio. And put one hand on what you want to heal. So the old lady was listening closely. She reached over and put one hand on the radio. Put one hand on old tired heart. Started to sing, wait in the water, wait in the water, children. Her husband looked over and he said, shit. He said, what the hell, I take a chance. He put one hand on the radio and sneak one hand down his lap. His wife looked over at him. She said, her but the man say could heal, not raise the dead. Tonight I'm going to talk about children. I don't have any children myself, but I did write a poem for children this Christmas. Poem for children this Christmas. Christmas bells and Santa's elves and presents meet the tree. The kids are all in slumberland. It's a quarter after three. In the morning there'll be laughter. Children playing with their toys. Make you want to choke one of them mother fucker, but make it so much noise. That's something else I want to clear up tonight. Mother fucker. See for years mother fucker's been attributed to black people. We don't clear that shit up tonight. Mother fucker belongs to the world. Let's define it. Mother fucker. That means if you're a father, you're a mother fucker. That's right. She's a mother, isn't she? You fucking hate you? How you think you get to your fucking, don't you? You ever see a nine pound tongue in a pamper? Fuck that. I'm glad I don't have any children though. I had to be second to me when I was 13. I had to be second to me when I was 13. I knew then I didn't want no crying and shit around my house. Laugh, but that's what happens. Soon as you get kids crying and shit, you go to hospital and pick them up. They shit in your hand and they cry. Somebody shit in your hand and you just cry. That's where I think the Lord fucked up again. The ass don't belong in the pants. The ass belong somewhere the air can hit it. You cover your ass all up and everything. You put drawers on your ass and pants and chocolate strapping on blooms and shit on your ass. The ass can't even breathe it. Smother your ass to death. The ass should be in the palm of the hand. Right there. That's where nice place for the ass. You can walk right on in the tall and get things taken care of. Ain't no paper fucking. Somebody to make you mad in a traffic accident? Smack the shit out of them. Ooh, man. I'm glad I'm having no kids. Because I know myself as a youngster and see it was three of us triplets. Ed, Red and Fred. That is true. Triplets born 15 minutes apart. My dad came to the hospital. He saw his land and the crib. He looked at my mother. He said, Mary, you pick out the one you want because I'm gonna drown him other two. Shit, I always been lucky. Hey, brother, is that a gold tooth in your mouth? Don't smile with that gold tooth when you get back to the ghetto. Please. Want them niggas a dig of mine in your face? I use a nick all the time. Don't make no difference. Niggas don't mean nothing. Really, it's in the dictionary. You should get used to it. It's in the dictionary. It says, niggas are lazy and shiflus. That's the definition. Niggas are lazy and shiflus. That means we got some white niggas, too. That's the education. Because I didn't go to college. I knew I wasn't going to college when I didn't get into high school. I said, fuck them. They weren't teaching nothing. They were teaching me filth in school. Well, well, well, my pussy fell in the well. I like to drown one out of 13. That's all right. And they had another one. Little boy blue, come blow your horn. You break your neck trying to blow your horn. If you want your horn blown, you need a friend. You ever meet one of them girls that I never gave anyone any hit before? Never in my whole life. You ever meet one of them? I met one, Las Vegas. I never gave anyone any hit. I said, you're a goddamn lie. She said, this is my first time. I said, you're a goddamn lie. I said, this is your first time. Why don't I feel teased? Well, let me get to my main subject. My main subject tonight is the fight. You folks looked at me like, the fight? Yeah, the fucking fight. Don't look at me. I had nothing to do with it. The Lord created the fight. Then put a smell in it so the deaf could enjoy it. I think the Lord fucked up on that odor. See, if I had created the fight, I'd have made it smell like coffee. That way, if someone farted in the morning, you'd think breakfast was ready. The Lord knew we needed the fight. How else could you eat a big bowl of beans inside a cabbage, sweet potato, slice a raw onion in a peach cobbler and two Pepsi colas and not be able to fight? Hell, in two days, you'd be a balloon. In a week, you'd be a fucking rocket. There's a guy with a nice smile on the end. Sir, can I ask you a personal question? Did you ever go to the movies and let out one of them quiet farts and sit there and watch people move? These things happen. There's a nice looking gentleman here, class, bougie. Sir, let me ask you a question. Did you ever fart and blame it on the dog? Get that son of a bitch out the living room, God damn it. Get him out of here. Poor dog, catch hell. One thing I'm happy about, girls don't fight. No, they don't. They poop. But remember, fellas, two boots equal a fight. So if you're here, too, scutter. That's all. Listen, something else. It was a big fat maid in Las Vegas. She must have weighed 300 pounds. She couldn't boot. Not at 300. In a pocket of gas formed in her lower abdomen, she was cleaning up the room. She was in the bathroom spraying pine salt all around the toilet. Plenty of pine salt. Everything was sparkling fresh. And this gas started working down. I mean, she had to fight. But the guests were in the room. She said, shit, why don't they go out somewhere? Because she went out in the hallway to fight. And some people were coming to the hallway, they lugging. She said, shit, what am I going to do? So she spied the elevator. And she cut loose. Bam! And she took up pine salt and sprayed it all around the elevator. And she was like, shh, shh, plenty of pine salt. And the doors of the elevator opened and a drunk got on. She said, what's the matter with you? She said, smell like somebody and shit a Christmas tree. That's what I said. Here's a trick. No honey, sit down. I mean this kind. Please don't give me that. She slewed me down. She said, I had that in the Marine Corps. Clap. I caught it off a rifle. I'm a war veteran. I was there. World War II. Who do you think they named the foxhole after, Hoover? I backed up so far in one battle. I bumped into a general. He said, why are you running? I said, I'm running because I cannot fly, you asshole. I backed up but I wasn't afraid. No sir, I was not afraid. I don't know what that was, I was slipping in. I can only tell you, it was brown and had corn in it. I guess you folks never shit and look back as all corn, huh? No sir, that teller goddamn lie. Indestructible corn. Stay in shit three days and we'll not dissolve. Corn say fuck shit. They just make bricks out of corn. You ever shit a brick? Oh, excuse me. Let me tell you about this nigga trying to rob me. In New York, this nigga jumped out of alley. Didn't have a gun, a pipe or a brick. All he knew was karate. Jumped out down and said, stick up. I got a black belt. I said, well they gonna need it to lower your black ass in the ground. Shit, black belt. Shit, I had a 38 and a green Gucci. Speaking of big pussy. This lady called her gynecologist. He said, doctor, you've given me the wrong hormone pills and I'm sick. I'm having a lot of difficulty. I was in his atoms in 44 years of practice. I never made one mistake. He said, what make you think I gave you the wrong hormone pills? She said, I don't think I knew you gave me the wrong hormone pills. Doctor said, how? She said, I got hair growing down my chest. Doctor said, well how far down is it growing? She said, down to my dick motherfucker. Modern things for modern living. My first wife, I'll never forget her. And I've tried. The woman was so petite. At the wedding she weighed 72 pounds. Small, size one. I could pick her up in the crouch and play head waiter. Your dinner is served. Seven years later, the bitch weighed 305. Seven years later, the bitch weighed 305. I ain't ginya, seven years later, the bitch ate everything but me. That's what caused my first argument. I said, well just kiss it as clean as my face. At the time I was a mechanic. 305. I stopped speaking to her. I just walked in the house and said, mmm. She couldn't take her head. I climbed up on her one night. Well hell it took 15 minutes in a nylon rope. She says it in, I say I'm through. I'm through. Caught a wrinkle on the way up. This other lady out there, she went to her college. She said take off all your clothes. She said, doctor, people don't want to be around me for some reason. I go to a dance, no one asked me to dance. I go to nightclub, people move. She said, help me doctor. Doctor, they take off everything. All your clothes, hang them up there and get up on the table and put your feet in the stirrups. He said, first blow your breath in my face. She said, He said, uh huh. He said, now get off the table, stand here and bend over while I can examine you. She bent over and the doctors started examination. Doctor said, you have zackle. She said, what? He said, you have zackle. She said, what the hell is zackle? He said, your breath smells zackle like your ayes. She said, what the hell is zackle? He said, your breath smells zackle like your ayes. That's just an old black habit, you know what I mean? A lot of people don't know that song that was written by a black guy. Where it totin' such a load. That ain't funny, honey. How dare you hit a bump on the motorcycle, that's something that's hurt all around your head. Pretty girl over there. I wish I liked white women. My wife's Korean. I married the enemy. I figured if you can't beat them good, fuck them. I'm a veteran first. Guy asked me, why did you marry out your race? I say, I asked, oh, would I marry a duck? I married a woman from the human race. Okay, what color you are when the light goes out, it becomes a question of who washed. That's right. Pretty. Pretty. But that's what you want to do. Just don't break my glasses. We're gonna sing now. We're gonna sing a tune everyone here remembers. Watch, on the downbeat. God damn, there's a guy with a head kinda clear. And one back there in the middle, no hair. You see him, sir? He was the beard. Look back there and see your clone. And if y'all sitting close together and y'all leaning y'all head in real close, it look like somebody's ass. Hey, look. You didn't get angry, did you? Don't get angry, no. And you know black people carry knives. No, I ain't shitting you, it was in the paper. Two weeks ago, I bought a knife. It was in the paper. It was all black people carried knives. And I said, shit, let me hurry up and get me one. I didn't know that. I've been can of ice pick 32 years. We're gonna sing, row, row, row your boat. Gently down the stream. Merrily, merrily, merrily. Merrily, merrily. Merrily, merrily. Merrily, merrily. Merrily, merrily. Merrily, merrily. Merrily, merrily. Marily, marily, marily, all the good-looking people. Oh, fuck it, shut up. You know, goddamn well, some of y'all shouldn't have been singing. As with old chicken, lost biggest a couple weeks ago. Asked me for $100. $100, the fuck. She said, $100. I thought she won't sell her car. I wish I had some old meat cause me $100. I cut it off and barbecued it. $100. I don't live with nobody. I just want to drop in for a few minutes. And some of them $100 chicks, you can drop right in. $100. $100. My ex-wife, I pay my ex-wife. I got three or four, I don't remember. I pay $5,000 a month in alimony. For ten years I gotta pay that. That means I gotta never stop working. Even when I'm in the hospital I gotta work. $5,000 a month, $600,000. Sir, have you ever seen a $600,000 with a pussy yet? Here's a white guy who's seen that much pussy. I didn't see that much pussy. Goddamn. You need a Mack Truck to hold that much pussy. He just... Hi honey, she's pretty. That's your wife? Good. No, marriage is wonderful. Divorce is not too bad, but that alimony fucks you. There's a big fella there. How much do you weigh pal? How much do you weigh there? About $230? Don't lie, a little bit more. $250, $240. 240 pounds. I'd hate to be around when you farted. Can you imagine a 240 pound fart coming at you? You better have on a wetsuit. See if any of you guys go diving down into the ocean, or just lake, or wherever you go. Rivers. You guys, you ever fart in a wetsuit? Bubbles come right out the neck. Sharks be swimming away from you. There. The Lord fucked up quite a few times, but a lot of people don't do it. But me not being an evangelist, I can say so. Lord certainly fucked up when he created woman. I expected that. Well, I'll prove my points. Lord did fuck up when he created woman. For years, people thought the Lord was Polish. Who else would build a snack bar next to a shit house? It'll come to you later on tonight. Then I wrote a love song. Oh, you'd be surprised. I'd play piano for you now if it hadn't been for the accident. Kids were playing baseball in the yard, and one youngster hit a home run through my bedroom window. It's my wife right here. Like they broke three of my fingers. These three. You hit that home run too many years early, it would have broke my skull. That's why I tell people wherever I go, sit up and try to look pure for your friends. But Jesus knows what your crooked Christian ass has been doing. He sees you in them hotel and motel rooms, laying up their butt-neck at freaking off. He recognizes the back of your head. Knows you're not bobbing vapples. Knows it. I used to preach myself. I found out I was crooked and quit. Actually, I didn't quit because I was crooked. I quit because I got tired of showing those sisters the Holy Ghosts. Amen. Amen. How you feel pal? Yeah, I lose a little hair there, huh? Don't worry about it. Girls don't care. It's not hair. It's what it grows on. They love you. A girl has me with some head years ago. I laugh right in her ass. I thought you were just kidding. She's funny. I must have laughed over her. Like I said, they're ugly, but they tasty. Show me a husband who won't. I'll show you a neighbor who will. Hi, neighbors. No, I ain't kidding you. Who asked me for $100 this afternoon? $100, shit. To fuck? Must think I'm a goddamn idiot. Shit, I'd give me 50 sim worth of cold cream and hit this summit. And I'm not gonna be a fucking idiot. And wake up in the morning satisfied with $99.50. That's right, fellas. Let me tell you, fellas. Don't be ashamed of Jack Off anymore. New world. People don't give a shit. It's yours, beat it. Girls Jack Off too. I in the fuck you think they can say no all the time? They don't need you. I know they. I got a movie called Girls Jack Off also. In color. Beautiful. I know I 30 times last night. I know that stroke. See, ours is different. Hey, Cap. Looks like a guy's on a train with one time. You ever been on a train? You know what I mean? Trainin'? In St. Louis one time we went on a train. We took this girl up in the woods. About a hundred of us. We lined up. I was 75th. See, I got a bad draw out the cap. I was standing there with a beach towel and a sponge and a water hose and a mop. And the girl in the fantastic. See, I'd been 10th before, so I knew what 75th was going to be like. This girl laid down on the grass and opened her legs and all the mosquitoes died. A hornet's nest fell out of an oak tree. Two wild dogs fell out. Oh, God. Years ago girls didn't smell like they do now. I swear to you, they got stuff now. Girls, they got dish powder with different flavors. You've tasted them, fellas. Yeah. Different flavors. My old lady bought some. Tuna. At least I hope it was tuna. All different flavors. Tootie, fruity, macadamia, nut. Anything you like, rice. What the hell did they make? That's another thing I want to bring up. Chinese. Any Chinese here tonight? None? Well, fuck them. One of them could have came to see my fucking show. Chinese, you watch them Chinese. Remember you heard it here. Watch them. It's one billion Chinese. One billion. Must admit you red-blooded Americans. They've out-fucked us. Five to one. What if they sneaked over here and tried to fuck us to death? Let them come, goddammit. I'm a veteran. I take care of my five. Can I have my album, please? Hey, goddammit. Here, though, skipper. Give me a hand, Boat. This is my friend, son. Skipper down. I told you he's got a show, didn't he? This is my lady's album. I made it five years ago. I'm not going to make another one until we sell these. This is a good album, too. It's about love and caring and being together, being close, being physical. Love. Hygiene. That's the important fact. Hygiene. The toughest thing in the world after turning to your mate one night and saying, you got to wash your ass. Shit. Knowing how difficult it is, I set it for you in this album. You got to wash your ass. You folks up there with binoculars? Buy one of these albums and mail it to your home anonymously. Now, if the postman brings two albums, then both of y'all wash your ass. It's a two-way street. Don't be a streamer from the audience, sir. This is not a Murray-Rivin show. If you don't like this show, Bendova will drive you to Dallas. Get one. See, let me explain to you, folks. You can let your armpits go a couple of days, maybe. But not your ass. How could you tell someone, I love you, darling, knowing in your heart you haven't washed your ass? I'm not talking about your whole ass. I'm talking about your ass. Whole. You'd be surprised that pollution can be found in an area the size of a dime. Or a 50 cent piece. Or a silver dollar. Now, you know your ass better than I do. But you got to wash it. Tell me, how could you turn around in bed with your loved one upside down to 69 and haven't washed your ass? To corn of phrase, when you're 60-90, your ass ain't but one inch from your loved one's nose. One inch. Don't do that to someone you love. Wash your ass. You lay there thinking, no one knows. Shit, the nose knows. Another thing that can wreck your love life. And this is for you fellas. Men, stop wearing white shorts. Please, fellas, you got to stop wearing white shorts. You know why? Because every wash day, every pair of your white shorts got a brown smudge in the seat. Your wife don't want that shit. You're driving the little lady crazy. Every wash day, she's down there talking to the washing machine. Rown man, shit in his pants every week. Every week, I got to try and get this shit out his shorts. 49 years old, still shit in his fucking pants. Ring around the collar. Shit, ring around his asshole. Men, stop torturing your lady. Get you some brown polka dot shorts. And let us search for the spot. Or get some flower shorts. Maybe the brown spot will be in a butter cup. But please, never again white shorts. Last but not least, but most important, you couples here, when you get home tonight to your room, the apartments, wherever it is, some of you for the first time since you've been together, wash up before you come to bed. Freshen up. You've been walking. You've been in a cab, walking up the steps, jogging. You've been had two, three meals. Been the toilet a couple of times. You can't get under the covers with that. You got to hit that thing with the washcloth. Let your mate hear you in the toilet with the water running. Then they know you in there knocking that cheese off the alimony. Both of you, come to bed damp. Be damp. Only you gibbons would eat in dry bush country. And fellas, jump in a hot shower and wash them wild hickory nuts. And you're cucumbers. You lucky guys wash your zucchinis. You unlucky guys wipe your jalapenos. That's a pretty girl, yeah. I had a black wife once. Couldn't get breakfast in bed. No, you can't get that in the black home. I came home, I said honey, I worked all night. I get breakfast in bed. I had a black wife once. I said honey, I worked all night. I get breakfast in bed. Motherfucker, what? Breakfast in bed, shit. You must be a goddamn fool. You think I'm gonna get out of the bed? You gonna go somewhere and fix you some breakfast? Nigga, go back to that bed you've been with. That's wrong. See, I tell you, I'm getting divorced, but it was my fault. Really, I tell the truth, publicly, my fault. My old lady caught me in a moot tail in Henderson, Nevada with immediate broad from circus circus. She don't understand English so well, and I tried to explain to her, I was cutting down. I think that's the only thing I hate in the world besides empty pockets, the fucking midget. You come to see me, you'll never see a midget where I'm working, because it's a standing order at the door, no fucking midgets. I never liked them, since I was a kid, when I blew cigars smoking my face. Made me sick three days. Along with that hot dog. Fucking midgets. There was something about them, it just riled me. They come to nightclub where you're working, sit down and swing their feet and kick customers all in a shan. I don't like that. They always look up at you like they want you to help them do something. I was like, get out of my way, you half a motherfucker. You gotta be firm. But don't ever fight a midget. Because if a midget bites you, God damn. Hello. Nice mustache you got there, buddy. Looked like a half of what you call it. I ain't getting you curled all the way around the head there. When you get home, look in the mirror and hold your head sideways like this. I told you. I noticed a lot of people wearing glasses tonight. You folks wearing glasses. Do you ever take time out to think how far ahead nature was planning is to put ears in the right place in case you had to wear glasses? Think about it. If this meat wasn't here, you'd be wearing goggles. Why did you cut this meat off completely and still here? Because the hole is more important than the meat. Would you agree with that? What if our ears had been somewhere else, like back here? Can you imagine what an entertainer had to look at in case the crowd was really listening? One thing, if ears were back here, wouldn't be too much whispering going on. I know I wouldn't have none of that said to no fellas. I might whisper to a girl one night though, say, hey honey, you know what? Your ears smell like shit. I hope no one was offended by my show here tonight. If you were offended and you stayed all the way through it and bug it because you're a dummy. And I want to say this to those who are certain, I'll give a goddamn vote, people don't enjoy me because they're not going to be fans long anyway. Alright then, I'll think about it. Hey, here's that thing. Thank you, I got a little song I want to do for you. This is not going to be in the movie. I love singing that good, but I feel good. This tune is called... Zachale. I know why I've waited. Know why I've been blue. Prayed each night for someone. Exactly like you. Why should we spend money? On a show or two. No one does those love scenes. Exactly like you. You make me feel so grand. I want to hand the world to you. You seem to understand. Each foolish little dream I'm dreaming. Steam, I'm steaming. Now I know why mother. She taught me to be true. She taught me to be true. She meant me for someone. She meant me for someone. She meant me for someone just like you. Thank you, thank you very much, folks. Thank you, thank you. Have a safe trip home. Merry Christmas, have a safe trip. Have a good day. Good night. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you."
}