{
    "url": null,
    "title": "Secret Optimist Steve Hofstetter - Full Special",
    "transcript": " Is there anything different that I need to do for tonight opening wise? Just do your set. Just do your set? You're not nervous? No, I'm excited, but it's a show. There's gonna be like important people there. Who's gonna be here that's gonna be any different? Uh, the Obamas are gonna be here. The Obamas are not coming. Yeah, they are. The Ruth and Judy Obama. I don't think the Obamas will be here. Yeah, they're from Indiana. They'll be here. I think you and I should have taken separate cars. Okay, Mr. Cool. Uh, the Emperor of Hollywood's gonna be here tonight. You're not gonna impress him? I will do what I can to impress the Emperor. Okay, well what bits are you gonna do? I'm gonna tell a story. What story? Ladies and gentlemen, Steve Hostow. Thank you. Thank you. I wanted to tell you the story of how I became an optimist. Now, it started when someone was murdered at my hotel. Don't worry, I'll make it funny. I was doing a gig in Syracuse last summer. And I'm coming back from the late show on a Saturday night. It's about 1.30 in the morning. Now, as I pull up to the hotel, I see there are 52 police cars surrounding the building. There was not a moment in my head where I was like, I bet this works out great in the end. Maybe the police are just having a party. Ain't no party like the police party because the police party don't stop. Because you can't call the police. So... Alright, everybody who's gonna get it got it. So I... I'm stuck outside the hotel. They weren't letting us in. That's how I had time to count all the police cars. And one of the reporters told me that someone had been shot and killed in the room below mine. And they were still looking for the guy. Yeah. Not the one who had been shot and killed. They knew exactly where he was, but the other one had escaped. The murderer got away. The murder was right where they left him. So the cops come out, and one of them says, you go back in now if you want to. And I said, oh, no, thank you. And he asked me why not, which I thought was a pretty odd question. I think it's obvious why I don't want to go into that hotel. I'm gonna open up my door, see some guy in my bed being like, like, I don't want that. So he said, well, you don't have to go in if you don't want to. I said, fine, I'll go in if you come with me. He said, what? I said, yeah, we'll go in together. You, a little bit first. You have a look-see. I'll grab my stuff. I got the fuck out of this hotel. And he said, yes. So I grabbed my stuff, and I got the fuck out of that hotel. Because I'm a man of my word. And I drove as fast as I could, as far as I could. And I only got about 10 miles away before I got stopped by another cop for suspicion of driving drunk. I don't know if you know this, but driving drunk and fleeing from a murder is the same. I don't know if you know that. Now, the guy was a dick immediately, because he had thought he had gotten a collar. He thought I was wasted. He figured he would come up to the car, and I would just be like, spring break! Like, that's what he expected. So he pulled me over, and he was a dick immediately. The first thing he said, he goes, and how was your night going? And he was not prepared for my response. I said, actually, officer, it's been a bad one. As it turns out, someone was murdered at my hotel. He was like, whoa, like he didn't know how to deviate from the script. It was adorable to watch him try to stick to that script. He's like, well, uh, huh, huh. Well, the reason I, huh, huh, huh, huh, huh, huh, the reason I pulled you over, you were speeding and driving erratically. I said, well, I can explain that. As I mentioned earlier, someone was murdered at my hotel. So I'm feeling erratic. Hey, officer, I have some questions. How come you're not at the hotel? What are you doing out here? Why the only cop in upstate New York is not at this hotel right now? Do you not get an invite to the police party? Maybe check your Facebook notifications. Maybe it's under there. Also, how come you didn't ask me if I'm the murderer? I'm driving quickly away from a murder. You're horrible at this. He didn't know how to handle all my sass. He just kept sticking to that script. He's like, so where are you going to in such a hurry? Away from murder. What direction are you headed? What direction are you, the one we're facing? I'm going west? It's the interstate. I'm not banging a U.E. I'm going west? And so are you. Why are you going west? Because we're in upstate New York. That's where the world lives. I'm not going to Vermont. It's two in the morning. Vermont's closed. I'm going to Buffalo. Why are you going to Buffalo? I don't know because I could probably find a place to sleep in Buffalo. It's two in the morning. You don't know where you're sleeping at night? No. I don't know if you recall from earlier. But someone was murdered at my hotel. So I'm going to go now. And he said, okay, let me go. Because he did not write that up. I have not done it yet, but I would really like to review that hotel on Yelp. Well, I want it to be perfect. So here's what I have in my saved drafts. Excellent continental breakfast, too much murder, ample parking. Three stars. I'm not going to give it one star. I've got to be a dick to give something one star. It was just one murder. Two murders give a place one star, but one murder. What about the breakfast? I don't understand people that give one star. One star means nothing worse could have happened. That's what it means. One star. Fuck you, what happened? My fries were cold. Oh no. Your fries were cold. That's the worst possible thing that could happen. What if your fries were cold and I put my dick in your fries? What then? Leave yourself room for fewer stars. It's not a tie. Sometimes people will do that on YouTube. I don't mean they'll put their dicks in somebody's fries. Although probably, they're an awful lot of channels, but I don't subscribe. My point is, sometimes people will review something negatively to make themselves feel better. Why didn't you like this video? Okay. Here's what I do when I don't like a video. I'm a weirdo. Here's what I do. I watch a different one. What the fuck is wrong with you? You gotta write that out. Just click thumbs down and move on with your life. If you have to warn the rest of us, just click thumbs down and move on. I didn't like this video. The only reason you have to write that out is because you want that tied to your username. So you can show your asshole friends that you shit on a stranger. Feel better about your small life. Why do you have to be so rude? I didn't like this video. Do anything like that? Fuck you. You're a bad person. Don't act like that. I didn't like this free piece of art. I had no obligation to watch. Watch something else. You're a bad decision maker. That shit's on you. What's wrong with you? You gotta tell everybody everything? You just walk by a restaurant, poke your head in. I'm not eating here. Well, you're a vegan and this is a KFC, so... Move along. Someone tweeted they don't like one of my videos. I looked at their Twitter to see who they were. They had one follower. I was like, hey man, you didn't need to tweet that. You could have just told someone. Why would you waste your time tweeting anything with one follower? Why do you have a Twitter account with one follower? How about you tell two people, expand your base, get the word out, you know? Tell your parents, that's two people, just call your parents. Just call them. You live with them, just yell up the stairs. Just yell up the stairs. One follower. That means even the spam robots are like, no thank you. Like, you know how sad that is? But I enjoy Twitter a great deal. I love Twitter. You can learn from Twitter. When something's trending and I don't know why, I will click on it to learn what the rest of the world is talking about. I saw that Leviticus was trending. And I was like, why would Leviticus be trending? Then I thought, oh, maybe Jay-Z has a new baby. So I click on it. It was something else entirely. The reason Leviticus was trending was because there was a religious group, they were using a quote from Leviticus to persecute gay people. There's a quote that says, They were using that to say that being gay was an abomination. And I thought, no, you read that wrong. That's not a prohibition. That's basic sex advice. Think it through. Thou shalt not lie with a man the way one would lie with a woman. Yeah, they got different parts. Flip him over. It's simple. That's what that means. Before Leviticus, two dudes were just banging dicks. And then God was like, whoa, whoa, whoa, whoa, whoa. Thou shalt not lie with a man the way one would lie with a woman. And they were like, good looking out, God. And then Leviticus was the first issue of Cosmo. Now, most of you enjoyed that. A few of you didn't because you're prejudiced. But my point is that you can learn from Twitter. My favorite thing on Twitter right now are the redneck boycotts. Rednecks have been all over Twitter in the last year. I think it's because they just got the internet. They're like, real excited about it, you know? And anytime anything progressive happens, there will be a fake redneck boycott. Now, what I mean by this is so Trump banned immigrants. And then Starbucks came out and they said, hey, we're going to hire 10,000 refugees. All these xenophobic rednecks went on Twitter. We're not going to drink Starbucks anymore. And I was like, when the fuck did you drink Starbucks? And if you did, didn't you stop when they had a red cup? What are you talking about? And then one of the actors in Hamilton had some words for Mike Pence during a performance. All these blindly patriotic rednecks went on Twitter. They were like, we're not going to go see Hamilton anymore. And I was like, how the fuck did you get Hamilton tickets? What are you talking about? You can't boycott something you don't use? We're not going to drink Starbucks. We're not going to go see Hamilton. We're going to boycott next. Portland, Oregon, shut up. You don't use these things. The one boycott that could have worked was the Budweiser boycott. During the Super Bowl, Budweiser had an ad. And the point of the ad was Budweiser saying, hey, you know our company was found about immigrants, like most things in this country. So maybe take a step back for a second and consider the ramifications of your actions. All these rednecks went on Twitter. They were like, we're not going to drink Budweiser anymore. And I was like, yes you are. What are you talking about? No one chooses to drink Budweiser. That's not a choice. You're born that way. Look, we live in a very tolerant time right now. We accept you for who you are. Whatever an adult does in the privacy of their own inner tube is up to them. I think that's in Leviticus somewhere. I know, Jay-Z's baby? Yeah, Jay-Z's baby. But Budweiser was spelled wrong in the hashtag. That's true. That's real. Yeah. The word Budweiser is spelled B-U-D-W-E-I-S-E-R, but they spelled it W-I-S-E-R, like the word wiser, particularly ironic. Like how do you misspell your own political movement? How's that even possible? You guys remember that famous speech from Martin Luther King, right? I have a dram. You guys remember that, right? I'm scrolling through these tweets and I'm like, how dumb are these people? And I saw one, I was like, oh, that dumb. Because there was a tweet that said, we need to support a real American beer, like Heineken. I was like, huh. Oh, no. Why does your vote count the same as mine? That doesn't sound fair. I feel like maybe Rednecks' votes should count like a little bit less. Not a lot less, just maybe like three-fifths, you know? But the problem with Twitter, the problem with Facebook, the problem with any social media is us. Because we argue when someone's crazy, and we shouldn't. Stop paying attention to crazy. Let crazy shout into silence and crazy will go away. In the world, we're not going to be able to do anything about it. We're going to be able to do anything about it. We're going to be able to do anything about it. Let crazy shout into silence and crazy will go away. In the real world, we do that. In the real world, we ignore it. If someone were out there in a street corner right now, yelling out, I'm the Roman Emperor, you would just cross the street. But on Facebook, you're like, here are all the reasons why you're not the Roman Emperor. Like, why would you talk to that person? There should be a cross the street button on Facebook. Wouldn't that be sweet? Someone post something stupid, be like, 31 people cross the street at this post. Alright, dial back the crazy. Try not to argue with people. Sometimes you can't help it though. Sometimes the situation comes to you. The first time I was ever pulled over by a cop, I got a ticket for unsafe lane change. Now, I didn't know that was a thing. If you're unfamiliar, here's what it means. It means you're driving the speed limit, then you put your turn signal on, then you carefully change lanes, and there's a cop in that lane trying to speed by you, he gives you a ticket. That's what it means. Well, I prevented an officer of the law from breaking the law, and that is against the law. So, it was how he gave me the ticket though that stayed with me, because the first thing he said, he didn't say, you know, if fast you were going, you were driving recklessly, he didn't even say, how was your night going? He didn't say any of that. He just looks at me and he goes, well, thanks for making my stuff fly everywhere. Thanks for making my stuff. I'm sorry, officer unorganized, but what stuff did you have to fly ever, were you playing jenget in your passenger seat? What happened before I got here? How do you drive? Did all the books come off your bookshelf? How do you drive? Maybe he keeps a handgun on the dashboard. He just keeps his handgun on the dash, he slams the brakes, handgun flies to the windshield, accidentally shoots a black man, he's like, no, don't believe this, like, is that how it went down? I know, I was offended too, and... I gave him my license. I figured it was all I could do, because there wasn't a moment in my head where I was like, this is going to work out great in the end. So I gave him my license, I figured he would look me up, he would find out, well, he would try to look me up. His computer could be anywhere, but he would do his best to find it. Sift through the rubble, rebuild, then he would look me up. He'd find out I have a good record, he'd come back with a warning. That'd be the end of it. But that wasn't the end of it. Because he came back with a ticket in under two minutes. Under two minutes, have you ever been pulled by a cop? Take some longer than 15 minutes just to walk to the car, doesn't it? Because they're messing with your head. They're trying to ice the kicker, that's what they're doing. They're trying to make sure you're so frazzled by the time they finally get to the car, you're like, ah, cocaine to the glove box, like that's what they want. I was mad, I was like, why are you giving me this ticket? He said, well, if I would have hit you, would have been your fault. I said, no, you hit me, that sounds a lot like your fault. He said, yeah, but you took the lane, so it's your fault. I said, okay, pretend time. If we're gonna do this, at least let's do this correctly. Whether or not I took the lane as a material, because we're in California right now, which is a one-party estate, that means that the person at the back of any accident is responsible for the entire accident. He said, I don't think that's how it works. I said, well, I am not a police officer. But aren't you a police officer? So, hey, do you think we should ask you? So I just kept asking him questions, that's what I did. I asked him question after question after question after question, because he was mad that I slowed him down. Fuck that guy, I asked him 27 minutes worth of questions, that's right, yeah. I detained a police officer, that's what I did. This happened in Laverne, California. The guy's name was Officer Alvarez. I do not have a joke about his name, I just think that you should know it, because he's a prick. So, Officer Alvarez from the Laverne Police Department, I'm gonna say it a third time. Officer Alvarez from the Laverne Police Department, I'm gonna tell that joke every day this year, that's right, yeah. Yeah, this happened last March, fuck that guy, here's why I do this. Because one of you will help me get my revenge. I don't know who it'll be, could be someone watching this tonight. You'll be driving through Laverne, it'll be months from now. You'll have forgotten about this show, you won't even know that you're in Laverne, because no one goes there on purpose. You pass through on your way to somewhere decent. And then you'll get pulled over, because you'll have just done something legal. So, you'll get pulled over. And tonight we'll come flooding back to you. And you will see that it says Alvarez. And you'll say, I've heard a great deal about you. And I will have won. Because I don't like when people in positions of power get into those positions just to abuse the power of that position. But, thanks to people, but... Cops are not the worst at this, they're not. Flight attendants. They're the fucking worst. Because they lie to us, the first thing they say, your safety is our number one concern. No it's not, no it's not. Our money is your number one concern. If you cared anything for my safety, why sit in front of me made of hard plastic seven inches from my nose? Why is that, huh? You think that's safe, pilot pumps the brakes, like, like you think that's safe? Pumps the brake? What the fuck am I talking about, pumps the brake? Is that how it works up there? Another plane just tailgating behind, like, go around. I'm picking someone up, go around. You didn't see my flashers? I don't even know if there are brakes on a plane. Oh, brakes on a plane, scary movie, anyway, so... Get these motherfucking brakes off my motherfucking plane. So I try to avoid talking to the flight attendants when I fly. I try to avoid talking to anyone when I fly. Because we are the worst version of ourselves. The second we get to an airport, I don't know what Lord of the Fly shit happens. But we're just like, fuck society, this is my day. Like, I was flying in Japan. And I was happy in an airport for the first time. I'm never happy in an airport. Because we really are the worst versions of ourselves. There's always someone on the flight with a shrieking baby who doesn't care that they've brought the most hackneyed, cliche thing you could possibly wear on a plane, like, oh, they're so temperamental when they're this age. I'm like, yeah, I'm still temperamental. I'm gonna kill that baby. Oh, he's gotta learn to cry himself out. Oh, he died. Not today. He's gotta learn to shut the fuck up today. This is a teachable moment. Now, I am not saying if you have a kid, you cannot fly with your kid. Obviously, if you have a kid and you have to fly, you have to fly with your kid. What I am saying is make an effort. That is what I ask of you. Just make an effort. There are so many laws in the sky. How come try isn't one of them? Fail all you want, but I want to see you try. I don't want the flight attendant to help. I want them to just walk right up and be like, hey, can you just set that baby to airplane mode? You know, I'd be happy to check it to your final destination if that'll help. That'll never happen. That's my sick dream, but it'll never happen. I just want to show up at baggage claim once. Just one day, see a bunch of... just a conveyor belt with a bunch of babies going around and around and around. Some confused dad being like, don't just take one. A lot of them look the same. You can't just take one. It's a terrifying announcement. Don't just take a bag. A lot of them look the same. I have flown thousands of times. I've never taken someone else's bag. Here's my trick. Here's my trick. I'm not fucking dumb. Yeah. That's the trick. Yeah, I get off the plane that I'm not a dumb guy, that I get my bag, that I'm still not a dumb guy. It's a four-step process. And if you have taken someone else's bag and you feel bad about yourself right now, good, let the pain be a lesson, because I want better for you. How do you screw that up? Your name's on your back. I don't even mean the bag tag that you should be smart enough as an adult to put on your bag. I mean the one that every airline anywhere affixes to your bag, that white sticker with your name, your origin, your destination. Why does your bag know more about you than you know about your bag? How did that happen? Just step off the plane. I thought I was Scott, but I guess I'm Brian today. I hope Brian has better stuff than Scott did. All Scott stuff is used. Also, your bag looks like your bag. I think that should be the biggest clue that your bag is your bag. It's the one you were touching four fucking hours ago. How long is your flight that you plum forgot what your bag looked like? You're not going around the world in 80 days, Jules Verne, you're going to Dallas, pick up your fucking bag. There's no one in cargo furiously painting all the bags. Like, no, it looks like, how bad are you at life? Are you getting to anyone's car? Are you my wife? I don't know things. I don't know things. Time to start a new life with my new stuff. I hope it's better than my old stuff. Don't hit the brake. My stuff will fly everywhere. And then there's always someone taking up half of my seat. Why is that okay? We shouldn't have to be okay with that. I bought a seat. I'd like that whole seat. There's never been a box to check off that says donate half my seat to charity. I bought a seat. I want a seat. But I don't want to have to pay for two seats. Okay. I didn't want to have to pay for one seat. But I did not fit in no seats. So what am I to do? I had to upgrade to the one. Because they don't sell these in half seat increments. Maybe they should. We could start like an app. We could start an app. Where like two people go buy three seats on one flight. Yeah, it'd be called can'tfitinacayac.com. Most of you were with me. Some of you didn't laugh. Some of you didn't laugh. Some of you were distracted trying to figure out whether or not you can make the app. But others looked at me stone faced. Judging me. How dare you sir? You're skinny. You can't make jokes about that people. How dare you? How dare you? You don't know me. You've known me for a half hour. You think you know what I've always looked like because I look like this right now? I used to weigh over 300 pounds. Yeah, I topped out at 308 in high school was very difficult for me. And one day I decided to do something about it. And I started running and that became my thing. And I ran every day. I ran every day for 15 fucking years so that I could look like this. None of that's true. That's what I do. But if you change your mind about me, you're a hypocrite, you should know that about yourself. You shouldn't ever let someone excuse a joke just because they're part of who they're making fun of. Some comedians will try to do that. A bad joke is a bad joke no matter who tells it. An offensive joke is an offensive joke no matter who tells it. I was working with a Chinese comic once. It came off stage and he asked me. He was like, what do you think of my set? I said, I think he came off as kind of racist. He said, I can't be racist, I'm Chinese. I said, first of all, that's kind of racist. Second of all, more importantly, you did a joke about how all Asian people can't drive. That's a racist joke. He said, well, I could say that I'm Chinese. So what? You're not all Asian people. You're one Chinese guy. You're only one more Chinese guy than I am. I am two Chinese guys away from being more Chinese guys than you are. And statistically speaking, two is not a large number of Chinese guys. And that is a joke about global population. My point is that we pay for what we use. We're adults. That is the social contract. You use two seats, you pay for two seats. I am six foot four. I pay extra for the exit row because I need that leg room. If I were eight foot four, do you think I would not buy the seat in front of me? Do you think I would just let my leg dangle over your seat? Just kick you in the face at the back of my shoe? Don't oppress me, I'm big boned. And that'd be true because tall people have big bones because that's how bones work. What's this big bones garb? You're not big boned, you're big near the bones. The bones are the same size. No one's going to the gym to work off their bones, okay? Oh, it's glutes, lats, and bone day at the gym. Bone day is the hardest day at the gym. Don't skip bone day. So my point is, I was going to Japan. And I was happy in the airport for the first time. But my happiness got derailed. Because as I'm walking through LAX, I see a woman with a dog just shitting in the airport. The dog was shitting, we're on the same page. I don't know how your imaginations work, but I don't want anyone to just picture a woman holding a dog. The woman was on the phone, that was the problem. She was on FaceTime ignoring the dog. You can't control what your dog does, but you also can't ignore your dog in a public place. So this woman is ignoring the dog, she's on the phone, and someone sees this and says, hey miss, your dog, the woman looks away from her phone, looks at the guy, looks back at her phone and says, some people are so rude. I know, we're like, oh this woman dies today, you know, this is exciting. But she starts to walk away. Yeah, she just leaves. Someone else tries to intercept her and says, miss, you can't just leave that there, you have to clean up after yourself. And she says, oh, they have people for that. You ever say that about cleaning up after yourself, they have people for that? We should all fuck you up, because they got doctors. So... I am now left guarding the shit. That's my new job, I'm guarding the shit. It wasn't in the itinerary that Delta sent me, but that's my new job. So I'm guarding the shit, because if I walk away, I'm part of the story. I saw it happen, I can't just leave that there. Because if I walk away, someone's going to wheel their bag right into it. Because you don't expect to see that, you don't walk through an airport being like, hope there's no dog shit on the ground, like no. You walk through an airport just going, send a bun, like that's all you do. So I'm guarding the shit, maintenance comes over, they clean it up, and I thought, okay, now I can go to my gate, now I can go to Japan, now I can be happy, almost optimistic, but I couldn't be happy yet, because this woman was at my gate. She was also going to Tokyo, and she has now done something even worse than what she had already done. What could possibly be worse than leaving your dog shit on the floor without cleaning it up? Something some of you have done before. She was listening to music in a public space with no headphones on. Don't ever do that, don't ever fucking do that! We don't need you to be her airport DJ, they're playing smooth jazz, they got us covered, okay? How inconsiderate of a human being does she have to be? I just picture her car parked diagonally across three spaces, with paint on the bumper from the tricycle she hit, you know, just a total dick. Now most people are avoiding her, because she's loud and obnoxious, but I decide to sit down next to Cruella, and have a little bit of fun. I say, are you going to London on business? To what she says, I'm going to Tokyo, to which I say, oh, no, that flight's moved to gate 53C, this is the flight to London. Now that's fun for a lot of reasons. The main one is I want to give her that little bit of panic. You know that self-doubt I'm talking about, that moment in your life? Like every time I've ever checked into a hotel, it takes them one extra second to find Hoffsdetter, I'm like, is this hotel even real? You know, with that panic. That's all I wanted for her. I figured it would last maybe a couple of seconds. She would get up, she would check the monitor, see it still said Japan, she would look at the gate agent, the gate agent would say yes, this is the flight to Japan. She would look around the gate, and see that everyone except for me was Japanese, like why did she not notice that? Why am I there? What does she think I'm their teacher? What am I doing there? All this redhead's taking all these Japanese people to London, this is a weird day. He's only one Japanese person away from being Japanese. But she doesn't do any of that. She just gets up and leaves, just walks away, doesn't even thank me, which I thought was rude, but just leaves. I know, some people are so rude. She just leaves. So I got up, and I boarded the plane, and then, I don't know what the fuck happened. How could I know? I was in Japan, I have no idea what happened in Los Angeles. I know that I was happy. I know a few more details of this story. I know that she was not on my plane. Now I know that, because I was sitting toward the front. If she had walked by me, I'd have noticed her. But more importantly, we were delayed by about 20 minutes. Now if you don't fly much, you might think that's the plane waiting for her. That's adorable. Planes don't wait for people. This isn't a carpool, we're going to Japan, and we are fucking leaving. However, if you check a bag, and then you miss your flight, for safety reasons, they have to take the time to take the bag off. And that process, takes about 20 minutes. So I'm just laughing. I'm losing my mind. Everyone else is upset, everyone else is on the plane like, why are we on the tarmac for so long? I'm like, you have no idea what I just did for you, you have no idea! I'm not the hero you deserve, but I'm the one you need. I know two more details. I know LAX very well. So well, that I know that there is no Gate 53C. That was an extra middle finger on the fuck you sandwich. For free. I also know that Delta only has one flight from Los Angeles to Tokyo per day. The one that I was on. Now it is possible that they rebooked her on to another airline, that is possible. I hope it was United and they beat the fuck out of her, I hope so. Because they have people for that. I have this thing that makes it difficult for me to fly. I have this condition where I don't like people. Some of you know what I'm talking about, some of you, you meet more people, you get it. You ever meet somebody's shitheads in a row, you get introduced to someone new, you're like, this will probably suck. So I just hang out with my dog, that's what I do. I just hang out with my dog, he's the best. He's a Staffordshire Bull Terrier named Walter Mathow, he's awesome. Yeah, if you're unfamiliar with Stathi as a breed, it's like a pit bull face on a pig's body. Yeah, he's a potato with feet, he's the best. And sometimes people are afraid of pit bulls because they're illiterate. Well, if you know anything about dogs, you know you're more likely to get bit by a small dog than a big dog. Anybody who has a small dog knows that. Anybody who has a small friend also knows that. But people will make that inane argument. Well, if it did bite you, wouldn't it hurt more because it's bigger? Yeah, probably. But we don't ban big people, they could hurt us more. I look this up, the Netherlands' tallest country. People on average in the Netherlands are a foot taller than some other countries, and no one has ever said, don't go to the Netherlands. What if one snapped? They're nice people. Now, I can't always bring Walter on the road with me. I tried to, but there are some places that have breed-specific legislation. Now, if you're unfamiliar with BSL, here's what it means. It means the county will get together and based on minutes of research. That's comedic exaggeration. They don't do any research. On feeling in the face of statistics, they will ban a breed of dog, decide it's too dangerous. They'll ban a breed of dog to protect people. And then if you go through that place with that breed, they can impound him and put him down that day with no due process. Which is strange to me, because those same places don't seem to care about gun control. That's confusing. I guess it makes a little bit of sense. I mean, maybe one day, some of them get real drunk and accidentally fire off their pit bull. Now, for the gun owners in the crowd, and this is Indiana, so away we go. For the gun owners in the crowd, I have a point to make. No one's coming for your guns. You sound dumb when you speak like that. They're taking our guns. No. No one's taking your guns. We want you to register your guns. Like you register anything potentially dangerous. You register your car with no issue. When you're at the DMV, you're like, they're taking our cars. What did you just say? Yeah, first we get driver's license, then next you know, we're walking everywhere. It's a slippery slope. It's a slippery slope. No, sometimes it's flat land, and... I'm sure that there are gun owners in this crowd right now who are getting uncomfortable. You're getting upset about this material, but every single gun owner here knows someone who owns a gun that you wish didn't. Every last one of you has been at a firing range and been like, grads here? We're all gonna fucking die. Every single one of you. That's who I don't want to have a gun. Now you might say, well, it doesn't matter what you want, because of the amendment. Second amendment protects them as a right and not a privilege, and I'll give you that. I'll give you the second amendment. Defend the second amendment with all of your heart. If you also defend every other amendment, or know what they say. Amendment people are hilarious. Freedom of speech, right to bear arms. I'm tired. What about the rest? There are so many. Like the seventh amendment. No one ever cares about the seventh amendment. Why doesn't anyone ever defend the seventh amendment? None of you even know what it says. Some of you are trying to think of it right now. You're like, is it plead the fifth? No, that's the fifth amendment. The seventh... The seventh amendment says that every civil matter involving more than $20 can go to full jury trial. Or maybe it doesn't. You don't fucking know. My point is, either amendments are sacred or they're not. It's as simple as that. And if you're someone who feels you need to own a gun because you want to protect yourself from your neighbor. Okay, I support that. I do. I think that the second amendment is important. I think that a person who is educated and responsible and regulated should be allowed to own a gun. However, if you need a gun because you're afraid of the government, you don't know how tanks work. What is your plan? When the tanks come rolling down the street, you'll be like, we've prepared for this. Dink. I do not think we've prepared for this. They have invisible planes. Are you just going to shoot the sky until you hit Wonder Woman? Like, what is your plan? My point is, I love my dog. And they are coming for our dogs. I was never a dog person. I was never a dog person until I went on a date with a really hot girl and she was like, I love dogs. And I was like, you're hot, me too. And that's Darwinism. So now I have a dog. And I love them very much. And I've become an advocate in the rescue community. And I'm learning a great deal about dogs. My friends are trying to educate me, make me a better part of that community. One of my friends sent me a story that said there was a dog acting weird. And they figured out that their house was on fire just because the dog was acting weird. He sends me another story that says there was a dog acting weird. And they figured out that their kid had autism because the dog was acting weird. He sends me these stories that are like, aren't these stories incredible? I said, no. These are the worst stories I've ever heard. Sometimes my dog acts weird. Now I need to figure out what the fuck is wrong. You know, terrifying that knowledge is every time my dog goes in a circle one too many times after... Do I have epilepsy? Or did I leave the stove on or my dog ate a grape? What happened? By the way, if you ever figure out that your child has autism because your dog acts weird, please pay more attention to your family. I think that's solid advice that I'm using your dog as the check engine light of your household. I had one dog that was a weirdo. He was part Dalmatian and part Chihuahua. I know, that means something terrible happened. That's not romantic. What do you think that was Romeo and Juliet? I love is forbidden because it's physically impossible. Like, no. A Dalmatian took down a Dalmatian. I know that's not romantic. I know that's not romantic. I know that's not romantic. I know that's not romantic. A Dalmatian took down a Chihuahua. You get that, right? Or... The most badass Chihuahua of all time. Climbed aboard, picked a spot and went to town. My point is, he shouldn't even exist but I love my little rape baby. I love him so much. It's not his fault. His dad was an asshole but it's not his fault. Now because I love dogs, because I have one, my cousin is convinced that that means I'm going to have kids. Like it's a gateway drug. I think it's because parents will do anything to convince the rest of us to become you. When are you going to have a kid become one of us? When are you going to have a kid become one of us? We don't do that to you. You are the shittiest cult. At least Jehovah's Witnesses knock on the door before they start with their shit. But when are you going to have a kid become one of us? When are you going to have a kid become one of us? We don't do that to you. We're not like, when are you going to murder your kids? Become one of us. But you don't know true joy until you have children. You think you do but you don't. You don't know true joy. You think you do. You don't. You don't know true joy. You don't know. I sleep till noon. That's not true joy. You're sleep deprived. That's delirium. But who's going to take care of you when you get older if you don't have any children? It costs a quarter of a million dollars to raise a child. So instead of having two kids, I'm going to have half a million dollars. And then I'm going to use that money to hire your kids to take care of me. They won't have any time left to take care of you because you didn't plan. My cousin will call me up, brag about his son without ever considering my feelings. Say things like, oh today James said the funniest thing. Really? The funniest thing. I'm a professional comedian. What the fuck did James say? Oh he pronounced a word wrong. He's not funny. He's behind in school. You should help James. Instead of mocking your child, he said nothing funny. I said something funny about James. Fuck James. He's eight. Please don't fuck James. Don't fuck James. My cousin is such a nag. He says things like, oh you have a dog. You're just practicing for children. And I say, you're a bad parent. You know the difference between dogs and kids? That's day one. For the parents in the crowd, I don't mean to get conky. I know I've never had children, but I feel like I would know the difference. I know you don't truly know until you go through the experience yourself, but I feel like they would hand me my baby and I would be like, not a dog! And then, Hakuna Matata. It would be beautiful. It's obvious to anyone who has ever met at least one of each of those things, that dogs and kids are very different. It's clear. Dogs and kids are incredibly different. Dogs are way smarter than kids. It's obvious. Oh, I have proof. I have proof. I own a home and all my electrical outlets are uncovered. They're just open to the public. My dog's never in the room like, he's never done that, because he's good at being alive. But a child, your child, will put their finger in an outlet, get shocked and be like, let me go find a fork. Like, it's insane! And how bad kids are at basic survival. You don't believe me? Put a plastic bag next to one for 15 seconds. I never said walk away. Stick close. You'll be needed in a moment. No child has ever had the smart thought. No kid anywhere has ever looked at that bag and said, I could put my things in that bag. Carry them from room to room. Make my life a little more convenient. No. Every kid, no matter where they're from in the world, is that same dome. Space helmet! Like every single kid. Even if their country has no space program. Like, I don't know how they know. But they know. If you're a parent, you know I'm right. You don't want me to be, but you know I am. You just follow your child around, just going, don't die, don't die, don't die, don't die, don't die. Because you can fuck it up emotionally, but you can't let it die. That's the rule, right? You can't, because if you kill someone, you're a monster. But if you raise a murderer, you did your best. Like why? Aren't you part of that? You taught a murderer how to walk. That's the first part of murdering. Kids will do anything potentially fatal. Anything. If there was an after school program where children could sign up for fatal activities, it would be full immediately. And then empty, like a week later. Because they're efficient. And if you still don't believe me that dogs are smarter than kids, answer this. Why has there never been a seeing eye kid? That's a fair question. There's a lot of blind people, there's a ton of kids, and no one has ever thought, maybe these two together, no one's ever made that mistake. Because if you had a seeing eye kid, you know what else you would have? Dead blind man, that's what you'd have, yeah. Then a child playing in the middle of traffic next to a corpse as cars whizz by its dumb face. Because it doesn't know it's in danger, and at some point kids do become smarter than dogs. I don't know what age it is, I think it's like 27, 28. I don't know when it happens. Now there are probably some 25 year olds in this crowd who are offended by that joke. But there are definitely some 25 year olds in this crowd who did not get that joke. And my point is, if you have a young child at home, you have to get a babysitter just to join us tonight. That's right, you have to hire another child to watch your child. In some kind of Russian nesting doll of irresponsibility. Why would you ever trust a 15 year old with a baby? I wouldn't trust a 15 year old with a shared cell phone plan. Why would you give it a baby? Because you have no choice. If you don't hire a babysitter, you're stuck at home for 10 years. A decade of house arrest. You have to spend more on your babysitter than you do on going out. Meanwhile, my dog is home alone right now. I don't give a shit. You know how great that is? I'm here, my dog's like, I got this, I'm four. I've already figured this whole thing out. I'll never lie to you on my stand-up. My dog is not four, he's 13. Which means he's only known how to take care of himself for 13 years. But my point is, I don't like talking to people on planes. So, I try to sleep through every flight. That is my goal. I bring a real pillow with me, like a bedroom pillow. And I was flying back home to LA to do a show. And I put the pillow next to me, I put my head down, and the flight attendant comes racing over. And she says, you can't have a pillow in the exit row. And I said, but I do. It appears we're an impasse. She said, well, what happens if we crash? I said, it'll help. I don't know if you've heard much about pillows, but they're fantastic. They're soft, they float, those are two characteristics I would want to bring something to a plane crash. I'd want them to have those characters. If I could bring anything in the world to a plane crash, I would bring a pillow and a second plane. Those would be the two things I would need. She said, no, what if we crash and the pillow falls and someone has to get by it? What will you do? I said, oh, well, in that case, I'll let them step on my pillow because I'm not a monster. You'd have to be for someone to be on fire, screaming. And I would just say, can you please watch the pillow? Yeah, I get it. Burning alive, whatever. That cost me $8. I don't even be there to say that. I'm in the exit row. I'm the first one to fuck off the plane. But she keeps at it. She says, no, what if the pillow slows them down? What if a pillow slows someone down during a plane crash? It's their time. Yeah. I believe Darwin was a smart guy, big fan, and I don't think we need that person. I think we get rid of the length, strength, and the chain because what is that person going to do for us? They're just going to die tomorrow on some final destination shit. Like, why do we need... If you can't get by a pillow in a plane crash, you'd be like, I have to get out of... Ha! Ha! Think, Jerry, think. Ha! We didn't lose a doctor when that happened, okay? We lost Officer Alvarez from the Laverne Police Department. That's what we lost. But she keeps it up. She says, no, what if the pillow obscures their path? What if the pillow obscures their path? I think you mean obstructs their path. I understand the words, obscures and obstructs. They start the same, but they get real different. And I don't want you mixing up words because your job is to protect us in case of an emergency. You're in charge of our safety. As I recall, it is your number one concern. And I don't want you fucking up when there's a problem. I don't want to hear, everybody head toward the explosion. I mean exit. Ha ha! I don't want that. But let's explore what you did me. What if a pillow obscures someone's view of their path or obstructs their path? Now how hilariously tiny are the people on this airplane? That a pillow is going to get in anyone's way ever. I've never seen a movie that gets to the end of a tunnel. Turn back, it's a pillow! I've never seen that. Dude on the other end of the aisle for me was so big he could Kool-Aid man his way out of the plane, which was particularly funny because he was wearing all red, but nobody laughed. So she just kept at it. And she said, you're going to have to give me that pillow. And I said, you're going to have to give me a good reason. And then she said the strangest thing I've heard in my whole life. She said crazy things can happen during a plane crash. A paper cut could decapitate someone during a plane crash. What? A paper cut could decapitate someone during a plane crash. Those words in that order on purpose. What else is ping-ponging around her head like, I like peanut butter, do you swim? Like what else is up there? But that's what she landed on. A paper cut could decapitate somebody in a plane crash. And I said, that's not a thing. Because I was out of clever. I had no response. I'm a pretty quick guy. The chamber was empty. Well, conversation is a two-way street. I say something that leads you to say something peripherally related to what I just said. That's not what happened that day. Because all I said was, you're going to have to give me a good reason. I didn't say, hey, something that will fuck me up for 10 years. I didn't say that. But that's what she heard. And she said a paper cut could decapitate somebody in a plane crash. And I wish I had thought about it. I would have said something smarter. I wish I had time to think about it. I said, no. No. I will not accept the premise that paper could decapitate somebody in a plane crash. So I accept the premise that paper at the exact right velocity, at the exact right angle, could sever a vein, you could bleed out, but paper is not going through bone. Paper is not going through bone. If it could, paper axis would finally fucking make sense. But it doesn't. And it never will. And that's why we even talked about paper. We were talking about pillows and a secondo. There's paper everywhere in this airplane. There's a Do-Koo in front of me. There's a Sky Mall in front of me. There is a dude in 7B, the USA Today. It's going to decapitate every last one of us. Your safety instructions are written on a piece of paper. And those are your number one concern. But I did not have all that. So I just said, that's not a thing. But the crazy train had a second stop to make. She said, well, you don't know. You've never been in a plane crash. And I said, well, you're talking to me, so you haven't either. I'm assuming, I'm assuming she's not the sole survivor for crash. We never heard of just a great paper got crashed of 2004. And we never heard of it because it wasn't in the news. Oh, they tried to interview her. They did. They went right to her house. They said, we have a few questions for you. She said, who are you? I said, I'm a plane crash. I said, I'm a plane crash. They knew they said, we're with the paper. She said, I'm afraid of paper. They never got the story. And now she goes to work every day. So we're out on the mountain of Skymalls and Sudoku's. And she perseveres even though she has PTSD, which is very serious, paper traumatic stress disorder. It's incredibly serious. It makes opening letters very difficult for her, but she perseveres because she's an American hero. Or, she is a nutball on a powered trip. Likely that one. So I gave her the pillow. I just wanted to be over. There's no arguing with unearned authority. So I gave her the pillow and it was over. I put my sleep mask on and it was over. For about three seconds. Because I put my sleep mask on and she shook me, which is assault, but she shook me. And she said, you're going to have to give me that sleep mask. And I lost my shit. Are you kidding me? I was like, are people going to have a problem getting by this also? It's caught in a rubber band, going to kill everybody in the airplane. So what happens if we crash, you have to take it off. What do I do? I said, I'll take it off. It's not locked. It's not a magic trick. What are you talking about? I'll just take it. It's caught in a rubber band, going to kill everybody in the airplane. So anything that slows you down could kill you. I said, why would you put us all in seat belts, huh? You're going to tie us down to your death trap. Is that your plan? She said, well, what happens if we crash and you're asleep? What will you do? You're not sleeping through a plane crash. What kind of a narcoleptic family do you have that you think I could sleep through a plane crash? I'm going to round me up on fire screaming and I'm like, five more minutes, mommy, do you think that's a possibility? And if we do crash and I am asleep, can you just not wake me? Who wakes someone up to die? Hey. Sleepy. Sleepy head. You almost missed this. Yeah, you were going to die without knowing. We wanted to make sure that you died with fear in your heart. We understand that you have a choice when it comes to air travel. We'd like to thank you for flying United. So I finally get home. I'm driving to the gig. There's a guy in front of me about to make the last left turn before I get there and he's not turning left. You ever get caught behind somebody like that? Who's like, how do I do this? What's next? Why am I in Brian's car? Who are my parishes? I have no idea what they're doing. And I don't mean like he's looking down at his phone not paying attention like an adult. He's straight ahead like a cycle path just not moving. The reason that happens is because we give people driver's licenses when they're 16 and we don't road test them again for decades. That doesn't sound safe. Why are we okay with that? Just give someone a driver's license? Oh, thank you. No. Do I have to road test ever again? No, you got this. What if the laws change? Rendering everything I know useless. You got this. What if technology changes? Rendering everything everyone knows useless. You got this. What if I renew my license by mail for 50 years? Don't ever get behind the wheel of a car again. Is it still legal to drive? Can't possibly be legal to drive, right? No. You got this. I don't remember anything I learned when I was 16. Do you? If you had a trigonometry to start your car, how many of us would take the bus? And that's who I was behind. Because this guy's not taking a left. There's a space he doesn't go. The light turns yellow, he doesn't go. The light turns red, he doesn't go. Finally, there's a beat and then he goes. Now I'm stuck in the middle of an intersection on a red light in Los Angeles. I have a decision to make. Two choices. Either stay in the middle of an intersection or take a left on red. Which would you do? Left on red. I agree with you. I agree with you. The cop who saw this, she did not agree with you. And so, she was not even helpful to have you there. I argue my case. But she was right to pull me over. She only saw me break the law. She didn't see the guy in front of me. So she comes over the car. There was a moment in my head where I thought, this is probably going to work out great in the end. So she asked me for my license or registration. And I give them to her. She looks down at them. She hands them right back to me. And motions for me to go forward. I said, officer, is everything all right? She said, yeah. I saw your show. She said, where did you see my show? She said, Syracuse. I don't want to be named. You have a good dad. That's when I decided that I should be an optimist. Thank you so much, Indiana. Have a good night! Now, if it's going to work, I can do your set. You can't do my set. No one should do your set. I'm going to do my set. I'm going to do my set. I'm going to do my set. I'm going to do my set. I'm going to do my set. I'm going to do my set. I'm going to do my set. No one should do your set."
}