{
    "url": null,
    "title": "“Bro, How Do You Know You’re Not Gay” - Jason Cheny - Stand-Up Featuring",
    "transcript": " This is really nice, really diverse crowd. Yeah, it's young too. You were, why'd you, me, me just now? There's, yeah, there's the whites, there's the Hispanics, you know, there's the blacks. It's always a little uncomfortable to say black, I feel like, because you say black, everybody's like, why do you say black? All the whites. Everybody's, here's one thing that I've been trying to do. I've been trying to be a little more open-minded. And I feel like it's hard to do, to be open-minded. Like, for example, I'm a straight guy, okay? And I know that's a weird thing to just be like, I'm a straight guy. Like, I have a wife, she's real, and, yeah, I'm a straight guy, and I like all the breasts this is. I like them, the small ones, the big ones. I like the small ones because they're coming in, and the small ones, I like the small ones because they're compact. If there's a zombie apocalypse, she is ready, you know? She is away from the zombies is the thing. I'm a straight guy, is my point. But I have a friend who is bi, and sometimes I want to be open-minded, but I think to myself, how do I know that I'm not a little bit gay? Like, how do I know that? Because so I have a friend who's bi, and I'm not bi-curious, but I am curious about the bi. That is a little bit different. I just want to check the landscape of things. I'm a straight guy. But I went to my friend, I was like, really masculine friend, which is not a good choice for this question. I was like, bro, how do you know you're not gay? And he's like, bro, you should just know. I'm like, yeah, but how do you know you don't like something if you've never tried it? He's like, bro, you're gay. You are 100% full gay. I'm like, you're not listening to me. Like, how do you know you don't like something if you've never tried it? It's like oysters. Nobody has seen the oyster for the very first time. And was like, oh my gosh, this looks appetizing. Let's eat this goo in the rock. Nobody. We only started to eat oysters because we saw other people eat it. And we're like, oh my gosh, they look like they're having so much fun. Right? Yeah. And that's why I put my finger on my ass a couple times. Because I'm open minded. I'm open minded, open oyster, open ass. Okay, that's gay. But I'm not gay. I'm not gay. I'm not gay. I'm not gay. I'm not gay. I'm not gay. Okay, that's gay. But I did not like it is the thing. I did not like it. Because nobody likes the oyster for the first time. You saw other people do it. A little bit of horseradish. Little bit of Tabasco. And to me, that was lube. And that's why I put it up the second time. And yeah, and I did not like it again though. I did not like it again. But I want to stay open minded. My friend is like, Jason, but third time is a charm. I'm gonna tell you guys something third time is not a charm. It's just the same finger up the ass the third time. So if you want to try something new, try twice. Because three time is too much. And I also had to learn this. People's how open minded they are, the tolerance of how open minded people are is different from each individual. Didn't know that. I was in Fort Wayne, Indiana. And that's a super quiet place. Yeah, because there is the whites. And then is the whites. And there are white. And I asked a dude, super white guy, I was like, hey man, what is something that you did recently that's very open minded? He's like, we'll see an Asian comedian. Some of you were scared to laugh at that real quick. But I was like, that's awesome that you said that. Cause first thought was always like, oh, he's racist and bigoted. I'm like, yeah, but he's also a little bit less racist than yesterday. Cause if I just came, cause that was his peak open minded. That was like putting a zucchini on my ass the first time. That was the peak. Like if I was wanting to be like, you racist, cracker, yeah, he would have just been like, I knew chinks wasn't funny. And then I would have lost the whole white community. That's why I came with the positive reinforcement. Cause now he's going to go back to his barn. Tell four more whats and they're going to come to the show. And dad is exposure therapy. I'm doing the Lord's work. I know that exposure therapy cause I do therapy. Hey, you guys, everything about killing yourself sometimes. All right, some of you are excited about it. Some people think about it and some others don't. Like some people are just really working hard to survive and they don't even have time to be sad. And I'm really, I really respect that. And some people are just healthy, mentally, financially, and physically. And if you're those people, you should definitely think about killing yourself. I'm just kidding. Everybody have weak moments is the thing. I call this suicide hotline a couple of times. Yeah, just to figure it out. I don't know solutions just to a couple of weak moments. But don't worry, it's not like I called every day. It's not like I'm like, hello, they're like Jason. It wasn't like that. Couple of weak moments, that's not funny. But what's hilarious to me is that the people at the suicide hotline not trained at all, hilarious. One time I called, this dude was like, well, is there an object around your room that could be a weapon that you could use it to hurt yourself with? I was like, I have never thought about that before. So when he asked that shit, I started to look around the room, trying to get creative. I was like, sir, I think anything could be a weapon. If I run fast enough, the wall could be a weapon to you. Like why would you direct my attention to weapons? Why don't you say some nice shit? Like, hey man, do you got enough ice cream in the refrigerator? Yeah, eat that shit, feel nice. What kind of shit is this? Hey man, do you got enough? Yeah, in the kitchen, I guess. I could stab myself in the face if you want me to. It's so funny, this one time I called, I was like, hey man, I've been thinking about killing myself. Swear to God, this guy was like this. Yeah, people think about that sometimes. When he said that, I cracked up immediately. I was like, bro, I don't even need you anymore. You help me out in the weirdest way possible. What kind of standard order of operation is this? Hey man, I'm gonna kill myself, yeah, me too. Where should we go? I almost just gave him my number, be like, hit me up."
}