{
    "url": null,
    "title": "“Disneyland Characters Are Strippers for Kids” - Meredith Casey - Stand-Up Featuring",
    "transcript": " I'm a mom. Thank you. I have a six-year-old and we live in Los Angeles, so we drive around a lot. And anytime my son sees a billboard, he just assumes it's for a TV show or a movie. And we were driving the other day, we saw a billboard for Planned Parenthood. And the billboard had a baby on it. And the baby had just eaten a bunch of pasta. So it was covered in red sauce, and it was squeezing a meatball. The baby was a mess. And then real big and spaghetti, it just says, not ready. And my son sees that and he just goes, huh, that looks like a good movie. And I was like, oh, buddy, you'd hate that movie. You were almost in that movie. I just didn't have the heart to go see the movie. I bought tickets twice. I just couldn't go in. Also, I think it's really like fucked up with Planned Parenthood to put a baby on the billboard. Because isn't there a whole thing that it's not a baby yet? Like it shouldn't say not ready, it should say too late. Sometimes people think I'm pro life or really religious after that joke. I didn't choose to not get an abortion because I believe in God. to not get an abortion because I believe in ghosts. I'm just a little hot and pussy for the rest of my life. I really like teaching my son stuff. I really like it, you know, and I love being a parent and I love teaching him stuff. That's my favorite part of it. And when you're a parent, you know, like every moment is a teaching moment. Sometimes even in ways I don't expect, it'll be a teaching moment. Like the other day I was playing hide and go seek with my son and my son sucks at hiding. He's so bad, like I saw him right away, but he popped out to scare me. So I was like, ahhhh! Wow, buddy! Wow! That was good, that was so scary. And he looks to be really confused and he's like, I didn't actually scare you, did I? And I was like, no dude, you're hiding behind a glass door. He didn't scare me and he's like, alright, well then why did you do all of that then? And I was like, I don't know man, I just, I wanted to make you feel good. And honestly, I just wanted to be over. And he's like, okay good, well I'm glad that you told me because next time I'm gonna try harder. And I thought to myself, good, this is a good lesson for him, right? Like I want my son to be able to tell when a woman's faking it and then try harder. It's a good lesson. I really like teaching him shit. I taught him how to shit. You gotta teach your kid how to shit. I potty trained my kid, I don't know if you guys know potty training is just bribing somebody into not shitting their pants. But, that's all it is. But I told my son, I was like, hey man, if you learn how to use the potty, I'll take you to Disneyland to meet Mickey Mouse. And he did it and we went. And we waited in line at Mickey's house for like three hours. It was worth it because when it was my son's turn, he walks right up to Mickey all confidently and he's like, hey, my name's Aiman, and I poop in the potty. And let me tell you something, Mickey went nuts. Mickey was just like, yes! He was smacking his own ass for some reason. He made my son feel so good. And we're walking away, I'll never forget this, we're walking away and my son looks up at me and he just goes, man, I feel like Mickey really likes me. Like, he like really, really, really, really likes me. And it took everything inside of me not to be like, dude, he doesn't actually like you. It's just his job to make you feel special. And that's what I realized that Disneyland characters are just strippers for kids. Thank you. So we waited outside until Mickey's shift was over and followed him to his car. So I'm a good mom. I really like Disneyland. I've never said this before, but I also like Disneyland. It is so hard to be a good parent at Disneyland. It is so stressful for us when you have kids. It is so much work and it's exhausting and you're waiting in lines and you're walking around all day and it's packed and it's expensive. And kids, they're just over stimulated and jacked up on sugar all day, so they're annoying and awfully behaved. and parents, we just walk around Disneyland just seething. I walk around Disneyland so angry under the surface. Like, I feel like the true magic of Disneyland is that kids don't realize how close they are to getting hit for the first time. I've never seen a kid get hit at Disneyland. I've never seen it, but I feel like if I did, I would just be like, whoa, whoa, whoa, take that shit to Six Flags. Kids are getting hit in the parking lot at Six Flags. They're not even inside yet. I really want to have another kid. I really want to have another kid, but I just, I hated being pregnant. I really hated it. I just got so much crazy advice from strangers. Like this one lady, this is completely true. She walked right up to me. She hit her hand on my belly. She looks deep into my eyes and she just goes, be sure to shave your pubic hair before you give birth so the doctor can see what he's doing. I was like, no, I'm not going to shave my pubes before I give birth. That's like getting a haircut before I blow my brains out. So, I do. That's also not how I would do it, by the way. That's not how I'd kill myself. I think about it. I've thought about it. I told my therapist that and she was like, yeah, that's suicidal ideation. And I was like, yeah, but like everybody thinks about it sometimes. And she's like, no, they don't. It's a mental illness. I'm like, yeah, but I'm not going to do it. I'm like relaxing to think about it. And she's like, yeah, that's it. You're ill. I know suicide makes people feel uncomfortable, but I do think that it's important to talk about, and I think we're doing a better job talking about mental health. There's more awareness around it and less stigma, which is what people need. Like the other day I saw an advertisement for the suicide hotline on the back of a bus, which I think is great. I do feel like that should be on the front of the bus. I actually called them and told them that, which was my second time calling. The first time I called for the regular reason. I called the suicide hotline years ago before I had a kid. I was in a really dark place in my life, and I called it like a last ditch effort, and I spoke with this woman named Beth, and I told her, shit, I've never told anybody, and just started talking to her about how much pain I was in and how I just like really wanted it all to go away. And then in the middle of all that intensity, I heard someone in the background of the suicide hotline go, who the fuck ate my egg salad sandwich? And then it turned out that Beth ate his sandwich, so really had to talk each other down, you know? It was a real twist. It's a real twist. So I couldn't kill myself after that. And now I have a kid, you know, I'm a parent, and I can't kill myself now, because once you have a kid, suicide's off the table, you know? That's not how I want my son to find out what ghosting is. This is so depressing, but here's the thing. I don't have a lot to live for besides my son, you know? And he'll never know that, because I can't tell him that. How does that conversation go? Like, what am I supposed to say afterwards? Just like, hey, buddy, you're the only thing keeping Mommy alive. No pressure. No pressure. But my kid really is, he's all I have. So what does he mean to me? I want to be like, dude, I'm hanging on by a thread. You're the thread. Look around, what do you think I'm living for exactly? Our shitty apartment? The basket of unmatched socks that has been there since before the pandemic? No, dude, you, you're it. I can't make you be nice to me, but I can make you an orphan. You"
}