{
    "url": null,
    "title": "“If the Gangs Sold Shrooms…” - Brodie Reed - Stand-Up Featuring",
    "transcript": " I come from a lot of people who are overachievers, who work really hard. Everyone knows or is a person who is like the first person in their family to like graduate from college, right? That can never happen for me. My parents already graduated from college, super selfish, I know, I know. I just want to be, I have a new dream and it's to be the first person in my family to just chill. You know what I mean? To be successful and not really have to work hard. You know what I mean? Like my ancestors were slaves and they worked hard so that one day I could smoke weed and play Xbox. That's all I want to do. You guys are helping me achieve that dream, so thank you so much. I've never been ashamed of a applause break. Oh man, please cut that out. I'm from Inglewood, California. That's what's up, that's what's up, that's what's up. I see that you guys have been to LAX before. That's my alma mater, that's what's up. I grew up in the 90s in the middle of like all the gangster rap shit and people don't really believe me because of the way that I talk and look and act and the people who I hang out with and the choices that I make. But it's true, I was. Dr. Dre was my primary physician, you know what I mean? I had a tough time because you were supposed to be like a tough guy growing up and I am not a tough guy, I'm a comfy boy. I'm a comfy little baby boy. You know how I sleep at night? I sleep in my hammock with my cats rocking back and forth like a baby in a cradle. I'm about this life. They say it's hard out here for a pimp, it's hard out here for a pimp. It's hard in here for a pimp too, you know what I mean? Under every fuzzy pink hat is a fuzzy pink heart. And that's what I try to represent. We had gangs in my neighborhood and stuff. They sold drugs, no, no, no, no, no, no, no, no, no. And they didn't even sell any cool drugs. They just sold like crack or whatever, boring. Who cares? Where's the Molly? Where's the acid? Where's the shrooms? If the gangs sold shrooms, I think they would have to try shrooms. And if they tried shrooms, I think they'd be like, oh fuck. Guys, what are we doing? Drive-bys? Life is driving us by. Let's go to the beach. I wanna feel my toes Crip-walk in the sand. Hot, hot, hot, hot, you know what I mean? Cold, cold, cold, cold, cold, cold. I didn't do the actual Crip-walk because they would kill me. They would kill me for that joke. I hope I get killed for that joke. That'd be so sick. Oh my God. I would die so funny. You called us goofy. Can you delete this set? I try to care about stuff. I try to be a good person, you know what I mean? I try to care about politics. I get in arguments with a lot of people because I have kind of weird views, I guess, in politics. I am socially conservative and fiscally liberal. I think that college should be free and it should be segregated. I think that private companies should stop bottling public water and I also want a water fountain just for me and my friends. Fun, fun times. I am a socialist though and no, I don't know what that means. No clue, not at all. They said sock them and I was like, sock them nuts. And that's how I filled in my ballot and stuff. People always think that I like Bernie Sanders and stuff just because I have a Bernie Sanders tattoo and stuff. Sometimes it's a Larry David tattoo depending on where I am. And depending on how the elections go. But either way, I'm just gonna put a little teardrop on there and that would be really sick. And I like Bernie, but Bernie's not even that hardcore, you know what I mean? He's not even that hardcore. It would be so sick if Bernie was hardcore. You'd be like, the top 90% of those who run forces are the same as the top 10% of those who burn crosses. All cops are bozos, all cops are bozos. You know it's good when someone inhales sharply. That's what's up, that's what's up, that's what's up. It seems like we have to have like so many opinions these days and it could be hard to keep track of them. So I like to write mine down and I brought a list of my opinions. Thank you so much. I think everyone should do this, just kind of clarifies, you know, when you're at a party, how do you feel about Israel Palestine? I'm like, which one's trying to be free? You know what I mean? You can laugh. Bill just cut it out. But this is a list of my opinions and the way that it works is it's a yes or no system so it'll be pretty simple. Birthdays, yes. I like birthdays. Getting older, no. Least favorite part of birthdays. Dying, yes. Ghosts, no. Ghostbusters, yes. Lady Ghostbusters, yes. Baby Ghostbusters, I pitched it, they said no. What are you gonna do? Movies, yes. Movies longer than 90 minutes, no. Music, yes. Musicians, no. AI, no. Smartphones, no. Computers, no. Social media, no. Except for when you see a mutual's nipple on Instagram every once in a while. That's tight. Let's see. Politics, yes. Getting political, no. Free thinkers, no. I don't like free thinkers. We already, some people already did the thinking, you know what I mean? Read books. We just want you to read books. Books, no. I don't wanna read, fuck that. The LGBT community, gay people, yes. L, yes. G, yes. B, no. Transgender people, yes. Transgender people using whatever bathrooms that they feel comfortable with, yes. Bathrooms, no. P, no. Poop, no. Gruffs. Yikes. Let's see, comedy, no. Telling it like it is, yes. Improv comedy, yes and no. No. Prop comedy, I forgot to write it down. I am... Religion, whatever, I don't care. Hell, yes. And I'm not even trying to make a pun, just, I think it's cool. ADD, yes. Depression, yes. Anti-depressants, yes. If you guys are depressed and you're not on anti-depressants, you should get on anti-depressants because then you won't be depressed anymore. And your life will turn out like the commercials. My life is great now. I started going kayaking and stuff. ADD, yes. Cops, no. Pigs, yes. I don't think we should associate them with cops anymore. They're nice animals. Crime depends. Misdemeanors, yeah. Violent crime, no, but secretly, yes. Nicknames, yes. Being called boss, no. Being called player, yes. Being called big dog, phew. Phew, phew. And it's the last one. Big dick energy. Do you guys remember this? Big dick energy, no. Renewable big dick energy, yes. We gotta get off dirty foreign dick energy and create some jobs."
}