{
    "url": null,
    "title": "“I Had a Vasectomy Last Year.” - Sean Jordan - Stand-Up Featuring",
    "transcript": " I had a vasectomy last year. We don't all wear capes. You know what I'm talking about? Just out here. I did that because we had a kid in the middle of a global pandemic and I was like, whoa, this blows, huh? Make sure that never happens again. We had a kid, we decided we were one and done. And in our situation, we have two forms of long-term birth control, two options. First one, I could get a vasectomy. Or the second one, she could get her tubes tied. It's like, yeah, all right, let's just go with the one that sounds like an actual medical procedure. Like a doctor's gonna do it, you know? Not the one that sounds like birth control for balloon animals. It's insane that they call it that. They don't tie them together, by the way. My whole life, I thought there was some cartoon doctor be like, no more kids for you. No. I'm not a full procedure dog. But it's scary. Like the topic of birth control, it's real polarizing right now, you know? So I told, like, anytime it came up, I would tell people, like, yeah, I'm gonna get a vasectomy. And everyone's like, of course you are. That ain't shit. That ain't shit compared to birth. And I'm like, yeah, you're absolutely right. Compared to birth, that ain't shit. But not compared to birth, that's some shit. It just is. Someone's gonna cut into my nuts. That's about, you know, that's scary. That's like the one thing I hope would never happen my whole life. I'm just like, surely no one's gonna ever cut into those. That'd be, that'd just be crazy. I'm, obviously, I'm never gonna pay a grownup to do that. That just would be a big sellout move. It's scary. Like, yes, birth is much more painful looking, much gnarlier, much scarier. But vasectomy is just, you know, it's also painful, scary, gnarly looking. Like those two things can exist in the same world. They're just different levels of severity. You know what I mean? I'll put it in perspective. Let's say I'm walking down the street with a buddy of mine, which is mine in my own business. Somebody runs up and stabs them 30 times. Just runs up like, yuck, yuck, yuck, yuck, yuck, yuck, yuck, yuck. And I shoes run, yuck, yuck, yuck, yuck, yuck, yuck. Just stabs them 30 times. And then they stab me once. Still sucks I got stabbed. It's a bummer I'm bleeding, you know? That's a vasectomy. Pretty rad, my voice cracked, huh? So I walked in for the procedure and I was nervous right away because it was much different than I thought. When I walked in for the procedure, I thought it was going to be simple. I thought I was just going to stand there and they were going to sew my penis into my own belly button. Makes sense to me. I'd just stand there, hold it for them, they could stitch around, put some shugu or rubber cement in the holes, make sure nothing gets out, you know what I mean? In and out like a robbery. Because then if I have an orgasm into my own tummy, I can't get pregnant. I don't have the stuff. I don't have eggs. I don't have a uterus. I ain't got no phelopes, you know? It just cycled through like the infinity pool at Rich People's house. It just kind of keep going in and out. If you had sweated out on occasion, just squeeze it up, keep it pushing, you know? Plus I'd have a little handle. Wouldn't that be cool? Make a little guitar case out of me? Like if I was sleeping on the couch, you desperately want me to go to brunch but you don't want to wake me up, you're like, well, just pick them up. That's a little bad dude and take them. It's not at all what they do. It's a whole thing. It's a whole procedure. I go in and the doctor sits me down. He's like, all right, we're going to make a tiny little incision and you scrotum. Pull out your vest, ever since one by one, cut out a chunk, cauterize them. The whole time I'm just like, why are you telling me? I'm already here, you know? Save your breath, playboy. You're spinning your wheels, honestly. Just get to cutting. So he explains everything and he stands up and he's by the door and he goes, all right, I'm going to get out of here. I want you to get naked from the waist down. I'll come back in. We'll do the whole procedure. So he gets out of there. I get naked from the waist down. Can we all just agree that naked from the waist down is the dumbest kind of naked? It's insane. I just, I look like this. I don't got a lot of arrows in the quiver. You know, so I just, I look like this all the time, but I had a hat on in this particular day. I didn't know this was going to happen. So I'm just standing there naked from the waist down. I was like, well, that ain't it. This is crazy. I just look like a lost five year old. Like when you're naked, when you're naked from the waist down, it doesn't look like you took your pants off. It looks like you found a shirt, you know? It doesn't look planned. It looks like I was chained up in someone's basement. I got out and I was like, happened upon a shirt and like, all right, thank God. Now onto some help. And so I thought about getting all the way naked. I was like, just take the shirt off, keep the hat on, meet him in the middle. So I just looked like a moron. And so I started to get all the way naked, but then I stopped. I was like, no, you can't do that. Someone's expecting you half naked and you're all the way naked. Now it's on you. He just comes in, Sean, why are you all the way naked? And I'd be like, well, I look pretty stupid the other way. So please cut into my scrotum. Just get that done. So I kept the shirt on like an absolute tool. And he comes back in to do the procedure, but he had another person with him. I was shook. It was a student. She was shadowing him. She was going to learn how to perform best economies. I wasn't ready for that. So it comes in. It didn't matter that she was a woman. It mattered that there was another person there. Because I felt like an absolute moron. I'm just standing there, feet up in the straddles, naked from the waist down, like a total chode. And she comes in with him. She goes to the back so I couldn't see her. And then he sits down and he put on some gloves and he got his hands all sudsy. And he goes, all right, I'm going to wash you real quick. That's what he said. And I don't know why I did it, but I'm right back at her. So he goes, we're going to wash you real quick. And I look back at her. I go, I washed myself. So I'm not a godless lunatic. Of course, I took care of it. He can do it again. I mean, we can make sure it's double clean. But of course I washed. I'm having a penis operation. I washed my penis. With only one of these I'm going to get, hopefully. So yeah, I took care of it. You know, I'm not just trouncing around with some dirty pickle, just ready to have it operated on. I wasn't in a heated game of racquetball, just like, whoa, holy buckets. I thought I was going to get home, but I cannot do it. So I'm just going to go squinch it on down there and let this poor bastard wash it for me. Of course I washed it. He did it anyways. He just starts washing it. And I'll tell you this, it wasn't not dope. I was fine with it. I was just sitting there like, well, you really rolled out the red carpet playboy. This is, I've never had a doctor do this and this really is loosening me up. You know, I mean, I said they did that before every medical procedure. I had my ACL reconstructed a while back. If they would have just sat down like gentlemen and like Sean, it looks like you tore your left ACL and your MCL. We're going to get you back, walk and reconstruct you. You can be good as new. Before we do that, I'm just going to wash your penis real quick. See if that helps everything out. And it did. So then he did the procedure. It was no big deal. Took 11 minutes. I was texting the whole time. Not, it was nothing. If you're thinking about getting a vasectomy, just go do it. Stop being a dickhead. Go get it done. Guys suck so bad. So just do the one thing that you can do and get it done. I digress. That's not part of that. That's not funny about that. It's a little PSA. So he did it, got it all done, put a little bow on it. And I was a little more clear headed after that. So I did have a question for him. I was really interested about this. I asked him, I go, what's the most common question you get from all these dudes in here getting vasectomies? He said, one of the most common questions he gets far and away is, guys all want to know if they're going to have the same amount of ejaculate after the procedure as they did before, which is a wild question. I've never, I've never cared. I've never even cared a little bit how much comes out. I don't want, I don't want anything to come out. I never have. If there's another sneaky little jizz pipe in there, just cut it, get that out of there. Stop it all from, it's rude. It makes everything gross. I don't need that in my life. It's uncouth, you know? I don't want to do it. I don't sit down for an amazing Thanksgiving dinner, stuff myself and then stand up and just throw gravy everywhere. I want to make a mess after something rad happens. If something, if something has to come out, if something absolutely has to come out, just put a little stick in my penis with a flag on the end that says, bang, how about that?"
}