{
    "url": null,
    "title": "“I Was a Leash Kid” - Craig Conant - Stand-Up Featuring",
    "transcript": " Yeah, what's up? I'm not dead. Yeah. I started smoking weed again though. Yeah. I am aware it looks like I never left. Like I know, bro. I had to retire. I retired for eight years of my life. You guys ever smoke so much weed? You smoke heroin? Whoopsie daisies. I did it wrong, bro. I lost the tooth to the war. I don't know if that was the Kool-Aid or the dope, you know, but that's between me, my tooth hole, and God right there. But when you leave weed for eight years, they change the game, you know. They got weed everything. They got weed shampoo. Look at this glorious right there. They got weed chapstick. I'm wearing too much right now. You know, they have weed water now. That's not a joke. They have weed lacrall in a can. Yeah. However you say that dumb beverage. I don't know what a Pamplemousse is. All right. It's grapefruit. But I was at a party and they had a cooler full of it, and I started putting them back. You know, I didn't know I had about eight, nine, ten of them bitches. I'm also lying. I knew. Yeah. You put a little in your tooth hole on the side. It gets rid of gingivitis. And and then I smoke to joint after that because I'm an addict, you know. That's my problem. Like I don't like regular high. I like, oh, no. How can I survive this? And therein lies my problem. And then I did all that and I was driving me and my buddy home on the freeway. Yeah. And he asked me, he's like, how the fuck are you driving right now? And I said, I'm not. We're flying, bro. That car ride was lit, too. We have Pink Floyd playing, you know, getting hello, hello, hello. Is there anybody in there? No. I lost my marbles when I was nine, dude. I was that little kid high on tropical punch Kool-Aid with the red stained lips. Remember Redmouth? I was a bad kid. I was a menace. My mama put a leash on me. I was a leash kid. That shit didn't work. She turned around. I strapped that shit on another kid. I was gone, baby. That big booty can't catch that. My mama's got a big old booty. That's it. That's a one liner right there. I'm half Mexican. Can you tell? I don't know. For the doubters, what's up now? Fool, what's up now? My mama is full Mexican. My dad is white as fuck. So I came out looking like a lesbian, you know? I shaved my pussy today, boy. I make fun of my Mexican side a lot, and they're like, why don't you make fun of your white side, Craig? Why don't you make fun of them? It's because I can't. What am I going to say about my Uncle Terry white side? He's doing well. Yeah. He's an engineer. He's a son of a bitch on the golf course. That shit don't slap. But my Uncle Johnny and Mexican side, you know, watch out for this fool's nuts. That fool's tatted up. He's got a punk and kill tatted on his knuckles right here. And then he has Jesus Christ on his throat. Yeah, make up your mind, Johnny. Those are conflicting ideologies, bro. But he used to babysit me and tell me stories when he used to party. He's sober now. You're about to hear why. Yeah. But he said he had PCP at a party and his buddy warned him. He's like, hey, Johnny, stash the drugs and the cops are coming. You know, and he said he pulled it out of this pocket and he put it into that pocket. And then he's like, stash, dad. And then he went to prison. Yeah. And then became my babysitter in that order. It all makes sense now. I got you guys want a weird story? I got a weird one. Hey, man, I see my cousin's vagina before. You said, yeah. That's consent, baby. No, I saw it in a natural way, in a normal way. My cousin was pregnant as fuck and her man got locked up. You know, he was a tweaker from Riverside. And my mother is a very sweet lady. She's a matriarch. She takes everybody in and she's like, we got you. Come live with us. But now I am home alone with my pregnant cousin and she went into labor. Yeah. And she's like, hey, can you take me to the hospital right now? And I was like, OK, dokey. Yeah. But let me smoke this weed real quick. I'm not a woman, but I don't know how long labor is going to be. You know, it's a long day. And let me get my mind right. So I. I rushed to the hospital and now it's me, my cousin and the doctor. And then he asked me, he says, do you want to see a baby being brought into the world? And I'm high as fuck. I was like, hell, yeah, dude. That's like National Geographic in real life, you know. And my pullout game is strong. I don't know when the next opportunity like this is going to happen. And I know it's weird. I asked my cousin's permission. And I was like, can I witness childbirth and she green lights me. And she's like, yeah, give it a look. And I was like, OK, dokey. And now her legs are in the stirrups, the clampy thanks, you know. And I'm just staring at it and staring at it and still staring at it. And nothing is happening. And then I look at the doctor. I'm like, hey, he's like, oh, my God, I'm so sorry. It was too soon. Yeah. So I stare at my cousin's vagina for no reason at all, bro. I know it was only two minutes, but I'm high as hell. That felt like two years to me. I also want to know what if that doctor had the sickest sense of humor ever? And he's like, I'm going to trick this high dumb dumb in the staring at his cousin stuff because he did, man. He got me. So then 20 minutes go by and he says that the baby's crowning now. Come back and give it a look. And I was like, I don't know, bro. Fool me once, shame on you, dude. Fool me twice. That's my cousin's pussy, bro. But I was like, oh, fuck it, I'll take a chance, you know. And I went back and I witnessed that shit. Women, you're amazing creatures. Y'all sprout human beings out your wee wee, dude. That's the craziest thing I've ever seen in my life. It comes with a cord. Y'all know that? They let me cut it and everything is tough as nails, though. They don't warn you about that part. I had to pull out my pocket knife go, you know. I told you, I was Mexican. We ready, dog. What's up, fool? But when you witness something like that, it impacts you. I saw that and I said to myself, I was like, I'm never having sex again. But then you quickly realize that's not a possibility. So you bargain, you go, OK, at least when I have sex, I'll be safe. And I'll wear a condom. But then you quickly realize that's not a possibility. So you pull out and pray. Yeah. Who's getting STDs tonight? OK. I think STDs are a myth, anyways. You just go in the ocean, that shit goes away, you know. Get rid of your burning with some burning from the Lord. My dad's crazy, too. My wife's side, he doesn't like laws. You know, like laws, those silly old things. I remember growing up, the first law that changed was the bike helmet law. When I was a little kid, you could bear back the concrete like a man. You come out like this, though. And me and my father were riding our bikes to the moose lodge because he had won too many the night before and we're picking up his truck. And and we get pulled over by the police and he says to us, your son has to wear a helmet now. And my father said, I ain't raising no fucking nerd. And the cop was like, oh, Jesus, you know, this was noon on a Saturday in Torrance, California. You know, I was like, yeah, he's a firecracker. Try living with him, you know. And then the next law that changed used to be able to ride in the back of pickup trucks, even in liberal Los Angeles, early nineties, that's where it got me. My sister would be back there playing Uno and hopscotch, you know. Yeah, you hit it there. He'd be like, whee. That might have been a good law that saves some ninos right there. You know, there goes another. And we're going fishing and we're going down the one ten freeway. And we get pulled over and me and my sisters are back there playing. And the police says, like, sir, your children cannot be back there anymore. And my father said, what is happening to America? My children can play in my pickup on a highway I pay taxes for. And the cop, you know, he's like, sir, we're just trying to prevent you from having a dead son. And my father said, I'd rather have a dead son than a pussy boy. And then he beat me. That's a dark one. OK, my bad. We'll prep it up. We'll go happy. I moved to the beach recently. Hey, I look like I would live by the beach. Just not in the home, you know, like maybe a van at best or under the pier on a rough night. Yeah. And I was babysitting my little nephew. Again, I'm 10 years off narcotics and alcohol. I'll be back. Don't applaud that. So she trusts me again. I take my little nephew down the ocean. I put him on a boogie board just very shallow in the white water. And I don't know if God is mad at me for my Kool-Aid days or druggy days or what. But that fool sent a wave in out of nowhere and then my nephew disappeared. Yeah, I don't know if you've ever lost a kid in the Pacific Ocean. But that's a bad feeling right there. Yeah, I only lost him for like three seconds. It was the longest three of my life. I was searching for his head to pop up like a boogie. I was like, come on, Thaddeus, come on. And I just seen him tumbling, you know, and he's four. He can't talk that guy. He popped up and he said, I was under water, uncle. And he said, I could see you and then I couldn't see you. And I said, you're a poet, Thaddeus. Now, don't tell your mom about this. And he didn't wrap me out because he's Mexican. Hell yeah. And then I beat him. Generational trauma continues. I'm just joking. It stops here."
}