{
    "url": null,
    "title": "“I’m a Pretty Masculine Package” – Henry Sir – Stand-Up Featuring",
    "transcript": " Who's a cheater? Is anybody cheating tonight? Anybody got anything they want to admit to? Come on now. Nobody. Okay. All right. Okay Statistically, that's a lie, but cool. Good for you guys. Good. I'm proud of you. That's great I'm not cheater. I've been with my wife for 15 years never cheated. I think that's pretty good. It's pretty good Yeah, I mean the yeah, yeah Yeah The bar is low, but I'm gonna accept that applause. Yes. I am a Phenomenal person. Yeah, never cheated. Pretty good. It's pretty good. Never cheated. It's pretty good. It's pretty good Also never been offered so it's pretty easy. I I would I don't even like her honestly. I am actively trying. I just nobody's taking the bait, you know No number one reason I don't cheat is I love my wife But also I just I want to be a good guy and I don't think I honestly always have been I grew up around a lot of toxic masculinity and it got projected onto me a lot because I'm a bigger guy. I'm 6 5 I have a deep voice Strong stash. We can be honest about things I'm a pretty masculine package honestly. I am my last name is sir s i r My name is Henry sir. I sound like an american hero from gi Joe Sometimes people call me mr. Sir. I'm like I can't handle this power. Please just ah I Don't want to just point the finger though. I want to do a better job of holding myself accountable for when I've been a part Of the problem because we all have I grew up in the 90s in the 2000s. I know I have I'm not trying to be edgy I'm just being honest. I grew up in that crazy era where we called everything gay Don't why I know you did I'm from Canada and we did I know you guys did I've read a history book. I know you guys did We didn't even have freedom we were doing and I know you guys were doing it with all the freedom with all the freedom Eagles soaring in the sky all the time and Those freedom amendments of yours. I know you were doing I'm not condoning it. I feel terrible. It's very ignorant. I feel really bad for the actual gay kids that impacted but at the time That didn't stop us from calling literally literally everything gay Didn't even have to be people concepts were gay So I'm gonna be like, hey man, you want to go swimming and other guys like nah swimming's gay and everyone's like That's a perfectly valid reason to not go swimming. Yeah Yeah Yeah, swimming is a pinch Gay come to think of it. We better steer clear a couple alpha male nine-year-olds like us. We uh We have an image to maintain on these streets of Edmonton, Alberta, Canada. We can't partake in such kukery like swimming. That'd be ridiculous It's true everything was gay. I was gay my dad gay Every man I ever met growing up was gay for some reason Because that's all it meant to be a man as you sit there you call things gay then you get called gay and the cycle repeats forever and You bottle it up so you don't snap because if you snap they're all gonna call you gay But then you end up snapping because you bottled it up and you were gay the whole time there was nothing you could do It was a tough spot where the last thing you wanted to be called was gay and there was literally nothing you could do That wasn't gonna make you gay You get caught reading a book Matt got braces. He was gay Chris tried out for volleyball gay Colin was dating Cheryl most of the guys liked Cheryl Colin was the gayest guy in all of Canada And we told Colin all the time I'm from Alberta Canada. That's like the cowboy oil rig Tough guy province you if you had a vegetable if you got caught eating a vegetable is a better way of saying that If you got caught eating something with a vitamin in it all the old guys in their denim tuxedos like ah, it's rabbit's food What are you doing son be a man be a man eat steak be a straight man eat a steak put a nice thick Juicy piece of meat in your mouth like a straight man ditch the salad I'm the youngest of four brothers when I was 13 I wrote a poem and they found it Yeah I've been a witness protection ever since I haven't seen my family in 20 years I didn't move to the states. I was relocated. I had no choice all because I tried to express myself creatively when I was a child We were such lazy hypocrites. We'd go around calling everything gay and then that same night we'd have a sleepover What are we doing? It's a very romantic notion essentially what we're saying to each other is listen man. I like being with you so much that even when we sleep I uh I think it's best that we're together. I really do I want to start tomorrow morning off right? I want to be looking at you the literal second I open my eyes because God this connection we have is special and I just love you so much. I want to do everything with you That's nice. I feel like guys should be able to express that to one another But we can't you can't say anything even close to that you can't say anything I would make this mistake at a sleepover. I would just say good night I would get verbally tarred and feathered for saying good night Sleep over with a bunch of guys in Alberta, Canada. I just be like, how good night guys. You're like, oh, don't be gay That's what did it was me saying good night. That's what tarnished this otherwise oozing machismo bravado filled event was me saying good night Look at the build-up. Look at where we are. This has been a dance of seduction We've been courting each other man. We made plans on monday. This is literally all I've been able to think about I have been losing sleep with anticipation for this night It's been a lovely afternoon through evening with one another. I'm way further with this dude. I'd ever been with a girl Sleeping in the same bed in our boxers the waterbed. There's a lava lamp on there's a lava lamp on next to my head But that's fine is that I said good night the lava lab. That's fine. It's a couple guys Couple guys couple bowls couple bowls locking horns just a couple guys We might lock horns. There's a distinct possibility Because at some point tonight, we're going to be face-to-face breath-to-breath completely erect. So that is a distinct possibility We would project weakness on the things that just aren't weak. We'd make fun of male cheerleaders Have you ever seen a male cheerleader up close in the flesh? It's horrifying It's like when you see a moose in the woods you're just like my god this year the sheer size of this beast. It's magnificent Male cheerleaders man. Don't sleep on them built like a fridge stallion thoroughbred Just doing standstill backflips because he's in the mood this guy has to train to sass and this is a problem out on the streets Guys are so ignorant they hear dudes a male cheerleader like pansy kick that guy's ass a male cheerleader would destroy me If I ever got in a fight with him, we wouldn't even have to throw a punch. He's grabbed me flip me like 18 feet in the air A couple steps back not catch me. What am I gonna do? It's game over I'm a heap on the floor. He's thrown in all these cocky little victory dances just to taunt me What a dick Male cheerleading is some of the most toxic masculinity you're ever gonna see in your life Just some way over the top unnecessarily yoked up dude Literally throwing women around. It's like, ah, I'm like man. This guy's such a boss. Look at those glutes. Unreal I joke about things I joke about things and I I really though I hate ignorance. I hate ignorance of all kinds And homophobia the most this isn't to be preachy But it hits really close to home because I joke about how my brother's made fun of me Even then you get older you mature life happens and it just homophobia hits really close to home because one of my brothers is gay so yeah I think he's gay. I tell him he's gay Ah Get out of here in a sec I uh, I I try and be a progressive guy. I don't know how much longer I'm gonna be um And that's not because my politics are changing it's just the world's changing so fast I think that's how it works you you you think you have the right idea than a few decades later You're a barbarian right that's how it goes and we're not gonna be immune to that That's gonna happen to us and I worry what's gonna be the thing that makes me the old angry white guy I grew up around but never wanted to be I think I know Robots are here cyborgs. Yeah cyborgs are coming. I'm not making this up. Some people are already advocating for robot rights scary So what if I have a daughter and 30 years she's coming home telling me how she's marrying a man droid or something like that, you know Now all of a sudden I'm the old angry white dad. It's like no uh, no no no no I don't think so not a chance not in a million years. My little girl is not marrying one of them. I don't think so Well, she's telling me I'm robophobic. What if I'm a robophobe? What if I'm robophobic? If robophobia is the thing I'm going to be a rampant robophobe. I'm not I'm not going to be a closet robophobe. I'm not doing the whole look both ways. Well, I'm not robophobic, but no no no no The only thing you're going to know about me is that I'm robophobic a huge part of my brand I'm going to be calling them robos and things like that and fuck those robos. I can't stand them And I have all sorts of robophobic gear like Shirts and hats and flags in my truck that say no robo and stuff like that, you know I was fucking robos stealing all of our jobs fucking up our economy. I hate them. It's goddamn robos That's gonna be the thing that makes me the old angry white guy. I'm just sitting around pissed all the time Nothing's even happened. I'm just like, ah, I can't I can't have any fun anymore. I can't do anything pc police can't do anything I I I I I can't watch robocop anymore because just cough everybody shits a brick I I I can't do the robot at weddings anymore because it's cultural appropriation What if that's like the most problematic thing you can do 20 years from now full-body robot There's gonna be video surfacing of me just lighting it up at my buddy's wedding. It's so problematic It's gonna be like the 2050s watered-down version of blackface or something It's just over for me because I did full-body robot. No career aspirations from here on out There's literally nothing I can do career-wise. I'm just gonna have to like Move back to Canada and become prime minister or something like that. That's literally like All right. Thank you guys. I'm Henry sir. I love you so much, Benny"
}