{
    "url": null,
    "title": "“I Wanna Be a Princess” - Chloé Hilliard - Stand-Up Featuring",
    "transcript": " Right, y'all one of y'all now, I live here now. Period. Period, thank you, Black person. She's like, period. If you don't know what period means, it's an exclamation for black people talking like facts. Like, yes, like, oh my God, that's what period means. The more you know. I live here now, I moved here from New York during a pandemic, and people like to say that New Yorkers are mean, but let me say something, L.A. is mean too, but they just mask it in a different way. Like, I voted in the last election, and I had to do my research, because y'all be hiding shit on the ballot. It'd be taking a while for you to figure out what you're really saying, because you don't just say it in lame and terms, you sneak it into propositions and shit. Like, there was something on the ballot that basically was like, do you hate homeless people? Yes or no? Right? So now I'm in the voting booth feeling like Joaquin Phillips in the gladiator, like, I don't know, do I? I don't... That's a lot of pressure on me, I just got here. I don't want to make those life decisions, that's too much responsibility. First of all, I don't want to do shit no more. I'm 42, I'm ready to be dumb, I'm done. I'm ready to check out, treat me like an iPhone 8, I'm not going to update no more. Just throw me in a junk drawer, make me a paperweight, I'm finished. Life is hard, I don't want to do no more, I want to be a princess. But I'm late to the game, because I'm tall, I'm 6'1\", I've been a second since I was 12, and it's hard to be a princess, especially when you grow up playing streetball, you know? Because I'll get fouled by grown men and I say stuff like, suck my dick, and that's not really princess like, you know? Unless you say it like, suck my dick. I want to be a princess, but princesses have it hard when you think about it, think about like the Disney princesses, you know, they had her rough, right? You couldn't eat an apple without her being poisoned. You couldn't sew without the needle being poisoned. Ariel didn't have a voice until a man kissed her. Snow White lived in a tree trunk with seven day laborers. That's a hard ass life. I don't want that line. Plus, there's no more Prince Charming, there's no more knights in shining armors. Nah, they all gay and they married each other. Prince Charming is gay, y'all, okay? He wore a skirt with white tights, he got all his strong men together to be like, come on, let's go to the woods, that's the gay man. To the woods? You know what they doing. I'm tired. I'm tired of being a strong black woman. I'm exhausted, it's too much work, you know. The only people that are more tired than black women are white men. Did you know white men are tired? Did you know they are tired? And look what they up against, you can't blame them. They've been running shit for a thousand years, nobody's grateful. They've been running shit for a thousand years, nobody's grateful. Right? The Yelp reviews are in, you know what I'm saying? We need new management, this shit don't taste good, you know? They got it wrong. They all upset talking to us now, like, I did this for you, I've been ripping and pillaging for you. Like, go take a nap, Ted, please. Go be the little spoon you want to be, sir, you know you want to be the little spoon. White men are tired, they're actually tired of patriarchy, but the thing is they don't want to give it up because they don't want to be poor, you know. That's a big conundrum, so they just complain and shit. And I know white men are tired, I know they're tired because one of my good friends is the dominatrix. Yeah, and they be paying her a lot of money to fuck them up. She be spitting on them shit and on them being them up everything. Because they don't know how to feel, because they can't, you know, when you're entitled, when you're taught that the world is yours, like, when did you stop? When is the power in? Like, they just, it's insufferable, and they end up like getting consumed with this idea of being at the top of the food chain, and when that doesn't pan out for them, they end up paying a black woman $400 an hour to kick them in the nuts. They're tired. Like, you can't tell me Vladimir Putin ain't playing a back woman to pay them. That's why we don't see him no more, he's stressed out from the Ukrainian war, he just getting plowed every night. Coming up stumbling in the next press conference. I'm in a tire. I get it, I sympathize with them, I'm tired of being a strong black woman, you know what I'm saying? Like, when this civil war pop off, I'm not fighting on either side, I'm done. I am checked out, you hear me? It's not my fight. First of all, if you're a person of color, this is not our fight, just let you know. This is some Hat-Vel vs. McCoy shit, they gotta divide the states. It's not our fight, it's not our fight. I don't care when this shit pop off, I'm not doing nothing, I don't want no parts of it, I don't know what side to trust, I'm out of my business. You can call me a coon if you want to, okay? I'ma be that stereotypical black woman in the kitchen cooking for the soldiers, like, how the war going, is it going good? Going good? Got some chili, you want some chili? You got some? Okay. I got some freedom fries, you want some freedom fries? Hey, now listen up, listen up, okay? You go back out there, alright? Yeah, yeah, you got my thoughts and prayers, kill yourself. I'm not preparing for no civil war, I'm not preparing for none of that shit, and I know something popping off, cause white people been freeze drying shit since Biden got in office. Okay, so they prepared for something, I'm not prepared for, I'm from New York City, I don't have survival skills, when I tell people that, they be like, what do you mean New York is so hard and tough? It's a different type of, hard and different type of tough, okay? I've never shot a gun before, cause the New York City guns are illegal. You get three years in prison automatically if you're caught with a gun. Yes, right? I know it's hard, cause when I travel to country and I tell people that, they get surprised, they look at me like, you've never held freedom? I'm like, no, I've never held freedom, sorry. In New York City, there are eight million people in New York, you don't want eight million people having access to guns. Can you imagine that? On a crowded New York City train in the middle of a rush hour with somebody bumping to you, the thoughts swirl in your head. I don't know if that's a gun or a dick in my back. Dear Lord, whatever it is, please don't let it go off. I can see some women in here having a flashback like, oh, I remember that. Cause every woman in here has been in a place and they felt a phantom penis on their back. You could be in the middle of a conversation like, so tomorrow I'm going to go to church. I don't know who, I don't know how. But there's a dick on my back right now. And you can never find a culprit, right? You never could find who did it. You never know who the villain is, you just turn around and there's nobody there, you feel like you're going crazy. Like at least you turn around and God's like, it's me, it was... I didn't know you had a face, nice to meet you. Guys are getting weird like, men don't do that, men don't put their dicks on women, yes the fuck they do. Yes they do, that's why I just wish the tables would turn. I just wish one day I walk outside a bar, I see a guy sitting in the curb crying. His bro trying to console him, he's like, yo bro what happened? I say, man, I went to order some shots and I'm getting so emotional just... I turned around and there was a pussy on my back. Some guys was like, they do that? Where they do that at?"
}