{
    "url": null,
    "title": "“My Oncologist Had a Winking Problem.” - Alex Hooper - Stand-Up Featuring",
    "transcript": " I always like picking up the vibe before I begin my set because what I can do is I can look at an individual or a group of people rate your vibe and then match it. I am a vibrator. Now I tell you that because I want to be honest with you all, this past August my positivity was put to the test when I was diagnosed with stage three Hodgkin's lymphoma. And I'm going to spend the next few minutes making fun of cancer. Because chemo, that's just medicine. Real therapy is a shared experience with a group of people laughing together at the same time. So understand, if you don't find this material funny, you are actively killing me. When I found out I was going to have to do chemotherapy, I immediately signed up for talk therapy. And I was a little too honest on my evaluation form about my recreational drug use because they assigned me a substance abuse counselor. Not what I need. I'm very good at doing drugs. This outfit did not put on itself. The way I discovered this in our very first meeting, she's going through the checklist and she asked me point blank, did you smoke crack in July? No, I have never smoked crack and I would not mark on a form that I did. She said, well you checked a box that asked if you used crack slash cocaine. Oh. Well that slash is carrying a lot of weight. You need to separate those items. It's one thing to hit the slopes when a batch of fresh powder drops, but when the snow melts and it turns to rocks, get off the mountain. Soon you'll be skiing right under a bridge. It took three months of testing to figure out what type of cancer I had and that was the worst part not knowing. But eventually it came down to two possible options. It was either stage four head and neck cancer, very bad, or stage three Hodgkin's lymphoma, bad but much more curable. And when my doctor found out it was the latter, he presented me this information in a very peculiar way. He walked in the room and said, Mr. Hooper, this is what we were hoping for. We were? I felt like he walked in the room and went, it's cancer baby! I wasn't hoping for this. If we're hoping for things, I was hoping chocolate ice cream would have the same nutritional value as kale. I was hoping people would stop filming entire concerts with their phones while they stand in front of me. I wasn't hoping I had swollen lymph nodes, I was hoping a nymph would swallow my loads. We have different dreams. My oncology team was wonderful except one thing, my main oncologist had a winking problem and it would come out at very inappropriate times. When I was diagnosed, he looked at me and said, you're young, you're healthy, we're going to get you through this, I promise. Is the air dry in here? Can you hold your eyes open while you tell me life affirming information? I don't want anyone winking at me ever. If my wife on our wedding day during our val said, till death do us part, what do you know that I don't? Now, I'm happy to report that one month ago I had a PET scan and as for now, there is no more cancer. Plenty of other shit wrong with me, but cancer is not one of them. But here comes the fun part everybody. My medical bills just started arriving and I'm going to tell you two real bills I opened back to back. The first one, $242,000. The second one, $116,000. And I opened those, looked at them and just went, that's not real money. You might as well have told me that I owe six unicorn horns and three narwhals because clearly we are frolicking through the rainbow forest of imagination land. If they had told me that I owe $19,600, I'd be terrified because that's actual money that would cripple me. But $350,000? Sure! Take it! In fact, walk outside in your office right now, I'm flying around on a magic carpet dropping sacks of gold all over the city. Maybe one of them will hit you. $350,000? I'm not worried about it. I'm not, because here's what they don't tell you about medical bills, everyone. They're fake! You don't have to pay those! See, if I don't make my car payment, somebody will come and repossess my car. What's the hospital gonna do? Repossess my health? What are you gonna do, hospital? Are you gonna send big scary guys after me to break my legs so I end up back in your hospital and don't pay those bills? Has anyone here ever been in a staggering amount of medical debt? Clap your hands if you ever have been. Okay, right over here. How much was it if you don't mind me asking? $200,000. Did you pay it? No! Of course you didn't, because they're fucking fake! You don't have to pay those! She's sitting on a comedy show on a Monday night without a care in the world! Nothing's gonna happen to you! Now, people have argued with me about this. One person said, that's not true. They will take your house. What house? I'm a millennial in California. I can barely afford to listen to house music. Someone else said they will garnish your wages. Okay, one problem. I don't have a job. I get paid in drink tickets. Do you want me to tear one in half and we can split a vibe? Cassota? Now, I think we can all agree, it's never a good time to get cancer. But my timing was particularly nefarious, because my wife and I were in the process of trying to start a family. And so she rushed me to a fertility clinic so I could free sperm before I started chemo. Now, I have to tell you, my wife was already very concerned about my virility. Because I've smoked pot pretty much every day for 23 years. She does not smoke weed. So she read an article that said, if you get stoned all the time, then your sperm are also getting high and they might get distracted and not know where to go. As if my sperm are going to be on their mission to fertilize her egg and then one of the front goes, what? Fish is doing three nights at the labia? Turn around everybody, we go this way now. Only one gets in the clam, but tonight we all get to jam. Then the cum drips down her leg for 28 minutes longer than you thought it was going to. Is that still the same road? If you ever have to go to a fertility clinic, I'll let you know this. They do not appreciate humor at all. The nurse gave me a plastic cup and a brown paper bag and I said, oh, I don't need the bag, I'm dining in. I got nothing from this woman. It's 9.30 in the morning, she already had a better joke than that. Next day, doctor calls me and I'm a little nervous, but he starts the conversation by saying, Mr. Hooper, your sperm, it's unbelievable. Go on. He said a normal sample of your size on the low end, we're looking for 30 million sperm. You had 390 million. And I heard that number and thought, is that dangerous? That sounds like way too many. It's got to be crowded in there. That means if you're a normal man with a regular level of testosterone, between your legs, there is a gorgeous farmhouse on 60 acres. The crops are harvesting, there's horses running by a lake at sunset, it's serene, it's majestic. I have section 8 housing happening down here. There's just millions of families crammed together, stacked on top of each other. When I finally do impregnate my wife, word's going to get down to all the other survivors and they're going to be like, no way, no one's ever made it out of this hood. If Ronnie made it, we can all make it. This is what we were hoping for. Now here's what I can't stop thinking about. For the last 10 years, my wife has had an IUD, an introwuturin device. We've never once had a pregnancy scare. Think about the workload that little piece of copper put in over that decade. It should have retired on day two. This was not a single-use revolver. This was an AK-47 just blasting kids, just baa-baa-baa-baa-baa-baa-baa-baa-baa-baa-baa-baa-baa. I swear when her OB-GYN removed it, she took it out and said, I've never seen one dented before. What did you do to this thing? That IUD stopped billions of my bullets over the years. It was the last line of defense. It reminded me of that one security guard at the January 6th insurrection that didn't abandon his post. Everybody else fled the building and one guy was like, No way! No one's getting in here today! You with the horns, back up, feet off the desk. That IUD was Hodor. Millions of fiery demons are blasting through that tunnel, hell-bent on destroying civilization, and one guy's on the other side going, Hodor! Hodor! Hodor! Hodor! Hodor! That IUD is now framed on my mantle, and I salute it every single day. Guys, I hate to tell you, but it looks like I'm going to be alive for a while. Hug your friends. I love you so much."
}