{
    "url": null,
    "title": "“People Think Scissoring Doesn’t Exist…” - Kylie Vincent - Stand-Up Featuring",
    "transcript": " It's good to be in LA. I've been doing a lot of shows in the South, and they're ugly there, so. You guys look a lot better. That's good. I also like the LA. You guys are all about dogs here, because I have a dog. She's disabled. Her back legs don't work, so she's in a little wheelchair. Super cute. Super hard to get cat called when you're walking a disabled dog. People will stop and talk to me, though. They'll go, oh my God, God bless you. This is so nice of you, God bless you. And I'm just like, how do you know that I didn't do that to her? I'm like a Republican dad. I'm like, she was acting out, you know what I mean? She doesn't use the wheels at home, so she'll just kind of like squirm around. So I like to bring people home for the very first time, walk in, see her, and go, oh my God, what happened to her? And I'll be like, just kidding, you still wanna have sex with me, though? I have a friend in a wheelchair. So I like to see how people treat them differently. My friend in a wheelchair, people will stare at her and she'll catch them. And they'll be like, oh my God, I just, I love your shoes. And then people will stare at my dog in a wheelchair, and they'll be like, oh my God, she's so fucked up, that's crazy. How does she go to the bathroom? I'm like, I have to squeeze her like a Capri Sun. You wanna ask her the same thing, or are we good? I'm also, I'm Gen Z, so I went through the dare program. Did you guys go through? Yeah, yeah, yeah, it worked, right? We're all good. I never done drugs. I remember like, they didn't do it right. I remember sitting there and they were like, don't do drugs, and definitely do not huff bleach. I was just sitting there like, I didn't know you could huff bleach. I'm gonna fucking huff bleach, okay? They brought a school bus to my school, they decorated the inside like a mouth full of cancer. And they're like, yes, this is what happens when you're an adult, which we know, that's not what happens. They should do more realistic adult shit to scare us. Like we should walk onto the school bus, and they should be like, turbo tax. Figure that shit out, okay? I feel like they didn't teach us anything realistic about being an adult. Like they spent so much time in health class, teaching us about STDs, like I've had enough sex to know that's not real. All right, you guys got that late, that's good. Yeah, let's keep up, okay? I feel like they didn't teach us anything. Like no one said when you're an adult, like you don't necessarily wanna kill yourself tomorrow. But every time you get behind a car wheel, you're just like, wouldn't it be crazy if I crashed this car? Wouldn't that be fucking nuts? And your passenger's like, yeah, are you gonna crash this car? They're like, no, but that'd be fucked up, right? Better be a good passenger. Because like every time you go to the doctor and you're like, hey, I'm gonna kill myself, they're like, oh, here's this pill. The side effects are you may wanna kill yourself. I'm like, oh, can I try a different one? They're like, oh, yeah, yeah, this one, this one makes you fat and ugly and you're still gonna wanna kill yourself. I'm like, if I'm gonna kill myself anyway, I'd like to be hot. Like open casket at the funeral. People are coming up like, whoa, she's so fucking hot, why'd she kill herself? Make people question necrophilia. What, I didn't say that, shut up. I'm also, I'm queer. All right, you guys are so gay, shut up, seriously. Who's gay in here? Yeah, who's straight? Don't move for that, that is homophobic. You piece of shit. Okay, the rest of you didn't answer straight, but watching Gay porn for sure. I tell people I'm queer and they'll be like, what does that mean? And I'm like, oh, it means I'll date anyone. And they're like, oh, so you date Hitler? You know, those people. Like in middle school, I said I was against a death penalty and some girl was like, oh, so you wouldn't kill Hitler? I was like, no, I'm like 13. And that guy has like an army. So also I'm Jewish, but like, that's not why I wouldn't date Hitler. I don't like dudes with mustaches. Girls are really into that now. They'll see like an ugly dude by his a mustache and they'll be like, he's so fucking hot. And I'm like, yeah, he's literally Hitler. I was also like a really homophobic towards myself before I came out. Like before I claimed I was straight and I'd make out with women and be like, this is just for fun. But now I've embraced it. So I'm like, this is serious business. This pussy's serious, okay? First time I hooked up with a woman, she tried kissing me good morning the next morning. And I was like, bro, are you fucking gay? What are you doing? Also people think scissoring doesn't exist. It exists. It's just like so hard to do. Oh my God. I have never felt more like gay people shouldn't have rights than when I was trying to get into that position. I was like, okay. Yeah, God did not intend this for us at all. But like, I still like to date straight men because like I like watching them learn things. I was dating a guy. His face was so dry, he was molting like a rattlesnake. I was like, oh, here's some lotion. And he's like, babe, you changed my life. And I act like a girl. I'm like, yeah, there's lotion everywhere. So I don't even know what he was doing before. He didn't cook meals. I don't know how he fed himself. He was just like in trash cans, like a raccoon, which makes sense because that's how he ate me out. He's just dumpster diving. It's not a joke about my pussy having garbage, by the way. It's about him not making me come. Okay. Also, okay, I lived out of a car for a year in the fun way, but not like in the TikTok way. You know what I mean? They're like, build this van for only $100,000 in your parents' driveway. I'm like, get a house, you idiot. No, I like piston buckets, okay. Growing up, my mom was like really an agenda rule. She's like, a man should be in the house to do things. Women shouldn't have to do that stuff. And I always thought that was really messed up. And then I lived out of a car and I'd do stuff on my own. And I was like, yeah, men should do these things. Honey, come clean my piss bucket. Also, every time I suck dick, I feel like a war hero coming home from war. I go home, I look in the mirror and I'm like, Kylie, you fucking, you suck that dick, okay? Or America. Cause sucking dick and being a war hero is the same thing. We both can't explain why we're there. We're there for like way too many years. And we started young hoping it would pay for our college. Sometimes I'm down there so long, I'm drafting a letter home to my family. I'm like, dearest family, rations have been running low, but Morales high. Just kidding, he just bombed inside my mouth. You guys are pussies. When I was 14, I read in the magazine it said, when you're sucking dick, make noise so they know you like it. Yummy dick. It's not blooming onion, it's dick. I didn't use a gift card for this shit, okay?"
}