{
    "url": null,
    "title": "“She’s So Horny for Me It’s Insane” - Laura Peek - Stand-Up Featuring",
    "transcript": " I got hit on today, you guys. Thank you so much. She's still got it. Can we agree, gals, that sometimes it feels good to be hit on in public? Sometimes you got a little outfit on. You're excited. You're like, yeah, let him murder me. You know, it's cool. Sometimes it feels good. Sometimes it feels really bad. I've got a new move for you for when it doesn't feel good. This is foolproof. OK, a guy's hitting on you. You don't want to talk to him. You're walking on the street. He hollers at you. Makes you take your little air pod out or whatever the hell. And you just turn around and you go, oh, I'm so sorry. I don't have any change. He will lose. He's fucking mine. OK, they hate it. I've just started keeping, like, pocket pussies in my back. Probably I'm like, that's all. Just the flashlight today, sir. Sorry for your loss. God bless you. God bless you. I do like being hit on in California. It's different than being hit on in the South. I don't know if anybody's ever experienced that before. They just kind of say whatever, you know? The last time that I got hit on in Tennessee, I'm walking down the street in my hometown. This man in a truck pulls up. He rolls down his window. He did it like this because it was the 1940s. He rolls down his window and he just goes, bam. They have some stupid titties. Which? It's almost more mean than it is horny, don't you think? Look at those dumbass titties. I bet those titties had to study twice as hard as the other titties in their class. Look at those University of Phoenix de Vries titties you got, girl. Those titties had to read with their finger, just sound it out. I love being from the South. I learn new things about Tennessee all the time. I was on the phone with my mom the other day. She told me something I didn't know. She goes, Laura, did you know that Tennessee's state drink is milk? Is that the sickest shit you've ever heard in your entire life? I think the only thing funnier than our state drink being milk is that that was decreed in 2009. Strayke was odd. We're in the midst of the biggest financial crisis any of us will ever see. We have our first black president in the Tennessee General Assembly. He's just like, y'all know what I can't stop thinking about right now. Shoo, just a big honking glass of 2% on a hot summer's day. Sticky. I have a fantastic mother. I talk to my mother every day. Who's got a good mom out there? All right, good for you. Well adjusted crowd. I love my mom so much. I hope you guys don't get mad at me for this or think I mean. Good moms, best thing you can have in your entire life, right? They teach you your values, teach you right from wrong, teach you how to treat people. They are kind of desperate though. You know what I mean? That woman is obsessed with me, OK? The way that your mom feels when she sends you a text is the way that you feel when you text someone you want to have sex with. It's exactly the same feeling. You're just sitting the risk you want to put it down right away. She's like, ah, hope she hits me back. She's so cool, you know? 10 minutes go by, she's like, she's probably texting other moms. Shit. Why wouldn't she be? She's so hot. You get a good mom on the phone? Forget about it. You're never getting off the phone. I've been on the phone with my mom for the past 85 years. She's on hold right now. At the end of a phone conversation, my mom starts to sound like a comedian who's having a bad set. She's just like, all right, what else? What else? What else? Let's see. What do I want to talk about? What's in the news? She's just flipping through her notebook. It's just my name and heart's over and over again. She's got her little legs kicked up behind her. She's so horny for me. It's insane. That woman will say absolutely anything to keep me on the phone. The other day we were on hour 19 of a phone conversation. I was like, mom, I have to go. I have a life. And she goes, I'm pregnant. It's yours. I'm keeping it. I'm like, what the hell? You got a hysterectomy. Thanks for laughing at my mom's hysterectomy. She's doing well. I've been trying to get a little better mentally this year. I got medicated this past year, you guys. Yeah. Thank you so much. I don't want to do a whole PSA thing for you. If you feel like you need an anti-depressant, you do. You are a burden to your family and friends. They're tired of listening to you. It's time. It's been time. It really did change my life. It has absolutely saved my life. I'm happier than I've ever been. You deserve to be happy. Do it for yourself. If you need to. Thank you. It is messing with my stomach in a way that I can barely describe to you. I went to talk to my doctor about it. And she said to me, and I quote, diarrhea is a small price to pay for happiness. I was like, that's beautiful. Is that from something? Wow. You're a poet. Robert Frost. Walt Shipman, you know? I'm like, I'm not going to be happy. I'm not going to be happy. I'm not going to be happy. I'm not going to be happy. I'm not going to be happy. I'm not going to be happy. I have been doing a little bit better mentally. You're not supposed to drink on any depressants. I'm a pretty big drinker. Hard to get an energy. It is not my fault that I chose a job that you can be good at while you're drunk. OK? I didn't make the rules about that. There are only like three jobs like that. It's like comedy, working at a bowling alley, and being a dad. Those are the only three things. Am I wrong? You can have a pretty chill drunk, Dad. Drunk moms do not have that luxury, do they? Drunk mom never looks good. She's always like swaying in the corner to a Billy Joel song. You know, she's like, ugh. Just accidentally ashing into her Chardonnay. You know what I mean? She's always kissing your friends, like not on the mouth, but like right fucking next to it. You're like, oh. Stay away from Kyle, mom. I've seen the way you look at him. I read something interesting about women's mental health recently. It's an article. It said that women for their mental health need to masturbate 25 times a month. 25. I was like, all right. I'll try to cut back. Bit of an overachiever. I've been excited. This past year really was one of the biggest in my life. I got engaged last year. Yeah. Man that I've been with for eight years asked me to marry him. I'm so excited. We've been having a lot of fun sex since. Please give it up for me, you guys. It's been good. It's been good. We've been getting kind of adventurous lately. We've been using some toys in the bedroom. Round of applause. You like a toy in here. All right. She's sitting on a vibrator right now. Look at you. You're gorgeous. She's glowing. I love it. I've been with guys that don't like it. OK. I think it could be kind of emasculating sometimes. I was once using a vibrator during sex with an ex-boyfriend. And in the middle of it, he just goes, I just feel like you don't even need me here right now. I was like, here's the thing. I absolutely fucking don't. Of course, I don't need you here right now. Call me when you're dead. Can do this shit. You know? So fast you can't even see it. You know what I mean? Like a friggin' homingbird. Give me that homingbird dick or get the hell out. That's what I always say. OK? Only lesbians and vibrators can do that. Right, girls? You look beautiful. OK. I trust him very much. I think that's the most important thing in a relationship, right, to trust somebody. Women. I want to ask the women in the room a question. Guys, close your eyes for me for just one second. Close them up tight. We just stab them all in the neck. I'm just kidding. OK. Just fly off the stage like a vampire. Just like, oh, no, no, no. OK. Gals, show of hands. You ever made the mistake of looking at a boyfriend's like search history on his phone or his computer? There she is. Everyone. No, I'm not pointing at good. OK, good. A lot of crazy bitches in here. I used to do this all the time. Gals, I just want to say, if you haven't done it, don't frickin' start now, OK? You're never going to find what you want in there. It's never just going to be like, I just love sweet girlfriends so much. How to kiss my girlfriend better, you know? Rebecca's eyes in the moonlight. That's never going to be it. I once looked at an ex-boyfriend's search history on his computer. And I don't know how else to say this, so I'm just going to say it. This man had recently googled the phrase, girls licking ass out west. I don't know what the hell that means, OK? All I know is that I can't provide it to him. That's all I know. A little old girl from Nashville, Tennessee, what do I know about licking ass out west? I can do missionary in a cornfield or some shit. I'll give you a handy at Dollywood. The next thing about."
}