{
    "url": null,
    "title": "“So, You’re Not JoJo Siwa” - Abe Farrelly - Stand-Up Featuring",
    "transcript": " That's the thing about LA, it's always the prettiest people. I love it, because I'm not actually from here originally. I'm from New England, I'm from the Boston area. Anybody else? Yeah, there's a couple of us, yeah? Well, they let a lot of you in here with free drinks. That's fun. What a risky move. I have to say I'm from the Boston area, because if you say you're from Boston and somebody else is actually from the city and you're not, then they fucking hate you, you know? And I'm not from there, I'm actually from south of Boston. Not to be confused with south Boston, which if you're from there, you're probably pretty badass. Probably pretty cool. No, no, I'm from south of Boston, near Plymouth, like where the pilgrims came in. So how white are you? Yup. But now I live out in LA, I live here and it's a good place to live, because actually this past year I've been transitioning. I'm actually a trans man, yeah? Thank you. Thank you. I appreciate that, it's weird. I've only been transitioning the last year, year and a half, so it's still so weird for me whenever I tell the audience, I never know how you guys are gonna react. Sometimes I feel like it would be easier if I just came out on stage first and just had a quick gender reveal party, you know? Just pass out a bunch of cupcakes. We all take a bite at the same time, a little blue frosting in the middle. I'm like, oh, it's a boy. I actually just think every trans person, I'm not even part of my set, just a genius idea that every trans person should get to have a gender reveal party. Like it was blue the whole time. But I'm just kidding, I actually hate gender reveal parties, not for anything political, but just because I hate to see how excited the dads get when they find out it's not a girl. Like how fucked up is that? Every single time, they're just a little too, like let's fucking go, you know? Every time they see that blue confetti, they react like Maury just told them, you are not the father. Like someone's got a camera, they're like, yeah, let's go. They're way too excited. It's also weird when I tell you guys that I'm trans because I can actually see everyone's reactions. I can see all your faces and that's weird. Like the second I tell you, like half of you guys look surprised and that actually makes me feel really good about myself. But the other half of you are looking at me like, knew it. All right, you laughed a little too hard at that. You guys look at me like you're a judge on the mask singer, you know? Like I knew it, I knew it since the pilgrim joke. It's fucked up. And then there's always just one, then there's always just one person staring at me like, so you're not JoJo Siwa? You can laugh at that. I look like JoJo Siwa if she just never danced. Do you know how hard that was for me when she came out as gay? That was the worst day, like I was happy for her. I was like, good for you, okay? But that was horrible for me. It was like, that was basically what made me transition, okay? She came out as a lesbian and I was like, well, guess I have to be a man now. Cause I'm really just one rainbow bow away at this point. So I'm just kidding. Trans is not a choice, it's not a choice. It's so weird to me that people think trans is a choice. Like that's very bizarre to me. Like you think I was just living my nice cushy life as a diesel dyke in 2023? And then I just woke up one day and was like, you know what feels like a good idea? If I just became a straight white dude, that feels like it'd be a fun time. Just turn in my Volvo SUV, you know, go from there. It's not a choice, trans is not a choice. And anyone thinks that trans is a choice, I don't believe you've ever been into a men's bathroom. Okay? You think I would choose that life? It is disgusting in there. And I have to use the stall, right? And it's so scary, cause you know, every time I'm in there, I'm so scared. I have to, I don't feel like I have the quad strength to be holding up the whole time, you know? And I'm so scared of touching that disgusting toilet seat. I have to build an entire nest every time I just wanna take a piss. You guys know what you meant, no one's talking about nesting, we have to be in there. Nesting, you gotta build a whole nest cause I don't have the quad, I'm up there, it's like so scared. Every time I take a piss, I'm one toilet seat away from getting monkey pox, okay? This is not a choice, nobody would choose this. And what sucks is I have to use the stall, you know? I have to use the toilet, which is terrible because every time I go into the stall, it looks like I'm that dude that's pooping in the club. And nobody wants to be the dude pooping in the club, okay? So every time I go in there, I just pretend I'm doing cocaine and said, I'm just like, nope, not pooping, just doing lines, building a nest. Everything's fine, go around. Shit's not a choice, it's not. And it's weird too, it's weird being a trans guy, again, I've only been transitioning about a year or so now. Sometimes I'll even forget that I'm trans, like I even just forget that I'm a dude now, it's the weirdest thing. Like I was doing shows in the South recently, not a good idea, let's just start there. Let's just, by the way, the room went silent, I mean, I'm still here, so it's okay. I was, I hit up this liquor store after the show and it was a very, there's a weird thing about the, it was in Atlanta, the weird thing about Atlanta is that you could be in the nicest neighborhood, you take one wrong corner and you're like, the fuck is this, okay? That was in this weird liquor store and some guy came in and he started screaming at this security guard in there and they're yelling, he's creating this whole fight, so I just start minding my business. And all of a sudden I hear, hey, big guy, big guy. And I'm thinking, please don't let me be big guy. Please don't let me be big guy. And then I hear, big guy, I'm like, fuck, I'm definitely big guy. So just as like, to muster up all my courage, I just turn to him, I'm like, yeah? He goes, do you need help finding anything? And I was like, no, I'm all good, thank you so much. I was just looking for the Tito's, thank you. Big guy, I'll tell you what though, there's nothing more gender reaffirming than big guy, you know? That's how you know you're fitting in, like, hey, slugger, champ, but big guy. That's how you know you've made the club, all right? Cause someone calls you big guy, they're like, hey, big guy, you don't know what you're gonna get into. You're like, am I about to get in a fight? Am I gonna move a piano? I don't know. But I'm gonna answer the call, you know? The other day I was at Costco and some old lady was there, she was like, excuse me, you seem like a big guy, can you help me get the dog food? I was like, yeah, how many packs you need? That was like my moments, okay? I had a boner the whole time, little transponer, I was like, let's go. What do you need, three, four, five? Cause as a woman, you never wanna be big girl, you know? Imagine if that was like a switch scenario, I'm in Costco and someone's like, hey, big girl, can you help me get the dog food? That's just gonna ruin your whole month, you know? You never wanna be big girl. Oh yeah, she calls big girl. She'll move a piano. It's weird cause I've been on T for about a year now and all I've done is grow the spormits from mustache. And half the time I'm so fucking, I don't even know if I'm just hungry or horny, you know? It's confusing, but most times, either way it usually feels like a hot dog would help. See, that's a weird joke, but you guys laugh anyways. I don't even know what it means, but we like it. So I live in LA now, which is a great place to be for a trans guy, cause you could be anything you want in LA, anything you want, except for fat, but anything else, you can be it. Yeah, I gained so much weight on testosterone, I thought they were gonna kick me out of this city. They're gonna be like, sir, ma'am, sir, you gotta go. You could stay close by, but not here. Maybe try Anaheim, I don't know. But you can't stay here. Yeah, I do like it here though. I love LA, but LA is also the worst, right? It's the best city in the worst city. LA really pisses me off. The other day I saw recently that the LA Animal Shelters were posting that they were at max capacity, okay? They're at max capacity. And so they were like, look, we're gonna do 50% off for all dog adoptions, 50% off for cats, and 75% off for other. So I took the bait, okay? I perused this other category. Bunch of bunny rabbits, couple of sea turtles, and then I'm looking, I swear to God, I see it listing for a gray pigeon. A gray pigeon, okay? And they had a photo of this guy and everything, and he's like in the corner like, what the fuck? Let me out of flight in New York, it could be a normal pigeon, I swear. I'll never shit on anyone again. Like here's an idea for your max capacity problems. Have you tried just opening up the gates? Okay, just let them on free. Cause like first of all, if you go to the Animal Shelter to adopt a pigeon, you're a fucking serial killer. And second of all, only in LA, right? Only in LA does somebody see a pigeon on the ground and think, oh, somebody lost this. Like what was the process there? Did you scan them for a chip? Like a who, who, did you hang flyers? Do you see me trying to who? My voice can't go that high. Where are my other trans dudes at? Whoa, can't happen. Fucking weird place LA, it is. But again, I gotta be here as a trans boy. Big boys gotta live in LA. I feel like my whole family too, as a trans guy, a lot of trans people don't have like, their families aren't that accepting. I've got the best family ever. My family is awesome, they're very cool. Yeah, thank you. My family is very cool. The only people I feel for, I've got two nephews and a young niece. And my niece, her whole life, I've just been Uncle Abe. So it's nothing different. But my nephews, it's a little strange. Like my oldest nephew is 15. So he's a fucking asshole. He's a fucking asshole, okay? And they've known me before, so they're like, the fuck? But they're cool. And so when they came out to visit me about a year ago, right when I first started transitioning, I had just started T. So I didn't quite look like this yet. I still had titties, let's be honest. And my hair was even more bleach blonde than this. So I was looking like feminine, okay? And they came out, my two nephews came out to visit me and I was thinking, I'm gonna take them to Disneyland for their first time and I'll be the cool uncle and they're gonna love me. So I was so excited. So they come out and we go to Disneyland. And as we're going in, I noticed, as they're taking everyone's tickets, if you're a boy, they say, welcome, Prince. And if you're a girl, your journey awaits, Princess. Like everybody is Prince or Princess. And I'm like, oh boy, this should be interesting. I look over, my nephew's already noticed what's going on. He's amped up, he's like, ha, ha, ha. Go ahead, give him your ticket, the snow of the way in. I don't know why he sounds like an old Jewish man in my head, but he's a fucking asshole, okay? So they both go through, right this way, Prince, thank you, Prince. And the guy sees me and he's like, oh shit. And suddenly we're in this together, you know? I'm like, don't fuck this up for us. You got one shot, one opportunity, mom's spaghetti, let's fucking go. So he's all nervous, I'm all nervous. And then he just looks at me and goes, welcome, Jedi. So you hear that nephew of a fucking Jedi."
}