{
    "url": null,
    "title": "“This Is What a Grown Up Tomboy Looks Like” - Carmen Morales - Stand-Up Featuring",
    "transcript": " A lot of people don't know where I get my confidence from. They're like, how does this fat bitch do it, right? And I'm like, easy, dad, it's my birthday. Comment down. It's not always about you. Like any good comedian I did have a rough childhood growing up. You know, that's why I'm so good at this. Trauma when they got fun. I did a crazy dad growing up. And for whatever reason, whenever I tell people I had a crazy dad, they always want to tell me about their dad and their dad's never that crazy. You know? They're like, oh yeah, my dad's crazy. He drinks soda with no ice. Like he's crazy. But my dad was like, crazy. You know, like my dad came at me with a sledgehammer, tried to build a bomb to blow me and my mom up. I was raised by Wiley fucking Coyote, OK? Like my first words were meep meep. It was very exciting in the Morales households. And I don't want you guys to feel bad. Don't tighten up. Don't feel bad. Because I figured out a way to thwart my dad. What I would do is I would paint a tunnel on the wall, run through it, and then he would get hit by a train. It was hilarious. You know, well adjusted families play catch. We play catch the train. Same shit. When you're raised by crazy, you get some of it. I call it trickle down crazy nomics. I got a sco, sure. Some kids get trust funds, baby. I just got the issues. But they are trust fund size. Know that I could build generational wealth with the amount of trust I don't have in any of you people. I'm also a broad. If you didn't pick up on it yet, a chick, she, her, whatever word you want to use. I'm very bad at it, obviously, because I just referred to myself as a broad. Not a lot of chicks doing that. But I am a chick. I'm very bad at it. I've been trying to fend it up. You know, like I started washing my hair. I stopped wearing cleats. I'm working on it. Just always been this way. This is what a grown up tomboy looks like. And for some reason, I always thought that there was something wrong with me. I always thought that there was something that didn't feel right. And it turns out there is. Yeah. I got this stuff called the Polycystic Ovarian Syndrome. Yeah. Please don't fall asleep. Very boring stuff. But all it means is that my body just naturally makes way too much estrogen, the female hormone, right? And then it compensates with testosterone. Like, I'm such a chick. I'm a fucking dude. I'm ODing on that gender right now, bruh. Like, I'm all of you put together. And to be honest, it's a lot. It is. It's like an ongoing Twitter feed. Both sides are yelling. One just in a wig. But they're both Michael Rappapour for some reason. You know? I'm like, what the hell am I getting yelled at for? I've never even been to Long Island. She's set alone to herself in a grocery store bathroom. It's a lot. It's almost like my body decided to start chemically transitioning and didn't let a bitch know. Because I'm idling. Right at about 25% guy, right? Which is just enough. Just enough to give you some sweet cyburns. Oh yeah, dude. I could connect if I want to. Sweet cyburns. Sweet cyburns and no boyfriend, baby. Because I don't know if you guys know this, but straight guys don't like banging other guys. And that's the vibe mama gives off, you know? That high T makes you go about it the wrong way. Like, I thought I was supposed to nut check you until you fell in love with me. That's what I thought. That's what I thought I was supposed to be doing. Yeah, just bullying the love of my life, you know? Just noogying my way into your heart. Like, when are you going to marry me, fucking nerd? Yeah, it turns out guys like it when you're nice to them. Bunch of pussies, I had no idea. Sack up, bro. Just trying to make out. Quit crying, dude. Damn. I like to look at the audience when I perform. And I do feel like some of you are having a good time. But we got a lot of indica motherfuckers in here, too. You guys need to. But I do. I like to look at people in the face. That was one thing I got tired of getting asked, what did you learn about yourself after everything we've been through? Like, what did you learn about you? Like, what did you learn about yourself? Fucking wha-ha-ha-ha-ha. And all I learned is that this is it for me, kids. That's all I learned. I learned that I am the celloist on this Titanic, baby. And know it was a pleasure playing for all of you. And I will be playing my symphony of dick jokes till we're all like, fucking dead. That's what I learned. So I love to look at people in the face when I perform. I love seeing you happy, smiling, having a good time. It makes me feel good, you know? We're jerking each other off here. It's nice. But for some reason, there's a certain kind of dude that refuses to enjoy me. And I don't know why. I don't know if it's because I come off a little too assertive on stage, you know? Maybe instinctually, they just know if we share to jail cell, mama gets the bottom bunk, bitch. Maybe that's what it is. Maybe that's what it is. But they always watch me perform the same way. They always got their arms crossed, furrowed, brow. They won't laugh. They grumble at me, you know? Bleh, bleh, bleh, bleh. You know what it is? They watch me perform like I'm suspicious. Like, what am I up to, dude? This is silly shit. What are you talking about? But it's always, they look at me the same way. They're always like, hmm. She looks like one of those equality bitches. You know what I mean? Like, that kind of look, that kind of, hmm. I don't know. She looks like she rapes back. I don't know about this bitch. Yeah. You're not entirely wrong, but I think it's the high T, baby. It's not me. When you're raised by crazy, you get some of it. You also attract it, too. Lucky for me, I'm attracted to crazy, so that's nice. It's true. Like, you know, everybody's got their category. Some people like feet. Some people like to dress up like chickens. Everybody's got their thing, you know? My thing is a sad dude. I love a sad dude. Oh. That's why I love living in Los Angeles, baby. I'm like, how those dreams working out, baby, huh? No, you're not a barista. You're a screenwriter. Yes, you are. Yes, you are. Oh, come cry on these soft titties. Everything's going to be OK. What? You guys don't hang outside at NA meetings? Like, you look like you've got no place to go. But damn, baby, what's up? I just want to be the rock, dear rock bottom. They like me back, too. I don't know why. I think it's because my milkshake bring the sad boys to the yard, and they're like, I just can't do this today. I just can't do it. I'm just going to watch the office for four days straight and not shower. Ooh. Yeah, you are. Give me that Paxle Dick! That's my favorite laugh out of the whole joke. Because the people that laughed have scissored a grown man. That's what I'm talking about. Yeah. Some of you seem confused. And the antidepressants make their dick not work, sir. So you just got to rub it on there. Like, give it to me. I don't give a shit. Rub it on there. Rub it on there. Look at me in the eyes. I'm like, I'm going to get a little bit of it. I'm like, I'm going to get a little bit of it. Look at me in the eyes. Just look at me in the eyes. You want to make him feel wanted? A lot of saddies in here really soaking it in. Hey. This is my favorite job I've ever had being a stand-up comedian. And it's not a bad gig either. You make about 200 bucks an hour. I worked about eight hours last year. So it's a give and take. You know, a lot of ups and downs, baby. A lot of swings. Just like poker. Real fun and unpredictable. I cry a lot, you know. There's perks to it. That's probably my favorite, you know, perks. Because my favorite perks are probably traveling because I just get to go places. And fuck strangers. And then leave. It's amazing. Especially for a chick with commitment issues. Like, I got, you know what I mean? Because I just come into town. Be charming and fun. Pleasurable company will ensue. And I'm like, all right, later I got to go back to LA. They're like, wait, no, don't leave. And I'm like, you don't want me to chase my dreams? And then there the assholes. See how nice? It's a pretty sweet setup. That's true. I think the other reason I think I have so much confidence is this is speculative, but I'll share this. I think the reason that I have so much confidence is at this point I am one of seven women that don't have HPV. I think that's what it is. I do. And by the way, if you got it, I'm not knocking you. If anything, I feel left out at this point. Because everybody's got it. And they always got a fun story about how it happened. I was hanging out with a group of friends. And two of my friends were going back and forth about how they got it. Like one of them made it cooler than the other. I don't know what it was like. Like an adorable little slut-off was happening. Like, oh, what, bitch? No, I fucked a white guy with dreads, 2016 Coachella. I am disgusting, OK? Oh, whatever, whore, you think that's bad? I fucked my assistant manager in the freezer of a little Caesars. OK, screw you. And I'm just there like, guys, I fucked two. I just fucked nerds. You know, they're safer. Statistically, because the number is lower. It's like, it's like, it's like, it's like, it's like, it's like. Calculated risk, you know? But I think it's like an energy thing. You know some people have big dick energy or whatever. I think I just got that clean pussy confidence. I think that's all it is. You know, I'm just walking around knowing what I'm slinging. That's all. I mean, it sucks because I have AIDS. But I feel like that's different. That's an immune system thing. My immune system's dirty. My pussy's really clean."
}