{
    "url": null,
    "title": "“This Is a California Mullet” - Saul Trujillo - Stand-Up Featuring",
    "transcript": " I'll let you know, my name is Saul. Uh, I don't care about pronouns. Don't get mad, it's just me personally, because I got called ma'am from behind the other day, and I didn't correct anybody. I left that shit out in the ether. I was at a Burger King. I was like, ma'am, your fries are ready. I didn't turn around and go, uh, I'm a boy. No, I said, give me those goddamn fries. And I walked out of that place with my head held up high, like the bad bitch I was, all right? So sorry if you've never had Lizzo energy as a man, but I had it. I knew what it was like. I feel immortal in 2023. That's what it's like. That's what it is. And let me go ahead and explain this mullet so your eyeball will stop doing that thing right now. Like, what's that about? I don't know that. I have to explain in LA that I'm not from Texas. I got Texas, like, nah, man, this is a, this is a Golden State mullet. This is a California mullet, all right? Not from LA though. I'm from Stockton, California. Anybody heard of it? A couple people, a couple people, the rest of you? It's just a cherry picking mullet. This mullet is very agricultural, all right? And what do they say about mullets, everybody? Business in the front? It don't work like that with this face. With this face, it's very much missing child's poster in the front and then guy who kidnapped that kid in the back. I just want to see my kids, please. Let me play Legos with them, please, no? Okay. I'm also, I'm first generation Mexican. Yeah, there we go. Yeah, my father, he was an illegal immigrant. He hopped the border, he touched America, he said, safe, okay? No takes, he's back, he's home base. Home base, I say. Here's how Mexican I am. On my father's deathbed when he passed away, he left me a salsa recipe on a barn African. It was some Harry Potter shit, you know, it was like magic trick to a scroll. Me, ho, write it down, I got it, cilantro, I got it. This seems important. I'm only trying to build up how Mexican I am to let the rest of you know. I'm ashamed. I still love Taco Bell with everything I have in my heart. Yeah, the white people are willing. That's fair. That's fair. I see some very Mexican things like, I don't know about that. Like if you're a cholo with a Raiders tattoo, you're a Latte Taco Bell. God bless you. God bless you. You're an American citizen. But I, you know, I have people in my life, they find it problematic when I go to places like Taco Bell. They get mad at me, they go, why would you do that? You could be eating real Mexican food right now. And I have to explain to them, I have real Mexican food, it's in the fridge. My mom made it, but every now and then my dad was very accepting and cool. You guys want to go get some crunch wraps? Because he understood the Taco Bell is like the Beastie Boys, you know? It's not authentic, but you can't deny talent. That's pretty good. I mean, it's economically priced food for drunks and poor trash, you know? And you need it, there are haters out there that besmirch Taco Bell's name by doing studies that state a bunch of shit like facts. Because apparently, apparently a percentage of the Taco Bell meat is sand. We knew. I mean, it's called ground beef. It's the ground plus beef, okay? What are you not reading it? Ground beef? There it is. Ground beef. I read it. I can read, you know? And this burrito cost me $2 today in 2020. You got to be cutting it with something, you know? Thank you for not being fentanyl. Let it be sand. If I'm being honest. I'm happy I'm here. I'm married, man. I married my best friend. I love my wife. She's the best. Thank you. Couple odds. Couple odds. I'm in an interracial relationship. My wife is white. And here's the thing. We've been married for three years, but I'm still not used to being with a white woman, you know? We grew up with friends in a nice neighborhood behind a gated community. And the friends from my neighborhood are a different type of gated community now, alright? So it's just different, you know? I don't mean to generalize. Or at least I don't want to generalize. But at least with my wife, it feels like white women love to hit you with fun facts every single day. And I'm not used to that. I'm used to the Mexican women. They just love to hit you, alright? There's no Snapplefack lid bullshit, you know? Did you know? Fuck, I didn't know. I didn't want to know your fact about platypus. It's that you sent me via TikTok. Thank you. She's also passive aggressive. My wife, she hit me with what I thought was a fun fact, but it was a passive. She's like, did you know that if a couple has been trying to have a baby for two years and no baby has happened, they should go see a fertility doctor? Yeah, I don't know if you could tell by my personality. I'm like, oh, that's cool. Thank you for letting me know that. And she was like, we should go see a fertility doctor. And then I was like, we've been trying? I've just been fucking, who are you talking about? I've been trying to come this whole time. Wait a minute, we don't got to see a doctor. You're going to have to give me another chance, alright? These pumps will have intent. I promise. I thought these were recreational games. I didn't know where you're keeping score, you know? And I'm not saying it's her, but I know it's not me. I'm Mexican, I'm down to the stereotype. I have a deal, I have an uncle, I swear to God, I am two years older than... You do the math on that type of fertility. I'll jerk off on doing a dead plant, it'll come back to life. With stronger leaves, like yeah, I know, look at that. Yeah, it was a rose, but it's a pepper plant now. I don't know. I don't know, I have powers or some shit. Now we're thinking about kids. She says that I'm sexist, that anytime we talk about our hypothetical child, I'll go he, him. I don't know if it's because I'm Mexican or a millennial, but I guess I want a boy. I want a boy real bad, but if we had a girl, I'd be amazing too. But I'm gonna be honest, if we had a girl, I wouldn't lose hope on having a boy, you know? Doctors like congratulations, Mr. Trujillo, it's a girl. I'm gonna go for now, you don't know, alright? It's a new world, doc. You're talking about science? No, I'm a gambling man. And you don't think little piece of me downline hopes my daughter doesn't come up to you? Bye bye, I got something to tell you. What's wrong, sweetheart? I want to be a boy. I go, goddamn right you do. Welcome to the team, you know? And then I got secret gender reveal fireworks I've been hiding. And then Blue Confetti comes down, it's me and my new son have cigars, you know? Get over here. Mwah, kiss them, you know? Some of you, I got tested last show, they're like, well you're probably still sexist. What happens if you have a boy and he wants to be a girl? And I'll just let you know, it'd just be different. Just be different. Say my son, he's at a high school party, he's drunk, he's high, he's 16, he's trying to get the curds to tell me and his mom something important. Wakes me up in the middle of the night, dad, I want to be a girl. And as I'm wiping my eyes, I thought, well you're grounded. Nah, she's grounded, because no daughter of mine's going to be out there partying all night, alright? You're my sweet baby angel and we've been worried sick, you know? Like get over here baby and then I caress her mustache face and then she goes to her room and she hangs up her letterman jacket. I'm like, I love you sweetheart, you're the best. God bless my wife, she's the best. I mean, she fucks me, so God bless her. Do you hear this voice? Imagine this voice in any sexual scenario. Yeah girl, get over here. That's not good, that's not nice. It's nice to say to a lady. And I'm trying to lose weight, when I first started comedy I was 430 pounds, now roughly 295, you know? Sure, sure, sure. Clap away, it's not for health. It's so I can fuck better, okay? I have a responsibility now, I am married, alright? It's not like trick the one night stand on to the next, you gotta lay in that disappointment, alright? I want this belly gone. I know we're supposed to be body positive, but it's hard to make love as a man with a belly. Every time I make love to my wife, I gotta hold my belly back like it's about to fight someone outside of a night club. You need to take it easy, okay? You need to take it easy, they're not gonna let us in, I'll choke you out, alright?"
}