{
    "url": null,
    "title": "“There’s So Much Drama in My Life” - Dylan Adler - Stand-Up Featuring",
    "transcript": " Oh my god, this is awesome. I'm happy to be here. I'm gay that's gonna be really big for this But but first I just kind of want to do some very quick impressions that reveal a little bit about me I'm just gonna get right into it. Here we go. Here's the very first impression I am something to say! Us, allies, have to do better! That was me at my high school's gay straight alliance. This next one I'm gonna do, that's real. This next one I'm gonna do is insane. That was my grandma after I came out to her. Oh my god. Total fag hag. This next one I'm gonna do is really personal. That's me talking about my roommate in zoom therapy. Sam Morrison. This next one I'm gonna do is also extremely personal. There's two sides to every story! That's my roommate during my zoom therapy. Sam Morrison. But you know a little bit about me. I am gay. I have an identical gay twin brother. Where's the pilot? You know me and him we are very close and I think it's because we were actually the very first people that we ever came out to you know sophomore year of high school. He came up to me and he was like Dylan I don't know I I think I might be attracted to guys and I was like ew don't ever say that again! Bag it? No. But then a year later I was like same. So um it's our story you know we came out to our whole family. I came out to my mom and when we did she was literally so excited and having two gay twin sons quickly became her whole personality. Like one time she opened the fridge and beans fell out she was like there's so much drama in my life. She's like Asian Michelle Visage all the sudden except one time in 2004 we were all watching American Idol she was like more like gay we were like what? Other than that she's an ally. It was a different time you know. But my brother and I were close not just because we were both gay we both wet the bed until we were 17 years old. Where's the record deal? No um it's embarrassing. We both wore this device called a PL arm no no one knows what this is I'll explain. It's a device that we attached to our underwear and when we wet ourselves it would jolt us awake sounding like a police siren. But my brother and I were such deep sleepers sometimes both of our PL arms would go off and we were just asleep so one night our mom burst in she was like gays I was just sucking your dad's cock and both your alarms woke up your sister go pee my faggot. She's so quirky you know she's like I should be in euphoria you know but but it gets better you know um I'm in therapy who hears in therapy oh yes I love to hear that I I love my therapist so much but I feel like she still doesn't know that I am fundamentally evil. You know she's like it's trauma I'm like I'm Jafar haha you know and like in therapy you're supposed to like take care of the inner child and foster the inner child and I really want you but sometimes my inner child is like your mother sucks cocks and hell faggot I'm like we'll circle back we'll circle back Gertrude that's his name but you know I've been extremely vulnerable with you all tonight and I'm gonna end on an extremely vulnerable thing I'm gonna I'm gonna do a song about something that actually happened to me three weeks ago it's very fresh and raw and vulnerable but please laugh because that's my only sense of self worth hit it. I just drunk messaged my bully on Facebook asking him why'd you do it it was 12 years ago but it still fucks me up to this day sometimes before I perform I think who the hell do you think you are you're just an annoying twink asking far too many questions in math class shut up I have rehearsed how I'd curse out my bully I have if I could turn back time because the way I responded in high school was stop and now I see him on Facebook he seems to be doing relatively well he has a girlfriend yeah I hope my bully chokes on a thousand chokes I hope he chokes on a chode and then chokes on another chode I hope his face is disfigured from how many chodes he has to choke on I'm sorry Michelle Obama I'm not rising above this time I go lower the reason why I'm doing comedy is because the bullying made me want to become famous so I tried out acting singing dancing tap dance gymnastics and magic but the one thing that stuck was comedy but I really don't give a shit what art form it is just so long as I get famous to prove the bully's wrong I don't give a shit about the craft I hope my bully gags on a thousand peens different word peen I hope he chokes on a chode while he sees me in the Shang Chi sequel I hope he sees me on Oprah Oprah's like were you bullied I'm like yes I was then I face the camera and say John I hope you're enjoying that chode Super Soul Sunday as a side note if you dislike me you are inherently homophobic if you don't like my set you are not on the right side of history if you're gay and you hate me you're racist if you're a queer person of color and you hate me you're jealous and also racist oh my god he just saw my message and he's responding this is what he said Dylan I'm sorry in high school I was insecure and it took it out on you I feel really bad anyway I know you're doing comedy how's that going and I was like good yes comedy is going good I'm actually doing comedy central it's kind of nice the reason why I wrote this song is because I wanted some good to come out of the bad the next thing I said was I forgive you just kidding it still fucks me up every day someone on twitter called me dollar tribo bird I'm in a tree I still hope that you drown in a sea of foreskin I hope that you are run over by a militia of uncut dicks I hope the devil's like I'm a fan of Dylan's comedy while you are burning in hell this song is not about rising above because there is a wound within me that will never believe you"
}